<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf-8">
    <link rel="stylesheet" href="assets/style.css?t=90051322">
    <link rel="stylesheet" href="https://ricostacruz.com/docpress-rsc/style.css">
    <link rel="stylesheet" href="extra.css?t=5c8ec47c">
    <script src="assets/script.js?t=93f1a66c"></script>
    <title>Design Principle - Sankom Design</title>
    <meta name="viewport" content="width=device-width">
  </head>
  <body class="-menu-visible">
    <div class="doc-layout">
      <div class="toggle menu-toggle js-menu-toggle"></div>
      <div class="menu toc-menu">
        <ul>
          <li class="menu-item -level-0 -parent">
            <ul class="submenu">
              <li class="menu-item -level-1"><a class="link title  link-index" href="index.html">Sankom Design</a>
              </li>
              <li class="menu-item -level-1"><a class="link title  link-getting-start" href="getting-start.html">Getting Start</a>
              </li>
              <li class="menu-item -level-1"><a class="link title -active link-design-principle" href="design-principle.html">Design Principle</a>
                <ul class="headings heading-list">
                  <li class="heading-item -depth-2"><a class="hlink link-contrast" href="#contrast">Contrast</a>
                  </li>
                  <li class="heading-item -depth-2"><a class="hlink link-repetition" href="#repetition">Repetition</a>
                  </li>
                  <li class="heading-item -depth-2"><a class="hlink link-alignment" href="#alignment">Alignment</a>
                  </li>
                  <li class="heading-item -depth-2"><a class="hlink link-proximity" href="#proximity">Proximity</a>
                  </li>
                </ul>
              </li>
              <li class="menu-item -level-1 -parent"><span class="title">Guideline</span>
                <ul class="submenu">
                  <li class="menu-item -level-2"><a class="link title  link-guideline-navigation" href="guideline-navigation.html">Navigation</a>
                  </li>
                  <li class="menu-item -level-2"><a class="link title  link-guideline-layout" href="guideline-layout.html">Layout</a>
                  </li>
                  <li class="menu-item -level-2"><a class="link title  link-guideline-element" href="guideline-element.html">Element</a>
                  </li>
                  <li class="menu-item -level-2"><span class="title">Plugin</span>
                  </li>
                  <li class="menu-item -level-2"><span class="title">New Account</span>
                  </li>
                </ul>
              </li>
              <li class="menu-item -level-1 -parent"><span class="title">Visual</span>
                <ul class="submenu">
                  <li class="menu-item -level-2"><a class="link title  link-visual-color" href="visual-color.html">Theme</a>
                  </li>
                  <li class="menu-item -level-2"><a class="link title  link-visual-grid" href="visual-grid.html">Grid</a>
                  </li>
                  <li class="menu-item -level-2"><a class="link title  link-visual-font" href="visual-font.html">Fonts</a>
                  </li>
                  <li class="menu-item -level-2 -parent"><span class="title">Icon</span>
                    <ul class="submenu">
                      <li class="menu-item -level-3"><a class="link title  link-contribute" href="contribute.html">Contribute</a>
                      </li>
                    </ul>
                  </li>
                </ul>
              </li>
            </ul>
          </li>
        </ul>
      </div>
      <div class="body page-design-principle">
        <div class="header-nav">
          <div class="right"><a class="iconlink" href="https://github.com/sankomdesign/guideline" data-title="sankomdesign/guideline">
              <!-- span.title Open in GitHub--><span class="icon -github"></span></a>
          </div>
        </div>
        <div class="markdown-body"><h1 id="design-principle">Design Principle</h1>
<p>&#xE41;&#xE2A;&#xE19;&#xE04;&#xE21;&#xE19;&#xE33;&#xE2B;&#xE25;&#xE31;&#xE01;&#xE01;&#xE32;&#xE23;&#xE02;&#xE2D;&#xE07; <a href="https://en.wikibooks.org/wiki/Graphic_Design/Principles_of_Design">Design Principles</a> &#xE17;&#xE35;&#xE48;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE1E;&#xE37;&#xE49;&#xE19;&#xE10;&#xE32;&#xE19;&#xE02;&#xE2D;&#xE07;&#xE2A;&#xE21;&#xE2D;&#xE07;&#xE43;&#xE19;&#xE01;&#xE32;&#xE23;&#xE17;&#xE33;&#xE04;&#xE27;&#xE32;&#xE21;&#xE40;&#xE02;&#xE49;&#xE32;&#xE43;&#xE08;&#xE2A;&#xE34;&#xE48;&#xE07;&#xE15;&#xE48;&#xE32;&#xE07; &#xE46; &#xE21;&#xE32;&#xE43;&#xE0A;&#xE49;&#xE43;&#xE19;&#xE01;&#xE32;&#xE23;&#xE2D;&#xE2D;&#xE01;&#xE41;&#xE1A;&#xE1A; UI &#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE43;&#xE2B;&#xE49;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE2A;&#xE32;&#xE21;&#xE32;&#xE23;&#xE16;&#xE41;&#xE22;&#xE01;&#xE41;&#xE22;&#xE30;&#xE41;&#xE25;&#xE30;&#xE08;&#xE31;&#xE14;&#xE01;&#xE25;&#xE38;&#xE48;&#xE21;&#xE2A;&#xE48;&#xE27;&#xE19;&#xE1B;&#xE23;&#xE30;&#xE01;&#xE2D;&#xE1A;&#xE15;&#xE48;&#xE32;&#xE07; &#xE46; &#xE02;&#xE2D;&#xE07;&#xE42;&#xE1B;&#xE23;&#xE41;&#xE01;&#xE23;&#xE21;&#xE2D;&#xE2D;&#xE01;&#xE44;&#xE14;&#xE49;&#xE42;&#xE14;&#xE22;&#xE43;&#xE0A;&#xE49;&#xE04;&#xE27;&#xE32;&#xE21;&#xE04;&#xE34;&#xE14;&#xE19;&#xE49;&#xE2D;&#xE22;&#xE17;&#xE35;&#xE48;&#xE2A;&#xE38;&#xE14; &#xE17;&#xE31;&#xE49;&#xE07;&#xE19;&#xE35;&#xE49;&#xE41;&#xE19;&#xE27;&#xE04;&#xE34;&#xE14;&#xE17;&#xE35;&#xE48;&#xE40;&#xE23;&#xE32;&#xE19;&#xE33;&#xE21;&#xE32;&#xE43;&#xE0A;&#xE49;&#xE08;&#xE30;&#xE21;&#xE35;&#xE2A;&#xE35;&#xE48;&#xE02;&#xE49;&#xE2D;&#xE2B;&#xE25;&#xE31;&#xE01;&#xE14;&#xE31;&#xE07;&#xE19;&#xE35;&#xE49; Contrast, Repetition, Alignment &#xE41;&#xE25;&#xE30; Proximity</p>
<h2 id="contrast">Contrast</h2>
<p>&#xE2A;&#xE21;&#xE2D;&#xE07;&#xE02;&#xE2D;&#xE07;&#xE40;&#xE23;&#xE32;&#xE08;&#xE30;&#xE41;&#xE22;&#xE01;&#xE02;&#xE2D;&#xE07;&#xE17;&#xE35;&#xE48;&#xE14;&#xE39;&#xE15;&#xE48;&#xE32;&#xE07;&#xE08;&#xE32;&#xE01;&#xE02;&#xE2D;&#xE07;&#xE0A;&#xE34;&#xE49;&#xE19;&#xE2D;&#xE37;&#xE48;&#xE19; &#xE46; &#xE2D;&#xE2D;&#xE01;&#xE21;&#xE32;&#xE42;&#xE14;&#xE22;&#xE2D;&#xE31;&#xE15;&#xE42;&#xE19;&#xE21;&#xE31;&#xE15;&#xE34; &#xE44;&#xE21;&#xE48;&#xE27;&#xE48;&#xE32;&#xE08;&#xE30;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE2A;&#xE35;&#xE17;&#xE35;&#xE48;&#xE15;&#xE48;&#xE32;&#xE07; &#xE02;&#xE19;&#xE32;&#xE14;&#xE17;&#xE35;&#xE48;&#xE15;&#xE48;&#xE32;&#xE07; &#xE2B;&#xE23;&#xE37;&#xE2D;&#xE23;&#xE39;&#xE1B;&#xE17;&#xE23;&#xE07;&#xE17;&#xE35;&#xE48;&#xE15;&#xE48;&#xE32;&#xE07; &#xE40;&#xE23;&#xE32;&#xE08;&#xE36;&#xE07;&#xE2D;&#xE32;&#xE28;&#xE31;&#xE22;&#xE04;&#xE38;&#xE13;&#xE2A;&#xE21;&#xE1A;&#xE31;&#xE15;&#xE34;&#xE19;&#xE35;&#xE49;&#xE21;&#xE32;&#xE2D;&#xE2D;&#xE01;&#xE41;&#xE1A;&#xE1A; UI &#xE40;&#xE0A;&#xE48;&#xE19;&#xE01;&#xE32;&#xE23;&#xE17;&#xE33;&#xE43;&#xE2B;&#xE49; &#xE15;&#xE31;&#xE27;&#xE2D;&#xE31;&#xE01;&#xE29;&#xE23;&#xE2D;&#xE48;&#xE32;&#xE19;&#xE07;&#xE48;&#xE32;&#xE22;&#xE02;&#xE36;&#xE49;&#xE19;</p>
<p><img src="images/design-principle/text-contrast.png" alt="text contrast"></p>
<p>&#xE2A;&#xE35;&#xE02;&#xE2D;&#xE07;&#xE15;&#xE31;&#xE27;&#xE2B;&#xE19;&#xE31;&#xE07;&#xE2A;&#xE37;&#xE2D; (Foreground color) &#xE17;&#xE32;&#xE07;&#xE0B;&#xE49;&#xE32;&#xE22;&#xE21;&#xE37;&#xE2D;&#xE21;&#xE35;&#xE04;&#xE27;&#xE32;&#xE21;&#xE40;&#xE02;&#xE49;&#xE21;&#xE15;&#xE48;&#xE32;&#xE07;&#xE08;&#xE32;&#xE01;&#xE2A;&#xE35;&#xE1E;&#xE37;&#xE49;&#xE19;&#xE2B;&#xE25;&#xE31;&#xE07; (Background color) &#xE2D;&#xE22;&#xE48;&#xE32;&#xE07;&#xE0A;&#xE31;&#xE14;&#xE40;&#xE08;&#xE19; &#xE0A;&#xE48;&#xE27;&#xE22;&#xE43;&#xE2B;&#xE49;&#xE2D;&#xE48;&#xE32;&#xE19;&#xE02;&#xE49;&#xE2D;&#xE04;&#xE27;&#xE32;&#xE21;&#xE44;&#xE14;&#xE49;&#xE07;&#xE48;&#xE32;&#xE22; &#xE15;&#xE48;&#xE32;&#xE07;&#xE08;&#xE32;&#xE01;&#xE17;&#xE32;&#xE07;&#xE02;&#xE27;&#xE32;&#xE21;&#xE37;&#xE2D;&#xE17;&#xE35;&#xE48;&#xE2A;&#xE35;&#xE15;&#xE31;&#xE27;&#xE2B;&#xE19;&#xE31;&#xE07;&#xE2A;&#xE37;&#xE2D;&#xE41;&#xE25;&#xE30;&#xE1E;&#xE37;&#xE49;&#xE19;&#xE2B;&#xE25;&#xE31;&#xE07;&#xE04;&#xE25;&#xE49;&#xE32;&#xE22;&#xE01;&#xE31;&#xE19;&#xE17;&#xE33;&#xE43;&#xE2B;&#xE49;&#xE2D;&#xE48;&#xE32;&#xE19;&#xE22;&#xE32;&#xE01; &#xE42;&#xE14;&#xE22;&#xE40;&#xE09;&#xE1E;&#xE32;&#xE30;&#xE01;&#xE31;&#xE1A;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE08;&#xE2D;&#xE17;&#xE35;&#xE48;&#xE21;&#xE35;&#xE04;&#xE27;&#xE32;&#xE21;&#xE04;&#xE21;&#xE0A;&#xE31;&#xE14;&#xE15;&#xE48;&#xE33; &#xE2B;&#xE23;&#xE37;&#xE2D;&#xE01;&#xE31;&#xE1A;&#xE01;&#xE25;&#xE38;&#xE48;&#xE21;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE17;&#xE35;&#xE48;&#xE21;&#xE35;&#xE1B;&#xE31;&#xE0D;&#xE2B;&#xE32;&#xE17;&#xE32;&#xE07;&#xE2A;&#xE32;&#xE22;&#xE15;&#xE32; &#xE19;&#xE2D;&#xE01;&#xE08;&#xE32;&#xE01;&#xE19;&#xE35;&#xE49;&#xE02;&#xE19;&#xE32;&#xE14;&#xE41;&#xE25;&#xE30;&#xE04;&#xE27;&#xE32;&#xE21;&#xE2B;&#xE19;&#xE32;&#xE02;&#xE2D;&#xE07;&#xE2B;&#xE31;&#xE27;&#xE02;&#xE49;&#xE2D;&#xE17;&#xE32;&#xE07;&#xE0B;&#xE49;&#xE32;&#xE22;&#xE21;&#xE37;&#xE2D;&#xE22;&#xE31;&#xE07;&#xE0A;&#xE31;&#xE14;&#xE40;&#xE08;&#xE19;&#xE0A;&#xE48;&#xE27;&#xE22;&#xE43;&#xE2B;&#xE49;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE23;&#xE39;&#xE49;&#xE44;&#xE14;&#xE49;&#xE17;&#xE31;&#xE19;&#xE17;&#xE35;&#xE27;&#xE48;&#xE32;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE2B;&#xE31;&#xE27;&#xE02;&#xE49;&#xE2D; &#xE15;&#xE48;&#xE32;&#xE07;&#xE08;&#xE32;&#xE01;&#xE17;&#xE32;&#xE07;&#xE02;&#xE27;&#xE32;&#xE21;&#xE37;&#xE2D;&#xE17;&#xE35;&#xE48;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE15;&#xE31;&#xE49;&#xE07;&#xE43;&#xE08;&#xE14;&#xE39;&#xE08;&#xE36;&#xE07;&#xE08;&#xE30;&#xE23;&#xE39;&#xE49;&#xE27;&#xE48;&#xE32;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE2B;&#xE31;&#xE27;&#xE02;&#xE49;&#xE2D;</p>
<h2 id="repetition">Repetition</h2>
<p>asdf</p>
<h2 id="alignment">Alignment</h2>
<p>asdf</p>
<h2 id="proximity">Proximity</h2>
<p>asdf</p>

        </div>
        <div class="footer-nav">
          <div class="left"><a href="getting-start.html"><span class="title">Getting Start</span></a></div>
          <div class="right"><a href="guideline-navigation.html"><span class="label">Next: </span><span class="title">Navigation</span></a></div>
        </div>
      </div>
    </div>
  </body>
</html>