<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf-8">
    <link rel="stylesheet" href="assets/style.css?t=90051322">
    <link rel="stylesheet" href="https://ricostacruz.com/docpress-rsc/style.css">
    <link rel="stylesheet" href="extra.css?t=5c8ec47c">
    <script src="assets/script.js?t=93f1a66c"></script>
    <title>Getting Start - Sankom Design</title>
    <meta name="viewport" content="width=device-width">
  </head>
  <body class="-menu-visible">
    <div class="doc-layout">
      <div class="toggle menu-toggle js-menu-toggle"></div>
      <div class="menu toc-menu">
        <ul>
          <li class="menu-item -level-0 -parent">
            <ul class="submenu">
              <li class="menu-item -level-1"><a class="link title  link-index" href="index.html">Sankom Design</a>
              </li>
              <li class="menu-item -level-1"><a class="link title -active link-getting-start" href="getting-start.html">Getting Start</a>
                <ul class="headings heading-list">
                  <li class="heading-item -depth-2"><a class="hlink link-" href="#">ความชัดเจนสำหรับทีมออกแบบ</a>
                  </li>
                  <li class="heading-item -depth-2"><a class="hlink link-" href="#">ลดเวลาในการเขียนโปรแกรมของทีมพัฒนา</a>
                  </li>
                  <li class="heading-item -depth-2"><a class="hlink link-" href="#">ผู้ใช้เข้าใจโปรแกรมได้เร็วขึ้น</a>
                  </li>
                  <li class="heading-item -depth-2"><a class="hlink link-" href="#">สรุป</a>
                  </li>
                </ul>
              </li>
              <li class="menu-item -level-1"><a class="link title  link-design-principle" href="design-principle.html">Design Principle</a>
              </li>
              <li class="menu-item -level-1 -parent"><span class="title">Guideline</span>
                <ul class="submenu">
                  <li class="menu-item -level-2"><a class="link title  link-guideline-navigation" href="guideline-navigation.html">Navigation</a>
                  </li>
                  <li class="menu-item -level-2"><a class="link title  link-guideline-layout" href="guideline-layout.html">Layout</a>
                  </li>
                  <li class="menu-item -level-2"><a class="link title  link-guideline-element" href="guideline-element.html">Element</a>
                  </li>
                  <li class="menu-item -level-2"><span class="title">Plugin</span>
                  </li>
                  <li class="menu-item -level-2"><span class="title">New Account</span>
                  </li>
                </ul>
              </li>
              <li class="menu-item -level-1 -parent"><span class="title">Visual</span>
                <ul class="submenu">
                  <li class="menu-item -level-2"><a class="link title  link-visual-color" href="visual-color.html">Colors</a>
                  </li>
                  <li class="menu-item -level-2"><a class="link title  link-visual-layout" href="visual-layout.html">Layout</a>
                  </li>
                  <li class="menu-item -level-2"><a class="link title  link-visual-font" href="visual-font.html">Fonts</a>
                  </li>
                  <li class="menu-item -level-2"><span class="title">Icon</span>
                  </li>
                </ul>
              </li>
              <li class="menu-item -level-1"><a class="link title  link-contribute" href="contribute.html">Contribute</a>
              </li>
            </ul>
          </li>
        </ul>
      </div>
      <div class="body page-getting-start">
        <div class="header-nav">
          <div class="right"><a class="iconlink" href="https://github.com/sankomdesign/guideline" data-title="sankomdesign/guideline">
              <!-- span.title Open in GitHub--><span class="icon -github"></span></a>
          </div>
        </div>
        <div class="markdown-body"><h1 id="getting-start">Getting Start</h1>
<p>&#xE40;&#xE23;&#xE32;&#xE1E;&#xE31;&#xE12;&#xE19;&#xE32;&#xE41;&#xE2A;&#xE19;&#xE04;&#xE21; (Sankom Design System) &#xE02;&#xE36;&#xE49;&#xE19;&#xE21;&#xE32;&#xE42;&#xE14;&#xE22;&#xE21;&#xE35;&#xE40;&#xE1B;&#xE49;&#xE32;&#xE2B;&#xE21;&#xE32;&#xE22;&#xE2B;&#xE25;&#xE31;&#xE01;&#xE04;&#xE37;&#xE2D;&#xE01;&#xE32;&#xE23;&#xE40;&#xE1E;&#xE34;&#xE48;&#xE21;&#xE04;&#xE27;&#xE32;&#xE21;&#xE0A;&#xE31;&#xE14;&#xE40;&#xE08;&#xE19;&#xE43;&#xE2B;&#xE49;&#xE17;&#xE35;&#xE21;&#xE2D;&#xE2D;&#xE01;&#xE41;&#xE1A;&#xE1A; &#xE25;&#xE14;&#xE40;&#xE27;&#xE25;&#xE32;&#xE40;&#xE02;&#xE35;&#xE22;&#xE19;&#xE42;&#xE1B;&#xE23;&#xE41;&#xE01;&#xE21;&#xE43;&#xE2B;&#xE49;&#xE01;&#xE31;&#xE1A;&#xE17;&#xE35;&#xE21;&#xE1E;&#xE31;&#xE12;&#xE19;&#xE32; &#xE41;&#xE25;&#xE30;&#xE17;&#xE33;&#xE43;&#xE2B;&#xE49;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE2A;&#xE32;&#xE21;&#xE32;&#xE23;&#xE16;&#xE40;&#xE02;&#xE49;&#xE32;&#xE43;&#xE08;&#xE42;&#xE1B;&#xE23;&#xE41;&#xE01;&#xE23;&#xE21;&#xE02;&#xE2D;&#xE07;&#xE40;&#xE23;&#xE32;&#xE44;&#xE14;&#xE49;&#xE07;&#xE48;&#xE32;&#xE22;&#xE02;&#xE36;&#xE49;&#xE19; &#xE40;&#xE1E;&#xE34;&#xE48;&#xE21;&#xE04;&#xE38;&#xE13;&#xE20;&#xE32;&#xE1E;&#xE43;&#xE19;&#xE07;&#xE32;&#xE19;&#xE1E;&#xE31;&#xE12;&#xE19;&#xE32; Software &#xE02;&#xE2D;&#xE07;&#xE17;&#xE32;&#xE07;&#xE41;&#xE2A;&#xE19;&#xE2A;&#xE34;&#xE23;&#xE34;&#xE43;&#xE2B;&#xE49;&#xE14;&#xE35;&#xE02;&#xE36;&#xE49;&#xE19; &#xE17;&#xE31;&#xE49;&#xE07;&#xE02;&#xE2D;&#xE07;&#xE17;&#xE35;&#xE21;&#xE20;&#xE32;&#xE22;&#xE43;&#xE19;&#xE41;&#xE25;&#xE30;&#xE17;&#xE35;&#xE21;&#xE1E;&#xE31;&#xE12;&#xE19;&#xE32;&#xE20;&#xE32;&#xE22;&#xE19;&#xE2D;&#xE01;</p>
<p>&#xE2B;&#xE25;&#xE31;&#xE01;&#xE43;&#xE19;&#xE01;&#xE32;&#xE23;&#xE2D;&#xE2D;&#xE01;&#xE41;&#xE1A;&#xE1A;&#xE41;&#xE2A;&#xE19;&#xE04;&#xE21;&#xE08;&#xE30;&#xE22;&#xE36;&#xE14;&#xE1B;&#xE23;&#xE30;&#xE42;&#xE22;&#xE0A;&#xE19;&#xE4C;&#xE02;&#xE2D;&#xE07;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19; Design System &#xE19;&#xE35;&#xE49;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE2B;&#xE25;&#xE31;&#xE01;&#xE14;&#xE31;&#xE07;&#xE19;&#xE35;&#xE49;</p>
<h2 id>&#xE04;&#xE27;&#xE32;&#xE21;&#xE0A;&#xE31;&#xE14;&#xE40;&#xE08;&#xE19;&#xE2A;&#xE33;&#xE2B;&#xE23;&#xE31;&#xE1A;&#xE17;&#xE35;&#xE21;&#xE2D;&#xE2D;&#xE01;&#xE41;&#xE1A;&#xE1A;</h2>
<p>image</p>
<p>&#xE07;&#xE32;&#xE19;&#xE2D;&#xE2D;&#xE01;&#xE41;&#xE1A;&#xE1A;&#xE08;&#xE30;&#xE41;&#xE1A;&#xE48;&#xE07;&#xE07;&#xE32;&#xE19;&#xE2D;&#xE2D;&#xE01;&#xE41;&#xE1A;&#xE1A;&#xE15;&#xE32;&#xE21;&#xE2B;&#xE25;&#xE31;&#xE01; Atomic design &#xE42;&#xE14;&#xE22;&#xE17;&#xE35;&#xE21;&#xE2D;&#xE2D;&#xE01;&#xE41;&#xE1A;&#xE1A;&#xE2A;&#xE32;&#xE21;&#xE32;&#xE23;&#xE16;&#xE2D;&#xE49;&#xE32;&#xE07;&#xE2D;&#xE34;&#xE07; Font, Style, Button, dialog &#xE41;&#xE25;&#xE30;&#xE2D;&#xE37;&#xE48;&#xE19; &#xE46; &#xE44;&#xE14;&#xE49;&#xE43;&#xE19;&#xE40;&#xE2D;&#xE01;&#xE2A;&#xE32;&#xE23; &#xE44;&#xE21;&#xE48;&#xE08;&#xE33;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE40;&#xE23;&#xE34;&#xE48;&#xE21;&#xE15;&#xE49;&#xE19;&#xE2D;&#xE2D;&#xE01;&#xE41;&#xE1A;&#xE1A;&#xE43;&#xE2B;&#xE21;&#xE48;&#xE17;&#xE38;&#xE01;&#xE04;&#xE23;&#xE31;&#xE49;&#xE07; &#xE19;&#xE2D;&#xE01;&#xE08;&#xE32;&#xE01;&#xE19;&#xE31;&#xE49;&#xE19; &#xE17;&#xE35;&#xE48;</p>
<h2 id>&#xE25;&#xE14;&#xE40;&#xE27;&#xE25;&#xE32;&#xE43;&#xE19;&#xE01;&#xE32;&#xE23;&#xE40;&#xE02;&#xE35;&#xE22;&#xE19;&#xE42;&#xE1B;&#xE23;&#xE41;&#xE01;&#xE23;&#xE21;&#xE02;&#xE2D;&#xE07;&#xE17;&#xE35;&#xE21;&#xE1E;&#xE31;&#xE12;&#xE19;&#xE32;</h2>
<p>image</p>
<p>&#xE41;&#xE17;&#xE19;&#xE17;&#xE35;&#xE48;&#xE19;&#xE31;&#xE01;&#xE1E;&#xE31;&#xE12;&#xE19;&#xE32;&#xE08;&#xE30;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE2B;&#xE32;&#xE27;&#xE34;&#xE18;&#xE35;&#xE01;&#xE32;&#xE23;&#xE40;&#xE02;&#xE35;&#xE22;&#xE19; CSS, HTML &#xE17;&#xE38;&#xE01;&#xE04;&#xE23;&#xE31;&#xE49;&#xE07; &#xE01;&#xE32;&#xE23;&#xE17;&#xE35;&#xE48;&#xE17;&#xE35;&#xE21;&#xE2D;&#xE2D;&#xE01;&#xE41;&#xE1A;&#xE1A;&#xE22;&#xE36;&#xE14;&#xE2A;&#xE34;&#xE48;&#xE07;&#xE17;&#xE35;&#xE48;&#xE27;&#xE32;&#xE07;&#xE40;&#xE2D;&#xE32;&#xE44;&#xE27;&#xE49; &#xE08;&#xE30;&#xE0A;&#xE48;&#xE27;&#xE22;&#xE43;&#xE2B;&#xE49;&#xE19;&#xE31;&#xE01;&#xE1E;&#xE31;&#xE12;&#xE19;&#xE32;&#xE2A;&#xE32;&#xE21;&#xE32;&#xE23;&#xE16;&#xE14;&#xE36;&#xE07;&#xE04;&#xE27;&#xE32;&#xE21;&#xE23;&#xE39;&#xE49;&#xE08;&#xE32;&#xE01;&#xE42;&#xE04;&#xE23;&#xE07;&#xE01;&#xE32;&#xE23;&#xE2D;&#xE37;&#xE48;&#xE19; &#xE46; &#xE21;&#xE32;&#xE43;&#xE0A;&#xE49;&#xE44;&#xE14;&#xE49; &#xE42;&#xE14;&#xE22;&#xE43;&#xE19;&#xE40;&#xE2D;&#xE01;&#xE2A;&#xE32;&#xE23;&#xE09;&#xE1A;&#xE31;&#xE1A;&#xE19;&#xE35;&#xE49;&#xE19;&#xE2D;&#xE01;&#xE08;&#xE32;&#xE01;&#xE08;&#xE30;&#xE23;&#xE27;&#xE1A;&#xE23;&#xE27;&#xE21;&#xE40;&#xE23;&#xE37;&#xE48;&#xE2D;&#xE07;&#xE01;&#xE32;&#xE23;&#xE2D;&#xE2D;&#xE01;&#xE41;&#xE1A;&#xE1A;&#xE41;&#xE25;&#xE49;&#xE27;&#xE22; &#xE22;&#xE31;&#xE07;&#xE23;&#xE27;&#xE1A;&#xE23;&#xE27;&#xE21;&#xE27;&#xE34;&#xE18;&#xE4A;&#xE01;&#xE32;&#xE23;&#xE40;&#xE02;&#xE35;&#xE22;&#xE19; CSS, HTML &#xE17;&#xE35;&#xE48;&#xE2A;&#xE23;&#xE49;&#xE32;&#xE07;&#xE44;&#xE27;&#xE49;&#xE41;&#xE25;&#xE49;&#xE27;&#xE43;&#xE2B;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE14;&#xE49;&#xE27;&#xE22;</p>
<h2 id>&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE40;&#xE02;&#xE49;&#xE32;&#xE43;&#xE08;&#xE42;&#xE1B;&#xE23;&#xE41;&#xE01;&#xE23;&#xE21;&#xE44;&#xE14;&#xE49;&#xE40;&#xE23;&#xE47;&#xE27;&#xE02;&#xE36;&#xE49;&#xE19;</h2>
<p>image</p>
<p>&#xE2A;&#xE48;&#xE27;&#xE19;&#xE17;&#xE35;&#xE48;&#xE2A;&#xE33;&#xE04;&#xE31;&#xE0D;&#xE17;&#xE35;&#xE48;&#xE2A;&#xE38;&#xE14;&#xE43;&#xE19;&#xE40;&#xE2D;&#xE01;&#xE2A;&#xE32;&#xE23;&#xE04;&#xE37;&#xE2D;&#xE23;&#xE30;&#xE1A;&#xE1A; Navigation &#xE43;&#xE19;&#xE17;&#xE38;&#xE01; &#xE46; &#xE42;&#xE1B;&#xE23;&#xE41;&#xE01;&#xE23;&#xE21;&#xE02;&#xE2D;&#xE07;&#xE41;&#xE2A;&#xE19;&#xE2A;&#xE34;&#xE23;&#xE34;&#xE04;&#xE27;&#xE23;&#xE08;&#xE30;&#xE21;&#xE35;&#xE01;&#xE32;&#xE23;&#xE19;&#xE33;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE44;&#xE1B;&#xE22;&#xE31;&#xE07;&#xE2A;&#xE48;&#xE27;&#xE19;&#xE15;&#xE48;&#xE32;&#xE07; &#xE46; &#xE14;&#xE49;&#xE27;&#xE22;&#xE27;&#xE34;&#xE18;&#xE35;&#xE01;&#xE32;&#xE23;&#xE40;&#xE14;&#xE35;&#xE22;&#xE27;&#xE01;&#xE31;&#xE19; &#xE41;&#xE21;&#xE48;&#xE27;&#xE48;&#xE32;&#xE41;&#xE15;&#xE48;&#xE25;&#xE30;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE08;&#xE30;&#xE2D;&#xE2D;&#xE01;&#xE41;&#xE1A;&#xE1A;&#xE44;&#xE21;&#xE48;&#xE40;&#xE2B;&#xE21;&#xE37;&#xE2D;&#xE19;&#xE01;&#xE31;&#xE19; &#xE40;&#xE1E;&#xE23;&#xE32;&#xE30;&#xE41;&#xE15;&#xE48;&#xE25;&#xE30;&#xE42;&#xE1B;&#xE23;&#xE41;&#xE01;&#xE23;&#xE21;&#xE21;&#xE35;&#xE04;&#xE38;&#xE13;&#xE25;&#xE31;&#xE01;&#xE29;&#xE13;&#xE30;&#xE44;&#xE21;&#xE48;&#xE40;&#xE2B;&#xE21;&#xE37;&#xE2D;&#xE19;&#xE01;&#xE31;&#xE19; &#xE41;&#xE15;&#xE48;&#xE04;&#xE27;&#xE23;&#xE08;&#xE30;&#xE21;&#xE35; Navitation &#xE40;&#xE2B;&#xE21;&#xE37;&#xE2D;&#xE19;&#xE01;&#xE31;&#xE19; &#xE0B;&#xE36;&#xE48;&#xE07;&#xE08;&#xE30;&#xE0A;&#xE48;&#xE27;&#xE22;&#xE43;&#xE2B;&#xE49;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE40;&#xE23;&#xE35;&#xE22;&#xE19;&#xE23;&#xE39;&#xE49;&#xE41;&#xE04;&#xE48;&#xE04;&#xE23;&#xE31;&#xE49;&#xE07;&#xE40;&#xE14;&#xE35;&#xE22;&#xE27;&#xE01;&#xE47;&#xE2A;&#xE32;&#xE21;&#xE32;&#xE23;&#xE16;&#xE19;&#xE33;&#xE44;&#xE1B;&#xE43;&#xE0A;&#xE49;&#xE01;&#xE31;&#xE1A;&#xE42;&#xE1B;&#xE23;&#xE41;&#xE01;&#xE23;&#xE21;&#xE2D;&#xE37;&#xE48;&#xE19; &#xE46; &#xE44;&#xE14;&#xE49;</p>
<h2 id>&#xE2A;&#xE23;&#xE38;&#xE1B;</h2>
<p>&#xE43;&#xE19;&#xE41;&#xE15;&#xE48;&#xE25;&#xE30;&#xE42;&#xE1B;&#xE23;&#xE41;&#xE01;&#xE23;&#xE21;&#xE08;&#xE30;&#xE21;&#xE35;&#xE04;&#xE27;&#xE32;&#xE21;&#xE08;&#xE33;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE17;&#xE35;&#xE48;&#xE08;&#xE30;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE2D;&#xE2D;&#xE01;&#xE41;&#xE1A;&#xE1A;&#xE44;&#xE21;&#xE48;&#xE40;&#xE2B;&#xE21;&#xE37;&#xE2D;&#xE19;&#xE01;&#xE31;&#xE19; &#xE17;&#xE38;&#xE01;&#xE04;&#xE19;</p>

        </div>
        <div class="footer-nav">
          <div class="left"><a href="index.html"><span class="title">Sankom Design</span></a></div>
          <div class="right"><a href="design-principle.html"><span class="label">Next: </span><span class="title">Design Principle</span></a></div>
        </div>
      </div>
    </div>
  </body>
</html>