<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf-8">
    <link rel="stylesheet" href="assets/style.css?t=90051322">
    <link rel="stylesheet" href="https://ricostacruz.com/docpress-rsc/style.css">
    <link rel="stylesheet" href="extra.css?t=5c8ec47c">
    <script src="assets/script.js?t=93f1a66c"></script>
    <title>Navigation - Sankom Design</title>
    <meta name="viewport" content="width=device-width">
  </head>
  <body class="-menu-visible">
    <div class="doc-layout">
      <div class="toggle menu-toggle js-menu-toggle"></div>
      <div class="menu toc-menu">
        <ul>
          <li class="menu-item -level-0 -parent">
            <ul class="submenu">
              <li class="menu-item -level-1"><a class="link title  link-index" href="index.html">Sankom Design</a>
              </li>
              <li class="menu-item -level-1"><a class="link title  link-getting-start" href="getting-start.html">Getting Start</a>
              </li>
              <li class="menu-item -level-1"><a class="link title  link-design-principle" href="design-principle.html">Design Principle</a>
              </li>
              <li class="menu-item -level-1 -parent"><span class="title">Guideline</span>
                <ul class="submenu">
                  <li class="menu-item -level-2"><a class="link title -active link-guideline-navigation" href="guideline-navigation.html">Navigation</a>
                    <ul class="headings heading-list">
                      <li class="heading-item -depth-3"><a class="hlink link-overview" href="#overview">Overview</a>
                      </li>
                      <li class="heading-item -depth-3"><a class="hlink link-page-structure" href="#page-structure">Page structure</a>
                      </li>
                      <li class="heading-item -depth-3"><a class="hlink link-interactive-design" href="#interactive-design">Interactive design</a>
                      </li>
                    </ul>
                  </li>
                  <li class="menu-item -level-2"><a class="link title  link-guideline-layout" href="guideline-layout.html">Layout</a>
                  </li>
                  <li class="menu-item -level-2"><a class="link title  link-guideline-element" href="guideline-element.html">Element</a>
                  </li>
                  <li class="menu-item -level-2"><span class="title">Plugin</span>
                  </li>
                  <li class="menu-item -level-2"><span class="title">New Account</span>
                  </li>
                </ul>
              </li>
              <li class="menu-item -level-1 -parent"><span class="title">Visual</span>
                <ul class="submenu">
                  <li class="menu-item -level-2"><a class="link title  link-visual-color" href="visual-color.html">Theme</a>
                  </li>
                  <li class="menu-item -level-2"><a class="link title  link-visual-grid" href="visual-grid.html">Grid</a>
                  </li>
                  <li class="menu-item -level-2"><a class="link title  link-visual-font" href="visual-font.html">Fonts</a>
                  </li>
                  <li class="menu-item -level-2 -parent"><span class="title">Icon</span>
                    <ul class="submenu">
                      <li class="menu-item -level-3"><a class="link title  link-contribute" href="contribute.html">Contribute</a>
                      </li>
                    </ul>
                  </li>
                </ul>
              </li>
            </ul>
          </li>
        </ul>
      </div>
      <div class="body page-guideline-navigation">
        <div class="header-nav">
          <div class="right"><a class="iconlink" href="https://github.com/sankomdesign/guideline" data-title="sankomdesign/guideline">
              <!-- span.title Open in GitHub--><span class="icon -github"></span></a>
          </div>
        </div>
        <div class="markdown-body"><h1 id="navigation">Navigation</h1>
<h3 id="overview">Overview</h3>
<p>&#xE01;&#xE32;&#xE23;&#xE2D;&#xE2D;&#xE01;&#xE41;&#xE1A;&#xE1A; Navigation &#xE1E;&#xE32;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE44;&#xE1B;&#xE22;&#xE31;&#xE07;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE15;&#xE48;&#xE32;&#xE07;&#xE46;&#xE02;&#xE2D;&#xE07; application &#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE17;&#xE33;&#xE20;&#xE32;&#xE23;&#xE01;&#xE34;&#xE08;&#xE02;&#xE2D;&#xE07;&#xE15;&#xE31;&#xE27;&#xE40;&#xE2D;&#xE07;&#xE43;&#xE2B;&#xE49;&#xE2A;&#xE33;&#xE40;&#xE23;&#xE47;&#xE08;
&#xE40;&#xE21;&#xE37;&#xE48;&#xE2D; application &#xE15;&#xE23;&#xE07;&#xE44;&#xE1B;&#xE15;&#xE23;&#xE07;&#xE21;&#xE32;&#xE44;&#xE21;&#xE48;&#xE21;&#xE35;&#xE04;&#xE27;&#xE32;&#xE21;&#xE0B;&#xE31;&#xE1A;&#xE0B;&#xE49;&#xE2D;&#xE19;&#xE01;&#xE32;&#xE23;&#xE2D;&#xE2D;&#xE01;&#xE41;&#xE1A;&#xE1A; <strong>&quot;&#xE2B;&#xE19;&#xE36;&#xE48;&#xE07;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE2B;&#xE19;&#xE36;&#xE48;&#xE07;&#xE23;&#xE32;&#xE22;&#xE01;&#xE32;&#xE23;&quot;</strong> &#xE2B;&#xE23;&#xE37;&#xE2D; <strong>&quot;&#xE2B;&#xE19;&#xE36;&#xE48;&#xE07;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE17;&#xE33;&#xE07;&#xE32;&#xE19;&#xE2B;&#xE19;&#xE36;&#xE48;&#xE07;&#xE2D;&#xE22;&#xE48;&#xE32;&#xE07;&quot;</strong> &#xE08;&#xE36;&#xE07;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE2A;&#xE34;&#xE48;&#xE07;&#xE17;&#xE35;&#xE48;&#xE04;&#xE27;&#xE23;&#xE17;&#xE33; &#xE15;&#xE23;&#xE07;&#xE01;&#xE31;&#xE19;&#xE02;&#xE49;&#xE32;&#xE21;&#xE2B;&#xE32;&#xE01; application &#xE21;&#xE35;&#xE04;&#xE27;&#xE32;&#xE21;&#xE0B;&#xE31;&#xE1A;&#xE0B;&#xE49;&#xE2D;&#xE19;&#xE01;&#xE32;&#xE23;&#xE17;&#xE33;&#xE20;&#xE32;&#xE23;&#xE01;&#xE34;&#xE08;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE2D;&#xE32;&#xE28;&#xE31;&#xE22;&#xE2B;&#xE25;&#xE32;&#xE22;&#xE02;&#xE31;&#xE49;&#xE19;&#xE15;&#xE2D;&#xE19;&#xE2B;&#xE23;&#xE37;&#xE2D;&#xE21;&#xE35;&#xE01;&#xE32;&#xE23;&#xE01;&#xE23;&#xE30;&#xE42;&#xE14;&#xE14;&#xE08;&#xE32;&#xE01;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE44;&#xE1B;&#xE2D;&#xE35;&#xE01;&#xE2B;&#xE19;&#xE49;&#xE32; &#xE41;&#xE19;&#xE27;&#xE04;&#xE34;&#xE14;&#xE41;&#xE1A;&#xE1A;&#xE2B;&#xE19;&#xE36;&#xE48;&#xE07;&#xE15;&#xE48;&#xE2D;&#xE2B;&#xE19;&#xE36;&#xE48;&#xE07;&#xE2D;&#xE32;&#xE08;&#xE17;&#xE33;&#xE43;&#xE2B;&#xE49;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE17;&#xE33;&#xE07;&#xE32;&#xE19;&#xE22;&#xE32;&#xE01;</p>
<p>&#xE15;&#xE31;&#xE27;&#xE2D;&#xE22;&#xE48;&#xE32;&#xE07;&#xE15;&#xE48;&#xE2D;&#xE44;&#xE1B;&#xE19;&#xE35;&#xE49;&#xE21;&#xE32;&#xE08;&#xE32;&#xE01;&#xE42;&#xE1B;&#xE23;&#xE41;&#xE01;&#xE23;&#xE21; <strong>PMS</strong> ( Property management system ) &#xE42;&#xE1B;&#xE23;&#xE41;&#xE01;&#xE23;&#xE21;&#xE08;&#xE31;&#xE14;&#xE01;&#xE32;&#xE23;&#xE19;&#xE34;&#xE15;&#xE34;&#xE1A;&#xE38;&#xE04;&#xE04;&#xE25;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE17;&#xE35;&#xE48;&#xE2B;&#xE25;&#xE31;&#xE01;&#xE04;&#xE37;&#xE2D;&#xE01;&#xE32;&#xE23;&#xE2D;&#xE2D;&#xE01;&#xE40;&#xE2D;&#xE01;&#xE2A;&#xE32;&#xE23;&#xE17;&#xE31;&#xE49;&#xE07;&#xE01;&#xE32;&#xE23;&#xE2D;&#xE2D;&#xE01;&#xE41;&#xE1A;&#xE1A;&#xE2B;&#xE19;&#xE36;&#xE48;&#xE07;&#xE15;&#xE48;&#xE2D;&#xE2B;&#xE19;&#xE36;&#xE48;&#xE07;&#xE41;&#xE25;&#xE30;&#xE01;&#xE32;&#xE23;&#xE2D;&#xE2D;&#xE01;&#xE40;&#xE2D;&#xE01;&#xE2A;&#xE32;&#xE23;&#xE08;&#xE32;&#xE01;&#xE40;&#xE2D;&#xE01;&#xE2A;&#xE32;&#xE23;&#xE2D;&#xE49;&#xE32;&#xE07;&#xE2D;&#xE34;&#xE07;</p>
<p><img src="images/navigation/pms-01.jpg" alt="Navigation"></p>
<p><strong>1.&#xE2B;&#xE19;&#xE49;&#xE32;&#xE08;&#xE2D;&#xE2B;&#xE25;&#xE31;&#xE01;</strong> (Primary screen) &#xE43;&#xE0A;&#xE49;&#xE41;&#xE2A;&#xE14;&#xE07;&#xE23;&#xE32;&#xE22;&#xE01;&#xE32;&#xE23;&#xE40;&#xE2D;&#xE01;&#xE2A;&#xE32;&#xE23;</p>
<p><strong>2.&#xE2B;&#xE19;&#xE49;&#xE32;&#xE08;&#xE2D;&#xE23;&#xE2D;&#xE07;</strong> (Secondary screen) &#xE43;&#xE0A;&#xE49;&#xE41;&#xE2A;&#xE14;&#xE07;&#xE2A;&#xE48;&#xE27;&#xE19;&#xE40;&#xE1E;&#xE37;&#xE48;&#xE21;&#xE40;&#xE15;&#xE34;&#xE21;&#xE2A;&#xE48;&#xE27;&#xE19;&#xE15;&#xE48;&#xE2D;&#xE02;&#xE22;&#xE32;&#xE22;&#xE08;&#xE32;&#xE01;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE08;&#xE2D;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE2B;&#xE25;&#xE31;&#xE01; &#xE2D;&#xE35;&#xE01;&#xE17;&#xE31;&#xE49;&#xE07;&#xE22;&#xE31;&#xE07;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE2A;&#xE48;&#xE27;&#xE19;&#xE17;&#xE35;&#xE48;&#xE23;&#xE2D;&#xE07;&#xE23;&#xE31;&#xE1A;&#xE01;&#xE32;&#xE23;&#xE41;&#xE2A;&#xE14;&#xE07;&#xE1C;&#xE25;&#xE41;&#xE1A;&#xE1A; Dynamic &#xE04;&#xE37;&#xE2D;&#xE40;&#xE21;&#xE37;&#xE48;&#xE2D; State &#xE15;&#xE48;&#xE32;&#xE07;&#xE46;&#xE02;&#xE2D;&#xE07;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE08;&#xE2D;&#xE40;&#xE1B;&#xE25;&#xE35;&#xE48;&#xE22;&#xE19; &#xE2B;&#xE19;&#xE49;&#xE32;&#xE08;&#xE2D;&#xE23;&#xE2D;&#xE07;&#xE15;&#xE23;&#xE07;&#xE19;&#xE35;&#xE49;&#xE08;&#xE30;&#xE40;&#xE1B;&#xE25;&#xE35;&#xE48;&#xE22;&#xE19;&#xE15;&#xE32;&#xE21;&#xE15;&#xE32;&#xE21;&#xE17;&#xE35;&#xE48;&#xE44;&#xE14;&#xE49;&#xE01;&#xE33;&#xE2B;&#xE19;&#xE14;&#xE44;&#xE27;&#xE49;</p>
<p><img src="images/navigation/pms-02.jpg" alt="Navigation"></p>
<p><strong>1. Application bar</strong></p>
<p><strong>2. Navigation bar</strong></p>
<p><strong>3. Notification bar</strong></p>
<p><strong>4. Secondary screen Call-to-action</strong></p>
<h3 id="page-structure">Page structure</h3>
<p><img src="images/navigation/pms-03.jpg" alt="Navigation"></p>
<p><strong>1. Page title</strong></p>
<p><strong>2. Primary screen Call-to-action</strong></p>
<p><strong>3. List of items</strong></p>
<p><strong>4. Secondary screen Call-to-action</strong></p>
<h3 id="interactive-design">Interactive design</h3>
<p>&#xE01;&#xE32;&#xE23;&#xE2D;&#xE2D;&#xE01;&#xE41;&#xE1A;&#xE1A;&#xE2A;&#xE48;&#xE27;&#xE19;&#xE17;&#xE35;&#xE48;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE42;&#xE15;&#xE49;&#xE15;&#xE2D;&#xE1A;&#xE23;&#xE30;&#xE2B;&#xE27;&#xE48;&#xE32;&#xE07;&#xE23;&#xE30;&#xE1A;&#xE1A;&#xE01;&#xE31;&#xE1A;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19; &#xE15;&#xE49;&#xE2D;&#xE07;&#xE21;&#xE35;&#xE04;&#xE27;&#xE32;&#xE21;&#xE2A;&#xE21;&#xE48;&#xE33;&#xE40;&#xE2A;&#xE21;&#xE2D;&#xE41;&#xE25;&#xE30;&#xE15;&#xE31;&#xE27;&#xE02;&#xE2D;&#xE07;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE08;&#xE2D;&#xE40;&#xE2D;&#xE07;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE2A;&#xE32;&#xE21;&#xE32;&#xE23;&#xE16;&#xE2D;&#xE18;&#xE34;&#xE1A;&#xE32;&#xE22;&#xE15;&#xE31;&#xE27;&#xE40;&#xE2D;&#xE07;&#xE44;&#xE14;&#xE49; &#xE27;&#xE48;&#xE32;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE01;&#xE32;&#xE23;&#xE43;&#xE2B;&#xE49;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE17;&#xE33;&#xE2D;&#xE30;&#xE44;&#xE23;&#xE41;&#xE25;&#xE30;&#xE2D;&#xE22;&#xE48;&#xE32;&#xE07;&#xE44;&#xE23;&#xE1A;&#xE49;&#xE32;&#xE07; &#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE43;&#xE2B;&#xE49;&#xE44;&#xE14;&#xE49;&#xE1C;&#xE25;&#xE25;&#xE31;&#xE1E;&#xE18;&#xE4C;&#xE2D;&#xE22;&#xE48;&#xE32;&#xE07;&#xE17;&#xE35;&#xE48;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE04;&#xE32;&#xE14;&#xE2B;&#xE27;&#xE31;&#xE07;&#xE44;&#xE27;&#xE49;</p>
<p><img src="images/navigation/pms-04.jpg" alt="Navigation"></p>
<p>Secondary screen &#xE08;&#xE30;&#xE41;&#xE2A;&#xE14;&#xE07; Panal &#xE17;&#xE35;&#xE48;&#xE41;&#xE15;&#xE01;&#xE15;&#xE48;&#xE32;&#xE07;&#xE01;&#xE31;&#xE19;&#xE15;&#xE32;&#xE21;&#xE1B;&#xE0F;&#xE34;&#xE2A;&#xE31;&#xE21;&#xE1E;&#xE31;&#xE19;&#xE18;&#xE4C;&#xE02;&#xE2D;&#xE07;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE14;&#xE31;&#xE07;&#xE15;&#xE48;&#xE2D;&#xE44;&#xE1B;&#xE19;&#xE35;&#xE49;</p>
<p><strong>1. Toggle selection</strong> &#xE40;&#xE21;&#xE37;&#xE48;&#xE2D; Checkbox &#xE21;&#xE35;&#xE01;&#xE32;&#xE23; Toggle &#xE1A;&#xE32;&#xE19;&#xE14;&#xE49;&#xE32;&#xE19;&#xE02;&#xE27;&#xE32;&#xE08;&#xE30;&#xE41;&#xE2A;&#xE14;&#xE07; action &#xE17;&#xE35;&#xE48;&#xE2A;&#xE32;&#xE21;&#xE32;&#xE23;&#xE16;&#xE17;&#xE33;&#xE44;&#xE14;&#xE49;</p>
<p><strong>2. Item selection</strong> &#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE42;&#xE14;&#xE22;&#xE15;&#xE23;&#xE07;&#xE17;&#xE35;&#xE48;&#xE23;&#xE32;&#xE22;&#xE01;&#xE32;&#xE23;&#xE1A;&#xE32;&#xE19;&#xE14;&#xE49;&#xE32;&#xE19;&#xE02;&#xE27;&#xE32;&#xE08;&#xE30;&#xE41;&#xE2A;&#xE14;&#xE07;&#xE2A;&#xE48;&#xE27;&#xE19;&#xE15;&#xE48;&#xE2D;&#xE02;&#xE22;&#xE32;&#xE22;</p>
<p><strong>3. Call-to-action</strong> &#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE01;&#xE32;&#xE23; action &#xE17;&#xE35;&#xE48;&#xE40;&#xE09;&#xE1E;&#xE32;&#xE30;&#xE40;&#xE08;&#xE32;&#xE30;&#xE08;&#xE07;&#xE42;&#xE14;&#xE22;&#xE44;&#xE21;&#xE48;&#xE04;&#xE33;&#xE19;&#xE36;&#xE07;&#xE16;&#xE36;&#xE07;&#xE27;&#xE48;&#xE32;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE19;&#xE31;&#xE49;&#xE19;&#xE40;&#xE25;&#xE37;&#xE2D;&#xE01;&#xE2D;&#xE30;&#xE44;&#xE23;&#xE2D;&#xE22;&#xE39;&#xE48; (&#xE40;&#xE0A;&#xE48;&#xE19; action &#xE01;&#xE32;&#xE23;&#xE2A;&#xE23;&#xE49;&#xE32;&#xE07;&#xE40;&#xE2D;&#xE01;&#xE2A;&#xE32;&#xE23;&#xE43;&#xE2B;&#xE21;&#xE48;)</p>
<p><strong>4. Reference documentation</strong> &#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE01;&#xE32;&#xE23;&#xE14;&#xE39;&#xE40;&#xE2D;&#xE01;&#xE2A;&#xE32;&#xE23;&#xE2D;&#xE49;&#xE32;&#xE07;&#xE2D;&#xE34;&#xE07;&#xE08;&#xE32;&#xE01;&#xE23;&#xE32;&#xE22;&#xE01;&#xE32;&#xE23;&#xE17;&#xE35;&#xE48;&#xE40;&#xE25;&#xE37;&#xE2D;&#xE01; &#xE1A;&#xE32;&#xE19;&#xE14;&#xE49;&#xE32;&#xE19;&#xE02;&#xE27;&#xE32;&#xE08;&#xE30;&#xE41;&#xE2A;&#xE14;&#xE07;&#xE2A;&#xE48;&#xE27;&#xE19;&#xE02;&#xE22;&#xE32;&#xE22;&#xE40;&#xE1E;&#xE34;&#xE48;&#xE21;&#xE40;&#xE15;&#xE34;&#xE21;</p>
<p><img src="images/navigation/pms-05.jpg" alt="Navigation"></p>
<p>&#xE40;&#xE21;&#xE37;&#xE48;&#xE2D; application &#xE21;&#xE35;&#xE04;&#xE27;&#xE32;&#xE21;&#xE0B;&#xE31;&#xE1A;&#xE0B;&#xE49;&#xE2D;&#xE19;&#xE21;&#xE35;&#xE01;&#xE32;&#xE23;&#xE02;&#xE22;&#xE32;&#xE22;&#xE15;&#xE31;&#xE27;&#xE17;&#xE31;&#xE49;&#xE07;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE08;&#xE2D;&#xE2B;&#xE25;&#xE31;&#xE07;&#xE41;&#xE25;&#xE30;&#xE23;&#xE2D;&#xE07;&#xE2D;&#xE32;&#xE08;&#xE44;&#xE21;&#xE48;&#xE40;&#xE1E;&#xE35;&#xE22;&#xE07;&#xE1E;&#xE2D;&#xE23;&#xE2D;&#xE07;&#xE23;&#xE31;&#xE1A;&#xE15;&#xE48;&#xE2D;&#xE01;&#xE32;&#xE23;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE02;&#xE2D;&#xE07;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19; Modal &#xE41;&#xE1A;&#xE1A;&#xE40;&#xE15;&#xE47;&#xE21;&#xE08;&#xE2D;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE2D;&#xE35;&#xE01;&#xE2B;&#xE19;&#xE36;&#xE48;&#xE07;&#xE15;&#xE31;&#xE27;&#xE40;&#xE25;&#xE37;&#xE2D;&#xE01; &#xE42;&#xE14;&#xE22;&#xE2A;&#xE37;&#xE48;&#xE2D;&#xE2A;&#xE32;&#xE23;&#xE27;&#xE48;&#xE32;&#xE19;&#xE35;&#xE49;&#xE04;&#xE37;&#xE2D;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE1E;&#xE34;&#xE40;&#xE28;&#xE29;&#xE01;&#xE32;&#xE23;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE15;&#xE48;&#xE32;&#xE07;&#xE2D;&#xE2D;&#xE01;&#xE44;&#xE1B;&#xE08;&#xE32;&#xE01;&#xE40;&#xE2B;&#xE15;&#xE38;&#xE01;&#xE32;&#xE23;&#xE13;&#xE4C;&#xE1B;&#xE01;&#xE15;&#xE34; Modal &#xE41;&#xE1A;&#xE1A;&#xE40;&#xE15;&#xE47;&#xE21;&#xE08;&#xE2D;&#xE1B;&#xE34;&#xE14;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE08;&#xE2D;&#xE2B;&#xE25;&#xE31;&#xE01;-&#xE23;&#xE2D;&#xE07;&#xE01;&#xE47;&#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE43;&#xE2B;&#xE49;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE21;&#xE35;&#xE2A;&#xE21;&#xE32;&#xE18;&#xE34;&#xE2D;&#xE22;&#xE39;&#xE48;&#xE01;&#xE31;&#xE1A;&#xE07;&#xE32;&#xE19;&#xE15;&#xE23;&#xE07;&#xE2B;&#xE19;&#xE49;&#xE32; &#xE44;&#xE21;&#xE48;&#xE43;&#xE2B;&#xE49;&#xE02;&#xE49;&#xE2D;&#xE21;&#xE39;&#xE25;&#xE2D;&#xE37;&#xE48;&#xE19;&#xE46;&#xE17;&#xE35;&#xE48;&#xE44;&#xE21;&#xE48;&#xE40;&#xE01;&#xE35;&#xE48;&#xE22;&#xE27;&#xE02;&#xE49;&#xE2D;&#xE07;&#xE21;&#xE32;&#xE23;&#xE1A;&#xE01;&#xE27;&#xE19;&#xE23;&#xE30;&#xE2B;&#xE27;&#xE48;&#xE32;&#xE07;&#xE01;&#xE32;&#xE23;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;</p>

        </div>
        <div class="footer-nav">
          <div class="left"><a href="design-principle.html"><span class="title">Design Principle</span></a></div>
          <div class="right"><a href="guideline-layout.html"><span class="label">Next: </span><span class="title">Layout</span></a></div>
        </div>
      </div>
    </div>
  </body>
</html>