<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf-8">
    <link rel="stylesheet" href="assets/style.css?t=90051322">
    <link rel="stylesheet" href="https://ricostacruz.com/docpress-rsc/style.css">
    <link rel="stylesheet" href="extra.css?t=5c8ec47c">
    <script src="assets/script.js?t=93f1a66c"></script>
    <title>Layout - Sankom Design</title>
    <meta name="viewport" content="width=device-width">
  </head>
  <body class="-menu-visible">
    <div class="doc-layout">
      <div class="toggle menu-toggle js-menu-toggle"></div>
      <div class="menu toc-menu">
        <ul>
          <li class="menu-item -level-0 -parent">
            <ul class="submenu">
              <li class="menu-item -level-1"><a class="link title  link-index" href="index.html">Sankom Design</a>
              </li>
              <li class="menu-item -level-1"><a class="link title  link-getting-start" href="getting-start.html">Getting Start</a>
              </li>
              <li class="menu-item -level-1"><a class="link title  link-design-principle" href="design-principle.html">Design Principle</a>
              </li>
              <li class="menu-item -level-1 -parent"><span class="title">Guideline</span>
                <ul class="submenu">
                  <li class="menu-item -level-2"><a class="link title  link-guideline-navigation" href="guideline-navigation.html">Navigation</a>
                  </li>
                  <li class="menu-item -level-2"><a class="link title -active link-guideline-layout" href="guideline-layout.html">Layout</a>
                    <ul class="headings heading-list">
                      <li class="heading-item -depth-3"><a class="hlink link-application-structure" href="#application-structure">Application Structure</a>
                      </li>
                      <li class="heading-item -depth-3"><a class="hlink link-apperance" href="#apperance">Apperance</a>
                      </li>
                    </ul>
                  </li>
                  <li class="menu-item -level-2"><a class="link title  link-guideline-element" href="guideline-element.html">Element</a>
                  </li>
                  <li class="menu-item -level-2"><span class="title">Plugin</span>
                  </li>
                  <li class="menu-item -level-2"><span class="title">New Account</span>
                  </li>
                </ul>
              </li>
              <li class="menu-item -level-1 -parent"><span class="title">Visual</span>
                <ul class="submenu">
                  <li class="menu-item -level-2"><a class="link title  link-visual-color" href="visual-color.html">Colors</a>
                  </li>
                  <li class="menu-item -level-2"><a class="link title  link-visual-grid" href="visual-grid.html">Grid</a>
                  </li>
                  <li class="menu-item -level-2"><a class="link title  link-visual-font" href="visual-font.html">Fonts</a>
                  </li>
                  <li class="menu-item -level-2"><span class="title">Icon</span>
                  </li>
                </ul>
              </li>
              <li class="menu-item -level-1"><a class="link title  link-contribute" href="contribute.html">Contribute</a>
              </li>
            </ul>
          </li>
        </ul>
      </div>
      <div class="body page-guideline-layout">
        <div class="header-nav">
          <div class="right"><a class="iconlink" href="https://github.com/sankomdesign/guideline" data-title="sankomdesign/guideline">
              <!-- span.title Open in GitHub--><span class="icon -github"></span></a>
          </div>
        </div>
        <div class="markdown-body"><h1 id="layout">Layout</h1>
<h4 id><strong>&#xE04;&#xE32;&#xE14;&#xE40;&#xE14;&#xE32;&#xE44;&#xE14;&#xE49;, &#xE2A;&#xE21;&#xE48;&#xE33;&#xE40;&#xE2A;&#xE21;&#xE2D;&#xE41;&#xE25;&#xE30;&#xE22;&#xE37;&#xE14;&#xE2B;&#xE22;&#xE38;&#xE48;&#xE19;</strong></h4>
<p>&#xE22;&#xE39;&#xE2A;&#xE40;&#xE0B;&#xE2D;&#xE23;&#xE4C;&#xE2D;&#xE34;&#xE19;&#xE40;&#xE15;&#xE2D;&#xE23;&#xE4C;&#xE40;&#xE1F;&#xE2A;&#xE41;&#xE25;&#xE30;&#xE40;&#xE25;&#xE22;&#xE4C;&#xE40;&#xE2D;&#xE49;&#xE32;&#xE17;&#xE4C; &#xE15;&#xE49;&#xE2D;&#xE07;&#xE21;&#xE35;&#xE04;&#xE27;&#xE32;&#xE21;&#xE2A;&#xE21;&#xE48;&#xE33;&#xE40;&#xE2A;&#xE21;&#xE2D;, &#xE2D;&#xE18;&#xE34;&#xE1A;&#xE32;&#xE22;&#xE44;&#xE14;&#xE49;&#xE14;&#xE49;&#xE27;&#xE22;&#xE15;&#xE31;&#xE27;&#xE40;&#xE2D;&#xE07;&#xE41;&#xE25;&#xE30;&#xE04;&#xE32;&#xE14;&#xE40;&#xE14;&#xE32;&#xE44;&#xE14;&#xE49;&#xE07;&#xE48;&#xE32;&#xE22; &#xE42;&#xE14;&#xE22;&#xE15;&#xE2D;&#xE1A;&#xE2A;&#xE19;&#xE2D;&#xE07;&#xE15;&#xE48;&#xE2D;&#xE01;&#xE32;&#xE23;&#xE17;&#xE33;&#xE07;&#xE32;&#xE19;&#xE02;&#xE2D;&#xE07;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE08;&#xE32;&#xE01;&#xE01;&#xE32;&#xE23;&#xE1B;&#xE49;&#xE2D;&#xE19;&#xE02;&#xE49;&#xE2D;&#xE21;&#xE39;&#xE25;&#xE1C;&#xE48;&#xE32;&#xE19;&#xE0A;&#xE48;&#xE2D;&#xE07;&#xE17;&#xE32;&#xE07;&#xE15;&#xE48;&#xE32;&#xE07;&#xE46; (&#xE04;&#xE35;&#xE22;&#xE4C;&#xE1A;&#xE2D;&#xE23;&#xE4C;&#xE14;, &#xE40;&#xE21;&#xE49;&#xE32;&#xE2A;&#xE4C;, &#xE40;&#xE2A;&#xE35;&#xE22;&#xE07;, &#xE2A;&#xE31;&#xE21;&#xE1C;&#xE31;&#xE2A;) &#xE41;&#xE25;&#xE30;&#xE2A;&#xE32;&#xE21;&#xE32;&#xE23;&#xE16;&#xE23;&#xE2D;&#xE07;&#xE23;&#xE31;&#xE1A;&#xE1B;&#xE23;&#xE31;&#xE1A;&#xE15;&#xE31;&#xE27;&#xE08;&#xE32;&#xE01;&#xE01;&#xE32;&#xE23;&#xE40;&#xE1B;&#xE25;&#xE37;&#xE48;&#xE22;&#xE19;&#xE44;&#xE1B;&#xE02;&#xE2D;&#xE07;&#xE02;&#xE19;&#xE32;&#xE14;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE08;&#xE2D;&#xE15;&#xE32;&#xE21;&#xE41;&#xE15;&#xE48;&#xE25;&#xE30;&#xE2D;&#xE38;&#xE1B;&#xE01;&#xE23;&#xE13;&#xE4C;</p>
<h5 id="ui-regions">UI Regions</h5>
<p>&#xE40;&#xE25;&#xE22;&#xE4C;&#xE40;&#xE2D;&#xE49;&#xE32;&#xE17;&#xE4C;&#xE1B;&#xE23;&#xE30;&#xE01;&#xE2D;&#xE1A;&#xE44;&#xE1B;&#xE14;&#xE49;&#xE27;&#xE22;&#xE2A;&#xE48;&#xE27;&#xE19;&#xE15;&#xE48;&#xE32;&#xE07;&#xE46;&#xE40;&#xE0A;&#xE48;&#xE19; Application bar, Side Navigation, Content area &#xE42;&#xE14;&#xE22;&#xE17;&#xE35;&#xE48; UI regions &#xE15;&#xE48;&#xE32;&#xE07;&#xE46;&#xE04;&#xE27;&#xE23;&#xE08;&#xE30;&#xE21;&#xE35;&#xE04;&#xE27;&#xE32;&#xE21;&#xE2A;&#xE21;&#xE48;&#xE33;&#xE40;&#xE2A;&#xE21;&#xE2D;&#xE44;&#xE21;&#xE48;&#xE27;&#xE48;&#xE32;&#xE08;&#xE30;&#xE41;&#xE2A;&#xE14;&#xE07;&#xE1C;&#xE25;&#xE1C;&#xE48;&#xE32;&#xE19;&#xE2D;&#xE38;&#xE1B;&#xE01;&#xE23;&#xE13;&#xE4C;&#xE43;&#xE14;&#xE46;&#xE01;&#xE47;&#xE15;&#xE32;&#xE21;</p>
<h3 id="application-structure">Application Structure</h3>
<h5 id="desktop-and-tablet">Desktop and Tablet</h5>
<p><img src="images/visual-layout/screenRegions-01.png" alt="01"></p>
<ol>
<li>Global Application bar</li>
<li>Local Navigation bar</li>
<li>Extension panel</li>
</ol>
<p><img src="images/visual-layout/screenRegions-02.png" alt="01">
4. Application bar accessed with dropdown</p>
<p><img src="images/visual-layout/screenRegions-03.png" alt="01">
5. Overlay modal</p>
<p><img src="images/visual-layout/screenRegions-04.png" alt="01">
6. Full screen modal</p>
<h5 id="mobile">Mobile</h5>
<p><img src="images/visual-layout/Mobile-structure.png" alt="01"></p>
<ol>
<li>Application bar</li>
<li>Content area</li>
<li>Main navigation</li>
</ol>
<h3 id="apperance">Apperance</h3>
<h4 id><strong>&#xE41;&#xE15;&#xE01;&#xE15;&#xE48;&#xE32;&#xE07;&#xE19;&#xE49;&#xE2D;&#xE22;, &#xE40;&#xE15;&#xE34;&#xE21;&#xE40;&#xE17;&#xE48;&#xE32;&#xE17;&#xE35;&#xE48;&#xE08;&#xE33;&#xE40;&#xE1B;&#xE47;&#xE19;</strong></h4>
<p>&#xE01;&#xE32;&#xE23;&#xE41;&#xE1A;&#xE48;&#xE07;&#xE40;&#xE19;&#xE37;&#xE49;&#xE2D;&#xE2B;&#xE32;&#xE2D;&#xE2D;&#xE01;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE2A;&#xE48;&#xE27;&#xE19;&#xE46;&#xE19;&#xE31;&#xE49;&#xE19;&#xE19;&#xE2D;&#xE01;&#xE08;&#xE32;&#xE01;&#xE17;&#xE33;&#xE43;&#xE2B;&#xE49;&#xE40;&#xE01;&#xE34;&#xE14;&#xE04;&#xE27;&#xE32;&#xE21;&#xE2A;&#xE27;&#xE22;&#xE07;&#xE32;&#xE21;&#xE41;&#xE25;&#xE49;&#xE27;&#xE22;&#xE31;&#xE07;&#xE0A;&#xE48;&#xE27;&#xE22;&#xE43;&#xE2B;&#xE49;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE40;&#xE02;&#xE49;&#xE32;&#xE16;&#xE36;&#xE07;&#xE02;&#xE49;&#xE2D;&#xE21;&#xE39;&#xE25;&#xE44;&#xE14;&#xE49;&#xE21;&#xE35;&#xE1B;&#xE23;&#xE30;&#xE2A;&#xE34;&#xE17;&#xE18;&#xE34;&#xE20;&#xE32;&#xE1E;&#xE21;&#xE32;&#xE01;&#xE02;&#xE36;&#xE49;&#xE19;&#xE14;&#xE49;&#xE27;&#xE22; Visual &#xE15;&#xE48;&#xE32;&#xE07;&#xE46;&#xE17;&#xE35;&#xE48;&#xE43;&#xE2A;&#xE48;&#xE40;&#xE02;&#xE49;&#xE32;&#xE21;&#xE32;&#xE19;&#xE31;&#xE49;&#xE19;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE43;&#xE2A;&#xE48;&#xE14;&#xE49;&#xE27;&#xE22;&#xE04;&#xE27;&#xE32;&#xE21;&#xE23;&#xE30;&#xE21;&#xE31;&#xE14;&#xE23;&#xE30;&#xE27;&#xE31;&#xE07;&#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE44;&#xE21;&#xE48;&#xE43;&#xE2B;&#xE49;&#xE01;&#xE27;&#xE19;&#xE2B;&#xE23;&#xE37;&#xE2D;&#xE41;&#xE02;&#xE48;&#xE07;&#xE01;&#xE31;&#xE1A;&#xE40;&#xE19;&#xE37;&#xE49;&#xE2D;&#xE2B;&#xE32;&#xE2B;&#xE25;&#xE31;&#xE01;&#xE17;&#xE35;&#xE48;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE31;&#xE49;&#xE19;&#xE01;&#xE33;&#xE25;&#xE31;&#xE07;&#xE2A;&#xE19;&#xE43;&#xE08;&#xE2D;&#xE22;&#xE39;&#xE48;</p>
<p><img src="images/visual-layout/Layout-Structure.jpg" alt="01"></p>
<h4 id="1.">1. &#xE2B;&#xE31;&#xE27;&#xE40;&#xE23;&#xE37;&#xE48;&#xE2D;&#xE07;</h4>
<p>&#xE2B;&#xE31;&#xE27;&#xE40;&#xE23;&#xE37;&#xE48;&#xE2D;&#xE07;&#xE44;&#xE21;&#xE48;&#xE08;&#xE33;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE2D;&#xE22;&#xE39;&#xE48;&#xE43;&#xE19;&#xE01;&#xE23;&#xE2D;&#xE1A;&#xE40;&#xE19;&#xE37;&#xE49;&#xE2D;&#xE2B;&#xE32;&#xE43;&#xE14;&#xE46;</p>
<h4 id="2.">2. &#xE2A;&#xE48;&#xE27;&#xE19;&#xE02;&#xE22;&#xE32;&#xE22;&#xE02;&#xE2D;&#xE07;&#xE2B;&#xE31;&#xE27;&#xE40;&#xE23;&#xE37;&#xE48;&#xE2D;&#xE07;</h4>
<p>&#xE2B;&#xE31;&#xE27;&#xE40;&#xE23;&#xE37;&#xE48;&#xE2D;&#xE07;&#xE41;&#xE25;&#xE30;&#xE2A;&#xE48;&#xE27;&#xE19;&#xE02;&#xE22;&#xE32;&#xE22;&#xE02;&#xE2D;&#xE07;&#xE2B;&#xE31;&#xE27;&#xE40;&#xE23;&#xE37;&#xE48;&#xE2D;&#xE07;&#xE19;&#xE31;&#xE49;&#xE19;&#xE44;&#xE21;&#xE48;&#xE08;&#xE33;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE2D;&#xE22;&#xE39;&#xE48;&#xE1A;&#xE19;&#xE01;&#xE23;&#xE2D;&#xE1A;&#xE40;&#xE19;&#xE37;&#xE49;&#xE2D;&#xE2B;&#xE32;&#xE43;&#xE14;&#xE46;&#xE01;&#xE47;&#xE44;&#xE14;&#xE49; &#xE40;&#xE19;&#xE37;&#xE48;&#xE2D;&#xE07;&#xE08;&#xE32;&#xE01;&#xE17;&#xE35;&#xE48; Panel &#xE43;&#xE14;&#xE46;&#xE01;&#xE47;&#xE15;&#xE32;&#xE21;&#xE40;&#xE23;&#xE32;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE01;&#xE32;&#xE23;&#xE43;&#xE2B;&#xE49;&#xE04;&#xE27;&#xE32;&#xE21;&#xE2A;&#xE33;&#xE04;&#xE31;&#xE0D;&#xE01;&#xE31;&#xE1A;&#xE40;&#xE19;&#xE37;&#xE49;&#xE2D;&#xE2B;&#xE32;&#xE21;&#xE32;&#xE01;&#xE01;&#xE27;&#xE48;&#xE32;&#xE2B;&#xE31;&#xE27;&#xE40;&#xE23;&#xE37;&#xE48;&#xE2D;&#xE07;</p>
<h4 id="3.-container">3. &#xE01;&#xE23;&#xE2D;&#xE1A;&#xE40;&#xE19;&#xE37;&#xE49;&#xE2D;&#xE2B;&#xE32; / Container</h4>
<p>&#xE2B;&#xE32;&#xE01;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE01;&#xE32;&#xE23;&#xE08;&#xE31;&#xE14;&#xE40;&#xE19;&#xE37;&#xE49;&#xE2D;&#xE2B;&#xE32;&#xE17;&#xE35;&#xE48;&#xE21;&#xE35;&#xE04;&#xE27;&#xE32;&#xE21;&#xE2A;&#xE31;&#xE21;&#xE1E;&#xE31;&#xE19;&#xE18;&#xE4C;&#xE2D;&#xE2D;&#xE01;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE2A;&#xE48;&#xE27;&#xE19;&#xE46;&#xE41;&#xE25;&#xE30;&#xE2A;&#xE32;&#xE21;&#xE32;&#xE23;&#xE16;&#xE15;&#xE31;&#xE49;&#xE07;&#xE0A;&#xE37;&#xE48;&#xE2D;&#xE08;&#xE31;&#xE14;&#xE01;&#xE25;&#xE38;&#xE48;&#xE21;&#xE44;&#xE14;&#xE49;&#xE2D;&#xE22;&#xE48;&#xE32;&#xE07;&#xE0A;&#xE31;&#xE14;&#xE40;&#xE08;&#xE19; &#xE43;&#xE2B;&#xE49;&#xE1E;&#xE34;&#xE08;&#xE32;&#xE23;&#xE13;&#xE32;&#xE01;&#xE32;&#xE23;&#xE43;&#xE0A;&#xE49;&#xE01;&#xE23;&#xE2D;&#xE1A;&#xE40;&#xE19;&#xE37;&#xE49;&#xE2D;&#xE2B;&#xE32;</p>
<h4 id="4.-dropdown">4. Dropdown</h4>
<p>Dropdown &#xE14;&#xE39;&#xE25;&#xE2D;&#xE22;&#xE02;&#xE36;&#xE49;&#xE19;&#xE21;&#xE32;&#xE08;&#xE32;&#xE01;&#xE40;&#xE19;&#xE37;&#xE49;&#xE2D;&#xE2B;&#xE32;&#xE1B;&#xE01;&#xE15;&#xE34;&#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE43;&#xE2B;&#xE49;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE41;&#xE22;&#xE01;&#xE2D;&#xE2D;&#xE01;&#xE44;&#xE14;&#xE49;&#xE0A;&#xE31;&#xE14;&#xE40;&#xE08;&#xE19;&#xE23;&#xE30;&#xE2B;&#xE27;&#xE48;&#xE32;&#xE07;&#xE40;&#xE19;&#xE37;&#xE49;&#xE2D;&#xE2B;&#xE32;&#xE1B;&#xE01;&#xE15;&#xE34;&#xE01;&#xE31;&#xE1A;&#xE40;&#xE19;&#xE37;&#xE49;&#xE2D;&#xE2B;&#xE32;&#xE02;&#xE2D;&#xE07; Dropdown</p>
<h4 id="5.-divider">5. &#xE40;&#xE2A;&#xE49;&#xE19;&#xE04;&#xE31;&#xE48;&#xE19; / Divider</h4>
<p>&#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE44;&#xE21;&#xE48;&#xE43;&#xE2B;&#xE49;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE01;&#xE32;&#xE23;&#xE23;&#xE1A;&#xE01;&#xE27;&#xE19;&#xE40;&#xE19;&#xE37;&#xE49;&#xE2D;&#xE2B;&#xE32;&#xE2B;&#xE25;&#xE31;&#xE01; &#xE40;&#xE2A;&#xE49;&#xE19;&#xE04;&#xE31;&#xE48;&#xE19;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE14;&#xE39;&#xE40;&#xE25;&#xE47;&#xE01;&#xE41;&#xE25;&#xE30;&#xE1A;&#xE32;&#xE07;</p>
<h4 id="6.">6. &#xE2B;&#xE21;&#xE32;&#xE22;&#xE40;&#xE2B;&#xE15;&#xE38;</h4>
<h4 id="7.-divider">7. &#xE40;&#xE2A;&#xE49;&#xE19;&#xE04;&#xE31;&#xE48;&#xE19; / Divider</h4>
<h4 id="8.">8. &#xE23;&#xE32;&#xE22;&#xE01;&#xE32;&#xE23;</h4>
<p>&#xE23;&#xE30;&#xE2B;&#xE27;&#xE48;&#xE32;&#xE07;&#xE23;&#xE32;&#xE22;&#xE01;&#xE32;&#xE23;&#xE2B;&#xE32;&#xE01;&#xE21;&#xE35; identifier &#xE2D;&#xE37;&#xE48;&#xE19;&#xE41;&#xE25;&#xE49;&#xE27;&#xE40;&#xE0A;&#xE48;&#xE19;&#xE44;&#xE2D;&#xE04;&#xE2D;&#xE19;, &#xE40;&#xE25;&#xE02;&#xE25;&#xE33;&#xE14;&#xE31;&#xE1A;&#xE2B;&#xE23;&#xE37;&#xE2D; Checkbox &#xE01;&#xE47;&#xE44;&#xE21;&#xE48;&#xE08;&#xE33;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE21;&#xE35;&#xE40;&#xE2A;&#xE49;&#xE19;&#xE01;&#xE31;&#xE49;&#xE19;&#xE2B;&#xE23;&#xE37;&#xE2D;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE2D;&#xE22;&#xE39;&#xE48;&#xE43;&#xE19;&#xE01;&#xE23;&#xE2D;&#xE1A;&#xE02;&#xE49;&#xE2D;&#xE04;&#xE27;&#xE32;&#xE21;&#xE43;&#xE14;&#xE46;&#xE2D;&#xE35;&#xE01;</p>
<h4 id="9.-section-divider">9. &#xE01;&#xE32;&#xE23;&#xE41;&#xE1A;&#xE48;&#xE07;&#xE2A;&#xE48;&#xE27;&#xE19;&#xE40;&#xE19;&#xE37;&#xE49;&#xE2D;&#xE2B;&#xE32; / Section Divider</h4>
<p>&#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE01;&#xE32;&#xE23;&#xE41;&#xE1A;&#xE48;&#xE07;&#xE40;&#xE19;&#xE37;&#xE49;&#xE2D;&#xE2B;&#xE32;&#xE2D;&#xE2D;&#xE01;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE2A;&#xE48;&#xE27;&#xE19;&#xE46; &#xE41;&#xE15;&#xE48;&#xE44;&#xE21;&#xE48;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE01;&#xE32;&#xE23;&#xE43;&#xE2B;&#xE49;&#xE14;&#xE39;&#xE40;&#xE14;&#xE48;&#xE19;&#xE0A;&#xE31;&#xE14;&#xE44;&#xE1B;&#xE01;&#xE27;&#xE48;&#xE32;&#xE40;&#xE19;&#xE37;&#xE49;&#xE2D;&#xE2B;&#xE32;&#xE1B;&#xE01;&#xE15;&#xE34; &#xE2A;&#xE32;&#xE21;&#xE32;&#xE23;&#xE16;&#xE43;&#xE0A;&#xE49;&#xE40;&#xE2A;&#xE49;&#xE19;&#xE04;&#xE31;&#xE48;&#xE19;&#xE1E;&#xE23;&#xE49;&#xE2D;&#xE21;&#xE01;&#xE31;&#xE1A;&#xE40;&#xE1B;&#xE25;&#xE35;&#xE48;&#xE22;&#xE19;&#xE2A;&#xE35;&#xE1E;&#xE37;&#xE49;&#xE19;&#xE2B;&#xE25;&#xE31;&#xE07;&#xE40;&#xE1E;&#xE35;&#xE22;&#xE07;&#xE40;&#xE25;&#xE47;&#xE01;&#xE19;&#xE49;&#xE2D;&#xE22;</p>

        </div>
        <div class="footer-nav">
          <div class="left"><a href="guideline-navigation.html"><span class="title">Navigation</span></a></div>
          <div class="right"><a href="guideline-element.html"><span class="label">Next: </span><span class="title">Element</span></a></div>
        </div>
      </div>
    </div>
  </body>
</html>