<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf-8">
    <link rel="stylesheet" href="assets/style.css?t=90051322">
    <link rel="stylesheet" href="https://ricostacruz.com/docpress-rsc/style.css">
    <link rel="stylesheet" href="extra.css?t=5c8ec47c">
    <script src="assets/script.js?t=93f1a66c"></script>
    <title>Element - Sankom Design</title>
    <meta name="viewport" content="width=device-width">
  </head>
  <body class="-menu-visible">
    <div class="doc-layout">
      <div class="toggle menu-toggle js-menu-toggle"></div>
      <div class="menu toc-menu">
        <ul>
          <li class="menu-item -level-0 -parent">
            <ul class="submenu">
              <li class="menu-item -level-1"><a class="link title  link-index" href="index.html">Sankom Design</a>
              </li>
              <li class="menu-item -level-1"><a class="link title  link-getting-start" href="getting-start.html">Getting Start</a>
              </li>
              <li class="menu-item -level-1"><a class="link title  link-design-principle" href="design-principle.html">Design Principle</a>
              </li>
              <li class="menu-item -level-1 -parent"><span class="title">Guideline</span>
                <ul class="submenu">
                  <li class="menu-item -level-2"><a class="link title  link-guideline-navigation" href="guideline-navigation.html">Navigation</a>
                  </li>
                  <li class="menu-item -level-2"><a class="link title  link-guideline-layout" href="guideline-layout.html">Layout</a>
                  </li>
                  <li class="menu-item -level-2"><a class="link title -active link-guideline-element" href="guideline-element.html">Element</a>
                    <ul class="headings heading-list">
                      <li class="heading-item -depth-2"><a class="hlink link-input-box" href="#input-box">Input Box</a>
                      </li>
                      <li class="heading-item -depth-2"><a class="hlink link-selection-control" href="#selection-control">Selection Control</a>
                      </li>
                      <li class="heading-item -depth-2"><a class="hlink link-button" href="#button">Button</a>
                      </li>
                      <li class="heading-item -depth-2"><a class="hlink link-modal" href="#modal">Modal</a>
                      </li>
                      <li class="heading-item -depth-2"><a class="hlink link-list-of-items" href="#list-of-items">List of items</a>
                      </li>
                      <li class="heading-item -depth-2"><a class="hlink link-card" href="#card">Card</a>
                      </li>
                      <li class="heading-item -depth-2"><a class="hlink link-loader" href="#loader">Loader</a>
                      </li>
                      <li class="heading-item -depth-2"><a class="hlink link-breadcrumb" href="#breadcrumb">Breadcrumb</a>
                      </li>
                    </ul>
                  </li>
                  <li class="menu-item -level-2"><span class="title">Plugin</span>
                  </li>
                  <li class="menu-item -level-2"><span class="title">New Account</span>
                  </li>
                </ul>
              </li>
              <li class="menu-item -level-1 -parent"><span class="title">Visual</span>
                <ul class="submenu">
                  <li class="menu-item -level-2"><a class="link title  link-visual-color" href="visual-color.html">Colors</a>
                  </li>
                  <li class="menu-item -level-2"><a class="link title  link-visual-grid" href="visual-grid.html">Grid</a>
                  </li>
                  <li class="menu-item -level-2"><a class="link title  link-visual-font" href="visual-font.html">Fonts</a>
                  </li>
                  <li class="menu-item -level-2"><span class="title">Icon</span>
                  </li>
                </ul>
              </li>
              <li class="menu-item -level-1"><a class="link title  link-contribute" href="contribute.html">Contribute</a>
              </li>
            </ul>
          </li>
        </ul>
      </div>
      <div class="body page-guideline-element">
        <div class="header-nav">
          <div class="right"><a class="iconlink" href="https://github.com/sankomdesign/guideline" data-title="sankomdesign/guideline">
              <!-- span.title Open in GitHub--><span class="icon -github"></span></a>
          </div>
        </div>
        <div class="markdown-body"><h1 id="element">Element</h1>
<p>Element. &#xE04;&#xE37;&#xE2D;&#xE2A;&#xE48;&#xE27;&#xE19;&#xE17;&#xE35;&#xE48;&#xE1B;&#xE23;&#xE30;&#xE01;&#xE2D;&#xE1A;&#xE02;&#xE36;&#xE49;&#xE19;&#xE40;&#xE1B;&#xE47;&#xE19; User interface &#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE21;&#xE35;&#xE04;&#xE27;&#xE32;&#xE21;&#xE04;&#xE38;&#xE49;&#xE19;&#xE40;&#xE04;&#xE22;&#xE01;&#xE31;&#xE1A; User interface &#xE08;&#xE32;&#xE01;&#xE1B;&#xE23;&#xE30;&#xE2A;&#xE1A;&#xE01;&#xE32;&#xE23;&#xE13;&#xE4C;&#xE17;&#xE35;&#xE48;&#xE1C;&#xE48;&#xE32;&#xE19;&#xE21;&#xE32;&#xE02;&#xE2D;&#xE07;&#xE1E;&#xE27;&#xE01;&#xE40;&#xE02;&#xE32; &#xE42;&#xE1B;&#xE23;&#xE14;&#xE40;&#xE25;&#xE37;&#xE2D;&#xE01;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE14;&#xE49;&#xE27;&#xE22;&#xE04;&#xE27;&#xE32;&#xE21;&#xE23;&#xE30;&#xE21;&#xE31;&#xE14;&#xE23;&#xE30;&#xE27;&#xE31;&#xE07; &#xE42;&#xE14;&#xE22;&#xE04;&#xE33;&#xE19;&#xE36;&#xE07;&#xE16;&#xE36;&#xE07;&#xE04;&#xE27;&#xE32;&#xE21;&#xE2A;&#xE21;&#xE48;&#xE33;&#xE40;&#xE2A;&#xE21;&#xE2D;&#xE41;&#xE25;&#xE30;&#xE2A;&#xE32;&#xE21;&#xE32;&#xE23;&#xE16;&#xE04;&#xE32;&#xE14;&#xE40;&#xE14;&#xE32;&#xE44;&#xE14;&#xE49; &#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE0A;&#xE48;&#xE27;&#xE22;&#xE43;&#xE2B;&#xE49;&#xE40;&#xE1B;&#xE49;&#xE32;&#xE2B;&#xE21;&#xE32;&#xE22;&#xE02;&#xE2D;&#xE07;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE19;&#xE31;&#xE49;&#xE19;&#xE40;&#xE2A;&#xE23;&#xE47;&#xE08;&#xE41;&#xE1A;&#xE1A;&#xE21;&#xE35;&#xE1B;&#xE23;&#xE30;&#xE2A;&#xE34;&#xE17;&#xE18;&#xE34;&#xE20;&#xE32;&#xE1E;&#xE41;&#xE25;&#xE30;&#xE44;&#xE14;&#xE49;&#xE23;&#xE31;&#xE1A;&#xE04;&#xE27;&#xE32;&#xE21;&#xE1E;&#xE36;&#xE07;&#xE1E;&#xE2D;&#xE43;&#xE08;</p>
<h5 id="1.-input-controls">1. Input controls</h5>
<ul>
<li>Button, Data field, List-Box</li>
</ul>
<h5 id="2.-selection-controls">2. Selection controls</h5>
<ul>
<li>Toggles, Radio-button, Checkbox, Dropdown list</li>
</ul>
<h5 id="3.-navigational-components">3. Navigational components</h5>
<ul>
<li>Breadcrumb, Slider, Search, Pagination, Tag, Navigation Bar</li>
</ul>
<h5 id="4.-informational-components">4. Informational components</h5>
<ul>
<li>Tool-tip, icon, Progress bar, Notification, Message Box, Modal</li>
</ul>
<h5 id="5.-container">5. Container</h5>
<ul>
<li>Accordion</li>
</ul>
<h2 id="input-box">Input Box</h2>
<h4 id><strong>&#xE0A;&#xE31;&#xE14;&#xE40;&#xE08;&#xE19;, &#xE41;&#xE15;&#xE01;&#xE15;&#xE48;&#xE32;&#xE07;&#xE41;&#xE25;&#xE30;&#xE21;&#xE35;&#xE1B;&#xE23;&#xE30;&#xE2A;&#xE34;&#xE17;&#xE18;&#xE4C;&#xE20;&#xE32;&#xE1E;</strong></h4>
<p>&#xE0A;&#xE48;&#xE2D;&#xE07;&#xE17;&#xE35;&#xE48;&#xE44;&#xE27;&#xE49;&#xE2A;&#xE33;&#xE2B;&#xE23;&#xE31;&#xE1A;&#xE01;&#xE23;&#xE2D;&#xE01;&#xE02;&#xE49;&#xE2D;&#xE21;&#xE39;&#xE25;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE14;&#xE39;&#xE41;&#xE15;&#xE01;&#xE15;&#xE48;&#xE32;&#xE07;&#xE08;&#xE32;&#xE01;&#xE02;&#xE49;&#xE2D;&#xE04;&#xE27;&#xE32;&#xE21;&#xE1B;&#xE01;&#xE15;&#xE34; &#xE15;&#xE49;&#xE2D;&#xE07;&#xE40;&#xE0A;&#xE37;&#xE49;&#xE2D;&#xE40;&#xE0A;&#xE34;&#xE0D;&#xE43;&#xE2B;&#xE49;&#xE21;&#xE35;&#xE1B;&#xE0F;&#xE34;&#xE2A;&#xE31;&#xE21;&#xE1E;&#xE31;&#xE19;&#xE18;&#xE4C;
&#xE23;&#xE30;&#xE22;&#xE30;&#xE2B;&#xE48;&#xE32;&#xE07;&#xE23;&#xE30;&#xE2B;&#xE27;&#xE48;&#xE32;&#xE07;&#xE01;&#xE31;&#xE19;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE40;&#xE1E;&#xE35;&#xE22;&#xE07;&#xE1E;&#xE2D;&#xE15;&#xE48;&#xE2D;&#xE01;&#xE32;&#xE23;&#xE41;&#xE22;&#xE01;&#xE41;&#xE22;&#xE30;&#xE27;&#xE48;&#xE32;&#xE01;&#xE33;&#xE25;&#xE31;&#xE07;&#xE01;&#xE23;&#xE2D;&#xE01;&#xE0A;&#xE48;&#xE2D;&#xE07;&#xE43;&#xE14;&#xE2D;&#xE22;&#xE39;&#xE48;
&#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE43;&#xE14;&#xE17;&#xE35;&#xE48;&#xE01;&#xE23;&#xE2D;&#xE01;&#xE1C;&#xE34;&#xE14;&#xE2B;&#xE23;&#xE37;&#xE2D;&#xE40;&#xE01;&#xE34;&#xE14;&#xE04;&#xE27;&#xE32;&#xE21;&#xE1C;&#xE34;&#xE14;&#xE1E;&#xE25;&#xE32;&#xE14;&#xE43;&#xE14;&#xE46; &#xE15;&#xE31;&#xE27;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE40;&#xE2D;&#xE07;&#xE2A;&#xE32;&#xE21;&#xE32;&#xE23;&#xE16;&#xE41;&#xE01;&#xE49;&#xE1B;&#xE31;&#xE0D;&#xE2B;&#xE32;&#xE44;&#xE14;&#xE49;&#xE14;&#xE49;&#xE27;&#xE22;&#xE15;&#xE31;&#xE27;&#xE40;&#xE2D;&#xE07;&#xE2D;&#xE22;&#xE48;&#xE32;&#xE07;&#xE23;&#xE27;&#xE14;&#xE40;&#xE23;&#xE47;&#xE27;</p>
<h4 id>&#xE23;&#xE39;&#xE1B;&#xE23;&#xE48;&#xE32;&#xE07;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE15;&#xE32;&#xE02;&#xE2D;&#xE07;&#xE0A;&#xE48;&#xE2D;&#xE07;&#xE01;&#xE23;&#xE2D;&#xE01;</h4>
<p>&#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE43;&#xE2B;&#xE49;&#xE21;&#xE35;&#xE1B;&#xE23;&#xE30;&#xE2A;&#xE34;&#xE17;&#xE18;&#xE34;&#xE20;&#xE32;&#xE1E;&#xE23;&#xE39;&#xE1B;&#xE23;&#xE48;&#xE32;&#xE07;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE15;&#xE32;&#xE04;&#xE27;&#xE23;&#xE08;&#xE30;&#xE14;&#xE39;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE0A;&#xE48;&#xE2D;&#xE07;&#xE27;&#xE48;&#xE32;&#xE07;&#xE41;&#xE25;&#xE30;&#xE21;&#xE35;&#xE1B;&#xE0F;&#xE34;&#xE2A;&#xE31;&#xE21;&#xE1E;&#xE31;&#xE19;&#xE18;&#xE4C;&#xE44;&#xE14;&#xE49;</p>
<p><img src="images/text-box/Text-Box-Apperance.jpg" alt="Test"></p>
<h4 id>&#xE23;&#xE30;&#xE22;&#xE30;&#xE2B;&#xE48;&#xE32;&#xE07;&#xE23;&#xE30;&#xE2B;&#xE27;&#xE48;&#xE32;&#xE07;&#xE01;&#xE31;&#xE19;</h4>
<p>&#xE15;&#xE49;&#xE2D;&#xE07;&#xE40;&#xE1E;&#xE35;&#xE22;&#xE07;&#xE1E;&#xE2D;&#xE43;&#xE2B;&#xE49;&#xE41;&#xE22;&#xE01;&#xE44;&#xE14;&#xE49;&#xE27;&#xE48;&#xE32; <strong>&#xE1B;&#xE49;&#xE32;&#xE22;&#xE0A;&#xE37;&#xE48;&#xE2D; (Label)</strong> &#xE19;&#xE31;&#xE49;&#xE19;&#xE46;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE02;&#xE2D;&#xE07;&#xE0A;&#xE48;&#xE2D;&#xE07;&#xE01;&#xE23;&#xE2D;&#xE01;&#xE43;&#xE14;</p>
<p><img src="images/text-box/Text-Box-Spacing.jpg" alt="Test"></p>
<h4 id>&#xE01;&#xE32;&#xE23;&#xE40;&#xE23;&#xE35;&#xE22;&#xE07;&#xE25;&#xE33;&#xE14;&#xE31;&#xE1A;&#xE02;&#xE2D;&#xE07;&#xE0A;&#xE48;&#xE2D;&#xE07;&#xE01;&#xE23;&#xE2D;&#xE01;</h4>
<p>&#xE2B;&#xE32;&#xE01;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE44;&#xE1B;&#xE44;&#xE14;&#xE49; 1 &#xE1A;&#xE23;&#xE23;&#xE17;&#xE31;&#xE14;&#xE04;&#xE27;&#xE23;&#xE21;&#xE35;&#xE0A;&#xE48;&#xE2D;&#xE07;&#xE01;&#xE23;&#xE2D;&#xE07; 1 &#xE0A;&#xE48;&#xE2D;&#xE07; &#xE2B;&#xE32;&#xE01;&#xE21;&#xE35;&#xE21;&#xE32;&#xE01;&#xE01;&#xE27;&#xE48;&#xE32;&#xE19;&#xE31;&#xE49;&#xE19;&#xE08;&#xE30;&#xE17;&#xE33;&#xE43;&#xE2B;&#xE49;&#xE1B;&#xE23;&#xE30;&#xE2A;&#xE34;&#xE17;&#xE18;&#xE34;&#xE20;&#xE32;&#xE1E;&#xE2B;&#xE32;&#xE22;&#xE44;&#xE1B;&#xE40;&#xE19;&#xE37;&#xE48;&#xE2D;&#xE07;&#xE08;&#xE32;&#xE01;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE15;&#xE35;&#xE04;&#xE27;&#xE32;&#xE21;&#xE04;&#xE27;&#xE32;&#xE21;&#xE2A;&#xE31;&#xE21;&#xE1E;&#xE31;&#xE19;&#xE18;&#xE4C;&#xE02;&#xE2D;&#xE07;&#xE41;&#xE15;&#xE48;&#xE25;&#xE30;&#xE0A;&#xE48;&#xE2D;&#xE07;&#xE01;&#xE23;&#xE2D;&#xE01;
&#xE27;&#xE48;&#xE32;&#xE04;&#xE27;&#xE23;&#xE01;&#xE23;&#xE2D;&#xE01;&#xE41;&#xE19;&#xE27;&#xE15;&#xE31;&#xE49;&#xE07;&#xE2B;&#xE23;&#xE37;&#xE2D;&#xE41;&#xE19;&#xE27;&#xE19;&#xE2D;&#xE19;&#xE01;&#xE48;&#xE2D;&#xE19;</p>
<p><img src="images/text-box/Text-Box-arrange01.jpg" alt="Test">
&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE15;&#xE35;&#xE04;&#xE27;&#xE32;&#xE21;&#xE27;&#xE48;&#xE32;&#xE04;&#xE27;&#xE23;&#xE08;&#xE30;&#xE01;&#xE23;&#xE2D;&#xE01;&#xE41;&#xE19;&#xE27;&#xE15;&#xE31;&#xE49;&#xE07;&#xE2B;&#xE23;&#xE37;&#xE2D;&#xE41;&#xE19;&#xE27;&#xE19;&#xE2D;&#xE19;&#xE01;&#xE48;&#xE2D;&#xE19; &#xE41;&#xE25;&#xE49;&#xE27;&#xE08;&#xE30;&#xE01;&#xE23;&#xE2D;&#xE01;&#xE22;&#xE32;&#xE01;&#xE02;&#xE36;&#xE49;&#xE19;&#xE2D;&#xE35;&#xE01;&#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE21;&#xE35;&#xE08;&#xE33;&#xE19;&#xE27;&#xE19; Row-Column &#xE40;&#xE1E;&#xE34;&#xE48;&#xE21;&#xE21;&#xE32;&#xE01;&#xE02;&#xE36;&#xE49;&#xE19;</p>
<p><img src="images/text-box/Text-Box-arrange02.jpg" alt="Test">
&#xE01;&#xE23;&#xE2D;&#xE01;&#xE1A;&#xE19;-&#xE25;&#xE07;&#xE25;&#xE48;&#xE32;&#xE07;&#xE17;&#xE34;&#xE28;&#xE17;&#xE32;&#xE07;&#xE40;&#xE14;&#xE35;&#xE22;&#xE27;</p>
<p><img src="images/text-box/Text-Box-inlineGrouping.jpg" alt="Test">
&#xE14;&#xE49;&#xE27;&#xE22;&#xE1B;&#xE23;&#xE34;&#xE21;&#xE32;&#xE13;&#xE02;&#xE49;&#xE2D;&#xE21;&#xE39;&#xE25;&#xE17;&#xE35;&#xE48;&#xE21;&#xE35;&#xE21;&#xE32;&#xE01;&#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE08;&#xE23;&#xE34;&#xE07; &#xE2B;&#xE32;&#xE01;&#xE21;&#xE35;&#xE40;&#xE19;&#xE37;&#xE48;&#xE2D;&#xE17;&#xE35;&#xE48;&#xE08;&#xE33;&#xE01;&#xE31;&#xE14; &#xE43;&#xE2B;&#xE49;&#xE08;&#xE31;&#xE14;&#xE01;&#xE25;&#xE38;&#xE48;&#xE21;&#xE02;&#xE49;&#xE2D;&#xE21;&#xE39;&#xE25;&#xE1E;&#xE23;&#xE49;&#xE2D;&#xE21;&#xE17;&#xE35;&#xE48;&#xE15;&#xE31;&#xE49;&#xE07;&#xE0A;&#xE37;&#xE48;&#xE2D;&#xE01;&#xE25;&#xE38;&#xE48;&#xE21;&#xE43;&#xE2B;&#xE49;&#xE21;&#xE35;&#xE04;&#xE27;&#xE32;&#xE21;&#xE2A;&#xE31;&#xE21;&#xE1E;&#xE31;&#xE19;&#xE18;&#xE4C;&#xE01;&#xE31;&#xE19; &#xE40;&#xE23;&#xE32;&#xE22;&#xE31;&#xE07;&#xE43;&#xE0A;&#xE49;&#xE1B;&#xE23;&#xE30;&#xE42;&#xE22;&#xE0A;&#xE19;&#xE4C;&#xE02;&#xE2D;&#xE07; 1 &#xE0A;&#xE48;&#xE2D;&#xE07;&#xE01;&#xE23;&#xE2D;&#xE01;&#xE15;&#xE48;&#xE2D; 1 &#xE41;&#xE16;&#xE27;
&#xE40;&#xE1E;&#xE35;&#xE22;&#xE07;&#xE41;&#xE04;&#xE48;&#xE15;&#xE35;&#xE04;&#xE27;&#xE32;&#xE21;&#xE27;&#xE48;&#xE32;&#xE43;&#xE19; 1 &#xE0A;&#xE48;&#xE2D;&#xE07;&#xE01;&#xE23;&#xE2D;&#xE01;&#xE21;&#xE35;&#xE2D;&#xE35;&#xE01;&#xE2B;&#xE25;&#xE32;&#xE22;&#xE40;&#xE23;&#xE37;&#xE48;&#xE2D;&#xE07;&#xE22;&#xE48;&#xE2D;&#xE22;</p>
<h4 id>&#xE23;&#xE39;&#xE1B;&#xE41;&#xE1A;&#xE1A;&#xE01;&#xE32;&#xE23;&#xE27;&#xE48;&#xE32;&#xE07;&#xE1B;&#xE49;&#xE32;&#xE22;&#xE0A;&#xE37;&#xE48;&#xE2D;&#xE02;&#xE2D;&#xE07;&#xE0A;&#xE48;&#xE2D;&#xE07;&#xE01;&#xE23;&#xE2D;&#xE01;</h4>
<p>&#xE40;&#xE25;&#xE37;&#xE2D;&#xE01;&#xE43;&#xE0A;&#xE49;&#xE44;&#xE14;&#xE49;&#xE15;&#xE32;&#xE21;&#xE04;&#xE27;&#xE32;&#xE21;&#xE40;&#xE2B;&#xE21;&#xE32;&#xE30;&#xE2A;&#xE21; &#xE42;&#xE14;&#xE22;&#xE43;&#xE2B;&#xE49;&#xE04;&#xE33;&#xE19;&#xE36;&#xE07;&#xE16;&#xE36;&#xE07;&#xE1B;&#xE23;&#xE30;&#xE2A;&#xE34;&#xE17;&#xE18;&#xE34;&#xE20;&#xE32;&#xE1E; &#xE01;&#xE32;&#xE23;&#xE15;&#xE35;&#xE04;&#xE27;&#xE32;&#xE21;&#xE02;&#xE2D;&#xE07;&#xE04;&#xE27;&#xE32;&#xE21;&#xE2A;&#xE31;&#xE21;&#xE1E;&#xE31;&#xE19;&#xE18;&#xE4C;&#xE02;&#xE2D;&#xE07;&#xE41;&#xE15;&#xE48;&#xE25;&#xE30;&#xE0A;&#xE48;&#xE2D;&#xE07;&#xE01;&#xE23;&#xE2D;&#xE01;&#xE41;&#xE25;&#xE30;&#xE01;&#xE32;&#xE23;&#xE43;&#xE0A;&#xE49;&#xE1E;&#xE37;&#xE49;&#xE19;&#xE17;&#xE35;&#xE48;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE08;&#xE2D;</p>
<h5 id="standard-text-field">&#xE41;&#xE1A;&#xE1A;&#xE21;&#xE32;&#xE15;&#xE23;&#xE10;&#xE32;&#xE19; / Standard text-field</h5>
<p><img src="images/text-box/Text-Box-TypeStandard.jpg" alt="Test"></p>
<h5 id="inline-label-text-field">&#xE41;&#xE1A;&#xE1A;&#xE1B;&#xE49;&#xE32;&#xE22;&#xE0A;&#xE37;&#xE48;&#xE2D;&#xE2D;&#xE22;&#xE39;&#xE48;&#xE23;&#xE30;&#xE19;&#xE32;&#xE1A;&#xE40;&#xE14;&#xE35;&#xE22;&#xE27;&#xE01;&#xE31;&#xE19;&#xE0A;&#xE48;&#xE2D;&#xE07;&#xE01;&#xE23;&#xE2D;&#xE01; / Inline label text-field</h5>
<p><img src="images/text-box/Text-Box-TypeinlineDo.jpg" alt="Test">
<img src="images/text-box/Text-Box-TypeinlineDont.jpg" alt="Test">
&#xE1B;&#xE49;&#xE32;&#xE22;&#xE0A;&#xE37;&#xE48;&#xE2D; - &#xE0A;&#xE48;&#xE2D;&#xE07;&#xE01;&#xE23;&#xE2D;&#xE01;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE2D;&#xE22;&#xE39;&#xE48;&#xE43;&#xE01;&#xE25;&#xE49;&#xE01;&#xE31;&#xE19;&#xE43;&#xE2B;&#xE49;&#xE21;&#xE32;&#xE01;&#xE17;&#xE35;&#xE48;&#xE2A;&#xE38;&#xE14; &#xE2B;&#xE32;&#xE01;&#xE2B;&#xE48;&#xE32;&#xE07;&#xE01;&#xE31;&#xE19;&#xE21;&#xE32;&#xE01;&#xE08;&#xE30;&#xE17;&#xE33;&#xE43;&#xE2B;&#xE49;&#xE1B;&#xE23;&#xE30;&#xE2A;&#xE34;&#xE17;&#xE18;&#xE34;&#xE20;&#xE32;&#xE1E;&#xE25;&#xE14;&#xE25;&#xE07;</p>
<h4 id>&#xE42;&#xE04;&#xE23;&#xE07;&#xE2A;&#xE23;&#xE49;&#xE32;&#xE07;</h4>
<p><img src="images/text-box/Text-Box-Anatomy.jpg" alt="Test"></p>
<ol>
<li><strong>&#xE0A;&#xE37;&#xE48;&#xE2D;</strong> / Label</li>
<li><strong>&#xE44;&#xE2D;&#xE04;&#xE2D;&#xE19;&#xE2B;&#xE19;&#xE49;&#xE32;</strong>* / Leading Icon</li>
<li><strong>&#xE02;&#xE49;&#xE2D;&#xE04;&#xE27;&#xE32;&#xE21;&#xE0A;&#xE48;&#xE27;&#xE22;&#xE40;&#xE2B;&#xE25;&#xE37;&#xE2D;</strong> / Helper Text</li>
<li><strong>&#xE44;&#xE2D;&#xE04;&#xE2D;&#xE19;&#xE2B;&#xE25;&#xE31;&#xE07;</strong>* / Tailing Icon</li>
<li><strong>&#xE0A;&#xE48;&#xE2D;&#xE07;&#xE01;&#xE23;&#xE2D;&#xE01;</strong> / Text field</li>
</ol>
<p>*&#xE44;&#xE21;&#xE48;&#xE08;&#xE33;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE21;&#xE35;</p>
<h4 id>&#xE2A;&#xE16;&#xE32;&#xE19;&#xE30;&#xE15;&#xE48;&#xE32;&#xE07;&#xE46;</h4>
<p><img src="images/text-box/Text-Box-State.jpg" alt="Test"></p>
<h4 id>&#xE0A;&#xE48;&#xE2D;&#xE07;&#xE17;&#xE35;&#xE48;&#xE08;&#xE33;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE01;&#xE23;&#xE2D;&#xE01;</h4>
<p><img src="images/text-box/Text-Box-Indicator.jpg" alt="Test">
&#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE43;&#xE14;&#xE01;&#xE47;&#xE15;&#xE32;&#xE21;&#xE17;&#xE35;&#xE48;&#xE08;&#xE33;&#xE19;&#xE27;&#xE19;&#xE02;&#xE2D;&#xE07;&#xE0A;&#xE48;&#xE2D;&#xE07;&#xE01;&#xE23;&#xE2D;&#xE01;&#xE17;&#xE35;&#xE48;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE23;&#xE30;&#xE1A;&#xE38;&#xE1A;&#xE21;&#xE35;&#xE21;&#xE32;&#xE01;&#xE01;&#xE27;&#xE48;&#xE32;&#xE0A;&#xE48;&#xE2D;&#xE07;&#xE01;&#xE23;&#xE2D;&#xE01;&#xE17;&#xE35;&#xE48;&#xE40;&#xE27;&#xE49;&#xE19;&#xE27;&#xE48;&#xE32;&#xE07;&#xE44;&#xE14;&#xE49; &#xE43;&#xE2B;&#xE49;&#xE19;&#xE33; <strong>Required indicator</strong> &#xE2D;&#xE2D;&#xE01;&#xE17;&#xE31;&#xE49;&#xE07;&#xE2B;&#xE21;&#xE14;&#xE41;&#xE25;&#xE30;&#xE1A;&#xE2D;&#xE01;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE40;&#xE1E;&#xE35;&#xE22;&#xE07;&#xE41;&#xE04;&#xE48;&#xE27;&#xE48;&#xE32;&#xE0A;&#xE48;&#xE2D;&#xE07;&#xE43;&#xE2B;&#xE19;&#xE43;&#xE2B;&#xE49;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE02;&#xE49;&#xE32;&#xE21;&#xE44;&#xE14;&#xE49;</p>
<h2 id="selection-control">Selection Control</h2>
<h4 id="selection-control">&#xE0A;&#xE19;&#xE34;&#xE14;&#xE02;&#xE2D;&#xE07; Selection Control</h4>
<p><img src="images/selection-control/Selection-Control-Type.jpg" alt="Selection-Control"></p>
<h4 id="label-alignment">Label Alignment</h4>
<p><img src="images/selection-control/Label-Alignment.jpg" alt="Selection-Control"></p>
<p>&#xE01;&#xE32;&#xE23;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19; Selection Control &#xE41;&#xE15;&#xE48;&#xE25;&#xE30;&#xE0A;&#xE19;&#xE34;&#xE14;&#xE19;&#xE31;&#xE49;&#xE19; &#xE21;&#xE35;&#xE27;&#xE31;&#xE15;&#xE16;&#xE38;&#xE1B;&#xE23;&#xE30;&#xE2A;&#xE07;&#xE04;&#xE4C;&#xE43;&#xE19;&#xE01;&#xE32;&#xE23;&#xE43;&#xE0A;&#xE49;&#xE44;&#xE21;&#xE48;&#xE40;&#xE2B;&#xE21;&#xE37;&#xE2D;&#xE19;&#xE01;&#xE31;&#xE19;&#xE14;&#xE31;&#xE07;&#xE19;&#xE35;&#xE49;</p>
<h4 id>&#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE04;&#xE27;&#xE32;&#xE21;&#xE0A;&#xE31;&#xE14;&#xE40;&#xE08;&#xE19;&#xE41;&#xE25;&#xE30;&#xE04;&#xE27;&#xE32;&#xE21;&#xE23;&#xE27;&#xE14;&#xE40;&#xE23;&#xE47;&#xE27;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE2A;&#xE34;&#xE48;&#xE07;&#xE2A;&#xE33;&#xE04;&#xE31;&#xE0D;&#xE17;&#xE35;&#xE48;&#xE2A;&#xE38;&#xE14;</h4>
<p><img src="images/selection-control/Selection-Control-Case.jpg" alt="Selection-Control">
&#xE40;&#xE21;&#xE37;&#xE48;&#xE2D; Requirement &#xE15;&#xE49;&#xE2D;&#xE07;&#xE01;&#xE32;&#xE23;&#xE43;&#xE0A;&#xE49;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19; &#xE43;&#xE0A;&#xE49;&#xE23;&#xE30;&#xE1A;&#xE1A;&#xE44;&#xE14;&#xE49;&#xE2D;&#xE22;&#xE48;&#xE32;&#xE07;&#xE23;&#xE27;&#xE14;&#xE40;&#xE23;&#xE47;&#xE27; &#xE01;&#xE32;&#xE23;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19; Checkbox, Radio &#xE41;&#xE25;&#xE30; Switch &#xE08;&#xE30;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE2A;&#xE34;&#xE48;&#xE07;&#xE17;&#xE35;&#xE48;&#xE15;&#xE2D;&#xE1A;&#xE42;&#xE08;&#xE17;&#xE22;&#xE4C;&#xE19;&#xE35;&#xE49;&#xE17;&#xE35;&#xE48;&#xE2A;&#xE38;&#xE14; &#xE40;&#xE1E;&#xE23;&#xE32;&#xE30;&#xE01;&#xE32;&#xE23;&#xE43;&#xE0A;&#xE49; Dropdown &#xE08;&#xE30;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE01;&#xE32;&#xE23;&#xE40;&#xE1E;&#xE34;&#xE48;&#xE21;&#xE07;&#xE32;&#xE19;&#xE43;&#xE2B;&#xE49;&#xE01;&#xE31;&#xE1A;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE40;&#xE1E;&#xE23;&#xE32;&#xE30;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE04;&#xE25;&#xE34;&#xE4A;&#xE01;&#xE40;&#xE02;&#xE49;&#xE32;&#xE44;&#xE1B;&#xE14;&#xE39;&#xE27;&#xE48;&#xE32;&#xE21;&#xE35;&#xE23;&#xE32;&#xE22;&#xE01;&#xE32;&#xE23;&#xE2D;&#xE30;&#xE44;&#xE23;&#xE43;&#xE2B;&#xE49;&#xE40;&#xE25;&#xE37;&#xE2D;&#xE01;&#xE1A;&#xE49;&#xE32;&#xE07;</p>
<p><img src="images/selection-control/Switch-Case.jpg" alt="Selection-Control">
&#xE44;&#xE21;&#xE48;&#xE43;&#xE0A;&#xE49;&#xE1B;&#xE38;&#xE48;&#xE21;&#xE23;&#xE48;&#xE27;&#xE21;&#xE01;&#xE31;&#xE19;&#xE01;&#xE31;&#xE1A; Switch &#xE40;&#xE19;&#xE37;&#xE48;&#xE2D;&#xE07;&#xE08;&#xE32;&#xE01;&#xE01;&#xE32;&#xE23;&#xE17;&#xE33;&#xE07;&#xE32;&#xE19;&#xE02;&#xE2D;&#xE07; Switch &#xE19;&#xE31;&#xE49;&#xE19;&#xE21;&#xE35;&#xE1C;&#xE25;&#xE17;&#xE31;&#xE19;&#xE17;&#xE35;&#xE42;&#xE14;&#xE22;&#xE17;&#xE35;&#xE48;&#xE44;&#xE21;&#xE48;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE01;&#xE14;&#xE1B;&#xE38;&#xE48;&#xE21;&#xE22;&#xE37;&#xE19;&#xE22;&#xE31;&#xE19;</p>
<h4 id>&#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE2D;&#xE22;&#xE39;&#xE48;&#xE43;&#xE19;&#xE1E;&#xE37;&#xE49;&#xE19;&#xE17;&#xE35;&#xE48;&#xE17;&#xE35;&#xE48;&#xE21;&#xE35;&#xE08;&#xE33;&#xE01;&#xE31;&#xE14;</h4>
<p><img src="images/selection-control/Dropdown.jpg" alt="Selection-Control">
&#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE21;&#xE35;&#xE1E;&#xE37;&#xE49;&#xE19;&#xE17;&#xE35;&#xE48;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE2D;&#xE22;&#xE48;&#xE32;&#xE07;&#xE08;&#xE33;&#xE01;&#xE31;&#xE14; &#xE41;&#xE25;&#xE30;&#xE21;&#xE35;&#xE2A;&#xE34;&#xE48;&#xE07;&#xE17;&#xE35;&#xE48;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE01;&#xE32;&#xE23;&#xE43;&#xE2B;&#xE49;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE40;&#xE25;&#xE37;&#xE2D;&#xE01;&#xE08;&#xE33;&#xE19;&#xE27;&#xE19;&#xE21;&#xE32;&#xE01; &#xE01;&#xE32;&#xE23;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19; Dropdown &#xE08;&#xE30;&#xE17;&#xE33;&#xE43;&#xE2B;&#xE49;&#xE1B;&#xE23;&#xE30;&#xE2B;&#xE22;&#xE31;&#xE14;&#xE1E;&#xE37;&#xE49;&#xE19;&#xE17;&#xE35;&#xE48;&#xE44;&#xE14;&#xE49;&#xE21;&#xE32;&#xE01;</p>
<h4 id="searchable-dropdown">Searchable Dropdown</h4>
<p><img src="images/selection-control/Searchable-Dropdown.jpg" alt="Selection-Control">
&#xE01;&#xE23;&#xE13;&#xE35;&#xE17;&#xE35;&#xE48;&#xE43;&#xE19; Dropdown &#xE21;&#xE35;&#xE15;&#xE31;&#xE27;&#xE40;&#xE25;&#xE37;&#xE2D;&#xE01;&#xE08;&#xE33;&#xE19;&#xE27;&#xE19;&#xE21;&#xE32;&#xE01; &#xE08;&#xE30;&#xE17;&#xE33;&#xE43;&#xE2B;&#xE49;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE40;&#xE27;&#xE25;&#xE32;&#xE43;&#xE19;&#xE01;&#xE32;&#xE23;&#xE2B;&#xE32;&#xE2A;&#xE34;&#xE48;&#xE07;&#xE17;&#xE35;&#xE48;&#xE40;&#xE02;&#xE32;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE01;&#xE32;&#xE23;&#xE22;&#xE32;&#xE01;&#xE21;&#xE32;&#xE01;&#xE46; &#xE41;&#xE01;&#xE49;&#xE1B;&#xE31;&#xE0D;&#xE2B;&#xE32;&#xE42;&#xE14;&#xE22;&#xE01;&#xE32;&#xE23;&#xE43;&#xE0A;&#xE49; Searchable Dropdown</p>
<h2 id="button">Button</h2>
<h4 id><strong>&#xE2A;&#xE37;&#xE48;&#xE2D;&#xE2A;&#xE32;&#xE23;&#xE40;&#xE02;&#xE49;&#xE32;&#xE43;&#xE08;, &#xE2B;&#xE32;&#xE07;&#xE48;&#xE32;&#xE22;&#xE41;&#xE25;&#xE30;&#xE0A;&#xE31;&#xE14;&#xE40;&#xE08;&#xE19;</strong></h4>
<p>&#xE1B;&#xE38;&#xE48;&#xE21;&#xE40;&#xE15;&#xE23;&#xE35;&#xE22;&#xE21;&#xE44;&#xE27;&#xE49;&#xE43;&#xE2B;&#xE49;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE44;&#xE14;&#xE49;&#xE21;&#xE35;&#xE1B;&#xE0F;&#xE34;&#xE2A;&#xE31;&#xE21;&#xE1E;&#xE31;&#xE19;&#xE18;&#xE4C; &#xE01;&#xE14;&#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE43;&#xE2B;&#xE49;&#xE40;&#xE01;&#xE34;&#xE14;&#xE41;&#xE2D;&#xE4A;&#xE04;&#xE0A;&#xE31;&#xE48;&#xE19;&#xE15;&#xE32;&#xE21;&#xE17;&#xE35;&#xE48;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE44;&#xE14;&#xE49;&#xE04;&#xE32;&#xE14;&#xE2B;&#xE27;&#xE31;&#xE07;&#xE44;&#xE27;&#xE49; &#xE15;&#xE33;&#xE41;&#xE2B;&#xE19;&#xE48;&#xE07;&#xE02;&#xE2D;&#xE07;&#xE1B;&#xE38;&#xE48;&#xE21;&#xE04;&#xE27;&#xE23;&#xE08;&#xE30;&#xE2D;&#xE22;&#xE39;&#xE48;&#xE43;&#xE19;&#xE15;&#xE33;&#xE41;&#xE2B;&#xE19;&#xE48;&#xE07;&#xE17;&#xE35;&#xE48;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE2A;&#xE48;&#xE27;&#xE19;&#xE43;&#xE2B;&#xE0D;&#xE48;&#xE21;&#xE2D;&#xE07;&#xE2B;&#xE32; (&#xE21;&#xE38;&#xE21;&#xE15;&#xE48;&#xE32;&#xE07;&#xE46;&#xE42;&#xE14;&#xE22;&#xE40;&#xE09;&#xE1E;&#xE32;&#xE30;&#xE21;&#xE38;&#xE21;&#xE02;&#xE27;&#xE32;, &#xE14;&#xE49;&#xE32;&#xE19;&#xE2A;&#xE48;&#xE32;&#xE07;&#xE2A;&#xE38;&#xE14;) &#xE41;&#xE25;&#xE30;&#xE0A;&#xE37;&#xE48;&#xE2D;&#xE02;&#xE2D;&#xE07;&#xE1B;&#xE38;&#xE48;&#xE21;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE1A;&#xE2D;&#xE01;&#xE43;&#xE1A;&#xE49;&#xE2B;&#xE23;&#xE37;&#xE2D;&#xE1A;&#xE2D;&#xE01;&#xE44;&#xE14;&#xE49;&#xE27;&#xE48;&#xE32;&#xE2D;&#xE30;&#xE44;&#xE23;&#xE08;&#xE30;&#xE40;&#xE01;&#xE34;&#xE14;&#xE02;&#xE36;&#xE49;&#xE19;&#xE01;&#xE31;&#xE1A;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE2B;&#xE25;&#xE31;&#xE07;&#xE08;&#xE32;&#xE01;&#xE44;&#xE14;&#xE49;&#xE01;&#xE14;&#xE1B;&#xE38;&#xE48;&#xE21;&#xE19;&#xE31;&#xE49;&#xE19;&#xE46;&#xE44;&#xE1B;&#xE41;&#xE25;&#xE49;&#xE27;</p>
<h4 id>&#xE1B;&#xE23;&#xE30;&#xE40;&#xE20;&#xE17;&#xE41;&#xE25;&#xE30;&#xE23;&#xE39;&#xE1B;&#xE41;&#xE1A;&#xE1A;</h4>
<p>&#xE1B;&#xE38;&#xE48;&#xE21;&#xE17;&#xE35;&#xE48;&#xE14;&#xE35;&#xE04;&#xE27;&#xE23;&#xE08;&#xE30;&#xE0A;&#xE48;&#xE27;&#xE22;&#xE1A;&#xE2D;&#xE01; &#xE0A;&#xE48;&#xE27;&#xE22;&#xE2A;&#xE37;&#xE48;&#xE2D;&#xE2A;&#xE32;&#xE23;&#xE23;&#xE30;&#xE2B;&#xE27;&#xE48;&#xE32;&#xE07;&#xE23;&#xE30;&#xE1A;&#xE1A;&#xE01;&#xE31;&#xE1A;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE27;&#xE48;&#xE32;&#xE23;&#xE30;&#xE1A;&#xE1A;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE01;&#xE32;&#xE23;&#xE43;&#xE2B;&#xE49;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE19;&#xE31;&#xE49;&#xE19;&#xE17;&#xE33;&#xE2D;&#xE30;&#xE44;&#xE23;&#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE01;&#xE14;&#xE41;&#xE25;&#xE49;&#xE27;&#xE08;&#xE30;&#xE40;&#xE01;&#xE34;&#xE14;&#xE2D;&#xE30;&#xE44;&#xE23;&#xE02;&#xE36;&#xE49;&#xE19; &#xE41;&#xE1A;&#xE48;&#xE07;&#xE2D;&#xE2D;&#xE01;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE1B;&#xE23;&#xE30;&#xE40;&#xE20;&#xE17;&#xE15;&#xE48;&#xE32;&#xE07;&#xE46;&#xE14;&#xE31;&#xE07;&#xE19;&#xE35;&#xE49;</p>
<p><strong>1. &#xE1B;&#xE38;&#xE48;&#xE21;&#xE2B;&#xE25;&#xE31;&#xE01; (Primary)</strong>
<strong>2. &#xE1B;&#xE38;&#xE48;&#xE21;&#xE23;&#xE2D;&#xE07; (Secondary)</strong>
<strong>3. &#xE1B;&#xE38;&#xE48;&#xE21;&#xE40;&#xE2A;&#xE23;&#xE34;&#xE21; (Tertiary)</strong>
<strong>4. &#xE1B;&#xE38;&#xE48;&#xE21;&#xE40;&#xE1A;&#xE32; (Ghost)</strong></p>
<p><img src="images/button/Button-level.jpg" alt="Sturcture"></p>
<h4 id="1.-(primary-button)">1. &#xE1B;&#xE38;&#xE48;&#xE21;&#xE2B;&#xE25;&#xE31;&#xE01; (Primary Button)</h4>
<p>&#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE2D;&#xE22;&#xE39;&#xE48;&#xE17;&#xE35;&#xE48;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE08;&#xE2D;&#xE43;&#xE14;&#xE46; &#xE2B;&#xE32;&#xE01;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE01;&#xE32;&#xE23;&#xE1A;&#xE2D;&#xE01;&#xE43;&#xE2B;&#xE49;&#xE23;&#xE39;&#xE49;&#xE16;&#xE36;&#xE07;&#xE41;&#xE2D;&#xE47;&#xE01;&#xE0A;&#xE31;&#xE48;&#xE19;&#xE2B;&#xE25;&#xE31;&#xE01; (&#xE41;&#xE2D;&#xE47;&#xE01;&#xE0A;&#xE31;&#xE48;&#xE19;&#xE17;&#xE35;&#xE48;&#xE21;&#xE35;&#xE1C;&#xE25;&#xE01;&#xE31;&#xE1A;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE40;&#xE0A;&#xE48;&#xE19;&#xE01;&#xE32;&#xE23;&#xE2A;&#xE48;&#xE07;&#xE1F;&#xE2D;&#xE23;&#xE4C;&#xE21;&#xE40;&#xE2D;&#xE01;&#xE2A;&#xE32;&#xE23;, &#xE08;&#xE48;&#xE32;&#xE22;&#xE40;&#xE07;&#xE34;&#xE19; &#xE2B;&#xE23;&#xE37;&#xE2D;&#xE1A;&#xE31;&#xE19;&#xE17;&#xE36;&#xE01;&#xE02;&#xE49;&#xE2D;&#xE21;&#xE39;&#xE25;&#xE25;&#xE07;&#xE10;&#xE32;&#xE19;&#xE02;&#xE49;&#xE2D;&#xE21;&#xE39;&#xE25;) &#xE17;&#xE35;&#xE48;&#xE2A;&#xE32;&#xE21;&#xE32;&#xE23;&#xE16;&#xE17;&#xE33;&#xE44;&#xE14;&#xE49;&#xE43;&#xE2B;&#xE49;&#xE1E;&#xE34;&#xE08;&#xE32;&#xE23;&#xE13;&#xE32;&#xE43;&#xE0A;&#xE49;&#xE1B;&#xE38;&#xE48;&#xE21;&#xE2B;&#xE25;&#xE31;&#xE01;</p>
<p><img src="images/button/Button-Type-Primary.jpg" alt="Sturcture"></p>
<h4 id="(secondary)">&#xE1B;&#xE38;&#xE48;&#xE21;&#xE23;&#xE2D;&#xE07; (Secondary)</h4>
<p>&#xE43;&#xE19;&#xE41;&#xE2D;&#xE4A;&#xE1B;&#xE1E;&#xE25;&#xE34;&#xE40;&#xE04;&#xE0A;&#xE31;&#xE48;&#xE19;&#xE43;&#xE14;&#xE46; &#xE1B;&#xE38;&#xE48;&#xE21;&#xE2B;&#xE25;&#xE31;&#xE01;/&#xE1B;&#xE38;&#xE48;&#xE21;&#xE23;&#xE2D;&#xE07; &#xE2D;&#xE32;&#xE08;&#xE21;&#xE35;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE15;&#xE32;&#xE41;&#xE25;&#xE30;&#xE01;&#xE32;&#xE23;&#xE17;&#xE33;&#xE07;&#xE32;&#xE19;&#xE40;&#xE2B;&#xE21;&#xE37;&#xE2D;&#xE19;&#xE01;&#xE31;&#xE19;&#xE01;&#xE47;&#xE44;&#xE14;&#xE49; &#xE41;&#xE15;&#xE48;&#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE44;&#xE14;&#xE49;&#xE01;&#xE47;&#xE15;&#xE32;&#xE21;&#xE17;&#xE35;&#xE48;&#xE08;&#xE33;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE17;&#xE31;&#xE49;&#xE07; 2 &#xE1B;&#xE38;&#xE48;&#xE21;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE15;&#xE32;&#xE17;&#xE31;&#xE49;&#xE07;&#xE1B;&#xE38;&#xE48;&#xE21;&#xE2B;&#xE25;&#xE31;&#xE01;&#xE41;&#xE25;&#xE30;&#xE1B;&#xE38;&#xE48;&#xE21;&#xE23;&#xE2D;&#xE07; &#xE15;&#xE49;&#xE2D;&#xE07;&#xE2D;&#xE2D;&#xE01;&#xE41;&#xE1A;&#xE1A;&#xE43;&#xE2B;&#xE49;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE2A;&#xE32;&#xE21;&#xE32;&#xE23;&#xE16;&#xE41;&#xE22;&#xE01;&#xE44;&#xE14;&#xE49;&#xE2D;&#xE22;&#xE48;&#xE32;&#xE07;&#xE0A;&#xE31;&#xE14;&#xE40;&#xE08;&#xE19;</p>
<p><img src="images/button/Button-Type-Secondary.jpg" alt="Sturcture"></p>
<h4 id="(tertiary)">&#xE1B;&#xE38;&#xE48;&#xE21;&#xE40;&#xE2A;&#xE23;&#xE34;&#xE21; (Tertiary)</h4>
<p>&#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE01;&#xE32;&#xE23;&#xE40;&#xE1E;&#xE34;&#xE48;&#xE21;&#xE17;&#xE32;&#xE07;&#xE40;&#xE25;&#xE37;&#xE2D;&#xE01;&#xE43;&#xE2B;&#xE49;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE44;&#xE14;&#xE49;&#xE40;&#xE25;&#xE37;&#xE2D;&#xE01;&#xE44;&#xE1B;&#xE43;&#xE19;&#xE17;&#xE34;&#xE28;&#xE17;&#xE32;&#xE07;&#xE17;&#xE35;&#xE48;&#xE15;&#xE23;&#xE07;&#xE02;&#xE49;&#xE32;&#xE21;&#xE01;&#xE31;&#xE1A;&#xE1B;&#xE38;&#xE48;&#xE21;&#xE2B;&#xE25;&#xE31;&#xE01;&#xE41;&#xE25;&#xE30;&#xE1B;&#xE38;&#xE48;&#xE21;&#xE23;&#xE2D;&#xE07;</p>
<p><img src="images/button/Button-Type-Tertiary.jpg" alt="Sturcture"></p>
<h4 id="(ghost)">&#xE1B;&#xE38;&#xE48;&#xE21;&#xE40;&#xE1A;&#xE32; (Ghost)</h4>
<p>&#xE40;&#xE1B;&#xE47;&#xE19;&#xE1B;&#xE38;&#xE48;&#xE21;&#xE17;&#xE35;&#xE48;&#xE44;&#xE21;&#xE48;&#xE21;&#xE35;&#xE04;&#xE27;&#xE32;&#xE21;&#xE40;&#xE01;&#xE35;&#xE48;&#xE22;&#xE27;&#xE02;&#xE49;&#xE2D;&#xE07;&#xE43;&#xE14;&#xE46;&#xE40;&#xE25;&#xE22;&#xE01;&#xE31;&#xE1A; &#xE1B;&#xE38;&#xE48;&#xE21;&#xE2B;&#xE25;&#xE31;&#xE01;/&#xE1B;&#xE38;&#xE48;&#xE21;&#xE23;&#xE2D;&#xE07;/&#xE1B;&#xE38;&#xE48;&#xE21;&#xE40;&#xE2A;&#xE23;&#xE34;&#xE21;</p>
<p><img src="images/button/Button-Type-Ghost.jpg" alt="Sturcture"></p>
<h2 id="modal">Modal</h2>
<p>&#xE43;&#xE0A;&#xE49;&#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE15;&#xE31;&#xE27;&#xE04;&#xE31;&#xE48;&#xE19;&#xE08;&#xE31;&#xE07;&#xE2B;&#xE27;&#xE30; &#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE43;&#xE2B;&#xE49;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE44;&#xE14;&#xE49;&#xE17;&#xE33;&#xE01;&#xE32;&#xE23;&#xE17;&#xE1A;&#xE17;&#xE27;&#xE19;&#xE2D;&#xE35;&#xE01;&#xE23;&#xE2D;&#xE1A;&#xE01;&#xE48;&#xE2D;&#xE19;&#xE08;&#xE30;&#xE22;&#xE37;&#xE19;&#xE22;&#xE31;&#xE19; &#xE2B;&#xE23;&#xE37;&#xE2D;&#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE43;&#xE2B;&#xE49;&#xE02;&#xE49;&#xE2D;&#xE21;&#xE39;&#xE25;&#xE01;&#xE31;&#xE1A;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;</p>
<p>1.Overlay Modal</p>
<p><img src="images/modal/Overlay-Modal.jpg" alt="01"></p>
<p>2.Full Screen Modal</p>
<p><img src="images/modal/FullScreen-Modal.jpg" alt="01"></p>
<h5 id="basic-anatomy">Basic Anatomy</h5>
<p><img src="images/modal/Modal-Anatomy.jpg" alt="Modal"></p>
<ol>
<li>Container</li>
<li>Title</li>
<li>Supporting Text</li>
<li>Buttons</li>
</ol>
<h5 id="priority-of-modal">Priority of Modal</h5>
<p>&#xE01;&#xE32;&#xE23;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19; Modal &#xE41;&#xE1A;&#xE48;&#xE07;&#xE01;&#xE32;&#xE23;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE15;&#xE32;&#xE21;&#xE04;&#xE27;&#xE32;&#xE21; Priority &#xE04;&#xE37;&#xE2D;</p>
<table>
<thead>
<tr>
<th>Priority</th>
<th>Component</th>
<th>User Action</th>
</tr>
</thead>
<tbody>
<tr>
<td>High</td>
<td>Confirmation Modal</td>
<td>&#xE01;&#xE14;&#xE1B;&#xE38;&#xE48;&#xE21;&#xE15;&#xE31;&#xE14;&#xE2A;&#xE34;&#xE19;&#xE43;&#xE08;&#xE17;&#xE35;&#xE48;&#xE08;&#xE30;&#xE40;&#xE25;&#xE37;&#xE2D;&#xE01;&#xE17;&#xE33; &#xE2B;&#xE23;&#xE37;&#xE2D; &#xE01;&#xE23;&#xE30;&#xE17;&#xE33;&#xE1A;&#xE32;&#xE07;&#xE2D;&#xE22;&#xE48;&#xE32;&#xE07;&#xE01;&#xE31;&#xE1A;&#xE23;&#xE30;&#xE1A;&#xE1A;&#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE43;&#xE2B;&#xE49;&#xE07;&#xE32;&#xE19;&#xE40;&#xE2A;&#xE23;&#xE47;&#xE08;&#xE2A;&#xE21;&#xE1A;&#xE39;&#xE23;&#xE13;&#xE4C;</td>
</tr>
<tr>
<td>Low</td>
<td>Information Modal</td>
<td>&#xE01;&#xE14;&#xE1B;&#xE38;&#xE48;&#xE21;&#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE23;&#xE31;&#xE1A;&#xE17;&#xE23;&#xE32;&#xE1A; &#xE2B;&#xE23;&#xE37;&#xE2D; &#xE2B;&#xE32;&#xE22;&#xE44;&#xE1B;&#xE2D;&#xE31;&#xE15;&#xE42;&#xE19;&#xE21;&#xE31;&#xE15;&#xE34;&#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE2B;&#xE21;&#xE14;&#xE40;&#xE27;&#xE25;&#xE32;</td>
</tr>
</tbody>
</table>
<p><img src="images/modal/Modal-Case.jpg" alt="Modal"></p>
<h2 id="list-of-items">List of items</h2>
<p>&#xE01;&#xE32;&#xE23;&#xE41;&#xE2A;&#xE14;&#xE07;&#xE23;&#xE32;&#xE22;&#xE01;&#xE32;&#xE23;&#xE15;&#xE48;&#xE32;&#xE07;&#xE46;&#xE40;&#xE0A;&#xE48;&#xE19; &#xE23;&#xE32;&#xE22;&#xE01;&#xE32;&#xE23;&#xE40;&#xE2D;&#xE01;&#xE2A;&#xE32;&#xE23;, &#xE23;&#xE32;&#xE22;&#xE01;&#xE32;&#xE23;&#xE02;&#xE2D;&#xE07;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19; &#xE19;&#xE2D;&#xE01;&#xE08;&#xE32;&#xE01;&#xE01;&#xE32;&#xE23;&#xE41;&#xE2A;&#xE14;&#xE07;&#xE1C;&#xE25;&#xE41;&#xE1A;&#xE1A;&#xE15;&#xE32;&#xE23;&#xE32;&#xE07;&#xE41;&#xE25;&#xE49;&#xE27; &#xE22;&#xE31;&#xE07;&#xE2A;&#xE32;&#xE21;&#xE32;&#xE23;&#xE16;&#xE41;&#xE2A;&#xE14;&#xE07;&#xE23;&#xE32;&#xE22;&#xE01;&#xE32;&#xE23;&#xE14;&#xE49;&#xE27;&#xE22;&#xE01;&#xE32;&#xE23;&#xE4C;&#xE14;&#xE44;&#xE14;&#xE49; &#xE42;&#xE14;&#xE22;&#xE1B;&#xE23;&#xE31;&#xE1A;&#xE2B;&#xE31;&#xE27;&#xE15;&#xE32;&#xE23;&#xE32;&#xE07;&#xE43;&#xE2B;&#xE49;&#xE44;&#xE1B;&#xE2D;&#xE22;&#xE39;&#xE48;&#xE04;&#xE39;&#xE48;&#xE01;&#xE31;&#xE1A;&#xE0A;&#xE38;&#xE14;&#xE02;&#xE49;&#xE2D;&#xE21;&#xE39;&#xE25; &#xE41;&#xE25;&#xE30;&#xE01;&#xE25;&#xE38;&#xE48;&#xE21;&#xE02;&#xE2D;&#xE07;&#xE02;&#xE49;&#xE2D;&#xE21;&#xE39;&#xE25;&#xE17;&#xE35;&#xE48;&#xE21;&#xE35;&#xE04;&#xE27;&#xE32;&#xE21;&#xE2A;&#xE31;&#xE21;&#xE1E;&#xE31;&#xE19;&#xE18;&#xE4C;&#xE01;&#xE31;&#xE19;&#xE01;&#xE47;&#xE2A;&#xE32;&#xE21;&#xE32;&#xE23;&#xE16;&#xE2D;&#xE22;&#xE39;&#xE48;&#xE14;&#xE49;&#xE27;&#xE22;&#xE01;&#xE31;&#xE19;&#xE42;&#xE14;&#xE22;&#xE2D;&#xE32;&#xE28;&#xE31;&#xE22;&#xE2B;&#xE31;&#xE27;&#xE15;&#xE32;&#xE23;&#xE32;&#xE07; (label) &#xE40;&#xE14;&#xE35;&#xE22;&#xE27;&#xE01;&#xE31;&#xE19;</p>
<p><img src="images/element-list/list01.png" alt="Test">
<img src="images/element-list/list02.png" alt="Test">
<img src="images/element-list/list03.png" alt="Test"></p>
<h2 id="card">Card</h2>
<p><img src="images/Card/Card-Document.png" alt="Test"></p>
<h2 id="loader">Loader</h2>
<p>&#xE2B;&#xE25;&#xE31;&#xE07;&#xE08;&#xE32;&#xE01;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE21;&#xE35;&#xE1B;&#xE0E;&#xE34;&#xE2A;&#xE31;&#xE21;&#xE1E;&#xE31;&#xE19;&#xE18;&#xE4C;&#xE01;&#xE31;&#xE1A;&#xE23;&#xE30;&#xE1A;&#xE1A; &#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE40;&#xE23;&#xE34;&#xE48;&#xE21;&#xE23;&#xE39;&#xE49;&#xE2A;&#xE36;&#xE01;&#xE27;&#xE48;&#xE32;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE23;&#xE2D;&#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE40;&#xE27;&#xE25;&#xE32;&#xE1C;&#xE48;&#xE32;&#xE19;&#xE44;&#xE1B;&#xE21;&#xE32;&#xE01;&#xE01;&#xE27;&#xE48;&#xE32; 1 &#xE27;&#xE34;&#xE19;&#xE32;&#xE17;&#xE35;&#xE41;&#xE25;&#xE49;&#xE27;&#xE22;&#xE31;&#xE07;&#xE44;&#xE21;&#xE48;&#xE44;&#xE14;&#xE49;&#xE23;&#xE31;&#xE1A;&#xE02;&#xE49;&#xE2D;&#xE21;&#xE39;&#xE25;&#xE17;&#xE35;&#xE48;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE01;&#xE32;&#xE23; &#xE01;&#xE32;&#xE23;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19; Loader &#xE04;&#xE37;&#xE2D;&#xE01;&#xE32;&#xE23;&#xE1A;&#xE2D;&#xE01;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE27;&#xE48;&#xE32;&#xE40;&#xE02;&#xE32;&#xE08;&#xE30;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE23;&#xE2D;&#xE01;&#xE32;&#xE23;&#xE17;&#xE33;&#xE07;&#xE32;&#xE19;&#xE02;&#xE2D;&#xE07;&#xE23;&#xE30;&#xE1A;&#xE1A;&#xE01;&#xE48;&#xE2D;&#xE19;&#xE08;&#xE36;&#xE07;&#xE08;&#xE30;&#xE2A;&#xE32;&#xE21;&#xE32;&#xE23;&#xE16;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE15;&#xE48;&#xE2D;&#xE44;&#xE1B;&#xE44;&#xE14;&#xE49;</p>
<h4 id>&#xE01;&#xE32;&#xE23;&#xE40;&#xE25;&#xE37;&#xE2D;&#xE01;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;</h4>
<table>
<thead>
<tr>
<th>Component</th>
<th>Waiting Time</th>
</tr>
</thead>
<tbody>
<tr>
<td>None</td>
<td>&lt; 1 seconds</td>
</tr>
<tr>
<td>Spinner</td>
<td>1-4 seconds</td>
</tr>
<tr>
<td>Skeleton Screen</td>
<td>1-4 seconds</td>
</tr>
<tr>
<td>Progress Bar</td>
<td>&gt; 4 seconds</td>
</tr>
</tbody>
</table>
<p><img src="images/loading/Loading-Element.jpg" alt="Modal"></p>
<h2 id="breadcrumb">Breadcrumb</h2>
<p>&#xE04;&#xE37;&#xE2D; Navigation &#xE23;&#xE2D;&#xE07;&#xE08;&#xE32;&#xE01; Navigation Bar &#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE1A;&#xE2D;&#xE01;&#xE17;&#xE35;&#xE48;&#xE2D;&#xE22;&#xE39;&#xE48;&#xE1B;&#xE31;&#xE08;&#xE08;&#xE38;&#xE1A;&#xE31;&#xE19;&#xE02;&#xE2D;&#xE07;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE43;&#xE19;&#xE23;&#xE39;&#xE1B;&#xE41;&#xE1A;&#xE1A;&#xE25;&#xE33;&#xE14;&#xE31;&#xE1A;&#xE0A;&#xE31;&#xE49;&#xE19; &#xE2B;&#xE23;&#xE37;&#xE2D; &#xE43;&#xE0A;&#xE49;&#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE01;&#xE25;&#xE31;&#xE1A;&#xE44;&#xE1B;&#xE22;&#xE31;&#xE07;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE08;&#xE2D;&#xE17;&#xE35;&#xE48;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE08;&#xE32;&#xE01;&#xE21;&#xE32;</p>
<h4 id="appearance">Appearance</h4>
<p><strong>1. Location based breadcrumb</strong></p>
<p><img src="images/breadcrumb/Location-Based.jpg" alt="Navigation"></p>
<p><img src="images/breadcrumb/Breadcrumb-Case-1.jpg" alt="Navigation">
<img src="images/breadcrumb/Breadcrumb-Case-2.jpg" alt="Navigation">
&#xE44;&#xE21;&#xE48;&#xE43;&#xE2A;&#xE48; Link &#xE17;&#xE35;&#xE48;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE15;&#xE48;&#xE32;&#xE07;&#xE1B;&#xE31;&#xE08;&#xE08;&#xE38;&#xE1A;&#xE31;&#xE19;&#xE17;&#xE35;&#xE48;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE01;&#xE33;&#xE25;&#xE31;&#xE07;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE2D;&#xE22;&#xE39;&#xE48; &#xE41;&#xE25;&#xE30;&#xE44;&#xE21;&#xE48;&#xE04;&#xE27;&#xE23;&#xE43;&#xE0A;&#xE49;&#xE16;&#xE49;&#xE32;&#xE2B;&#xE32;&#xE01;&#xE21;&#xE35;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE08;&#xE2D;&#xE22;&#xE48;&#xE2D;&#xE22;&#xE40;&#xE1E;&#xE35;&#xE22;&#xE07;&#xE41;&#xE04;&#xE48;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE08;&#xE2D;&#xE40;&#xE14;&#xE35;&#xE22;&#xE27;</p>
<p><strong>2. History based breadcrumb</strong></p>
<p><img src="images/breadcrumb/Breadcrumb-Case-4.jpg" alt="Navigation">
&#xE44;&#xE27;&#xE49;&#xE2A;&#xE33;&#xE2B;&#xE23;&#xE31;&#xE1A;&#xE01;&#xE25;&#xE31;&#xE1A;&#xE44;&#xE1B;&#xE22;&#xE31;&#xE07;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE08;&#xE2D;&#xE01;&#xE48;&#xE2D;&#xE19;&#xE17;&#xE35;&#xE48;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE43;&#xE0A;&#xE49;&#xE2D;&#xE22;&#xE39;&#xE48;&#xE43;&#xE19;&#xE1B;&#xE31;&#xE08;&#xE08;&#xE38;&#xE1A;&#xE31;&#xE19; &#xE21;&#xE35;&#xE25;&#xE39;&#xE01;&#xE28;&#xE23;&#xE01;&#xE25;&#xE31;&#xE1A;&#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE1A;&#xE2D;&#xE01;&#xE43;&#xE1A;&#xE49;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;</p>
<p><img src="images/breadcrumb/Breadcrumb-Case-3.jpg" alt="Navigation">
&#xE01;&#xE23;&#xE13;&#xE35;&#xE17;&#xE35;&#xE48;&#xE21;&#xE35;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE08;&#xE2D;&#xE22;&#xE48;&#xE2D;&#xE22;&#xE40;&#xE1E;&#xE35;&#xE22;&#xE07;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE08;&#xE2D;&#xE40;&#xE14;&#xE35;&#xE22;&#xE27; &#xE2A;&#xE34;&#xE48;&#xE07;&#xE17;&#xE35;&#xE48;&#xE08;&#xE30;&#xE1A;&#xE2D;&#xE01;&#xE15;&#xE33;&#xE41;&#xE2B;&#xE19;&#xE48;&#xE07;&#xE02;&#xE2D;&#xE07;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE08;&#xE30;&#xE01;&#xE25;&#xE32;&#xE22;&#xE40;&#xE1B;&#xE47;&#xE19; Title &#xE02;&#xE2D;&#xE07;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE19;&#xE31;&#xE49;&#xE19;&#xE46;&#xE41;&#xE17;&#xE19;</p>
<h4 id="basic-anatomy">Basic Anatomy</h4>
<p><img src="images/breadcrumb/Breadcrumb-Anatomy.jpg" alt="Navigation"></p>
<ol>
<li><strong>&#xE0A;&#xE37;&#xE48;&#xE2D;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE08;&#xE2D;</strong> / Screen Label</li>
<li><strong>&#xE15;&#xE31;&#xE27;&#xE41;&#xE1A;&#xE48;&#xE07;</strong> / Separator</li>
<li><strong>&#xE0A;&#xE37;&#xE48;&#xE2D;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE08;&#xE2D;&#xE1B;&#xE31;&#xE08;&#xE08;&#xE38;&#xE1A;&#xE31;&#xE19;</strong> / Current Screen Label</li>
</ol>
<h4 id="alignment">Alignment</h4>
<p><img src="images/breadcrumb/Breadcrumb-Alignment.jpg" alt="Navigation"></p>

        </div>
        <div class="footer-nav">
          <div class="left"><a href="guideline-layout.html"><span class="title">Layout</span></a></div>
          <div class="right"><a href="visual-color.html"><span class="label">Next: </span><span class="title">Colors</span></a></div>
        </div>
      </div>
    </div>
  </body>
</html>