<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf-8">
    <link rel="stylesheet" href="assets/style.css?t=90051322">
    <link rel="stylesheet" href="https://ricostacruz.com/docpress-rsc/style.css">
    <link rel="stylesheet" href="extra.css?t=5c8ec47c">
    <script src="assets/script.js?t=93f1a66c"></script>
    <title>Element - Sankom Design</title>
    <meta name="viewport" content="width=device-width">
  </head>
  <body class="-menu-visible">
    <div class="doc-layout">
      <div class="toggle menu-toggle js-menu-toggle"></div>
      <div class="menu toc-menu">
        <ul>
          <li class="menu-item -level-0 -parent">
            <ul class="submenu">
              <li class="menu-item -level-1"><a class="link title  link-index" href="index.html">Sankom Design</a>
              </li>
              <li class="menu-item -level-1"><a class="link title  link-getting-start" href="getting-start.html">Getting Start</a>
              </li>
              <li class="menu-item -level-1"><a class="link title  link-design-principle" href="design-principle.html">Design Principle</a>
              </li>
              <li class="menu-item -level-1 -parent"><span class="title">Guideline</span>
                <ul class="submenu">
                  <li class="menu-item -level-2"><a class="link title  link-guideline-navigation" href="guideline-navigation.html">Navigation</a>
                  </li>
                  <li class="menu-item -level-2"><span class="title">Panel</span>
                  </li>
                  <li class="menu-item -level-2"><a class="link title -active link-guideline-element" href="guideline-element.html">Element</a>
                    <ul class="headings heading-list">
                      <li class="heading-item -depth-2"><a class="hlink link-input-box" href="#input-box">Input Box</a>
                      </li>
                      <li class="heading-item -depth-2"><a class="hlink link-button" href="#button">Button</a>
                      </li>
                      <li class="heading-item -depth-2"><a class="hlink link-selection-control" href="#selection-control">Selection Control</a>
                      </li>
                      <li class="heading-item -depth-2"><a class="hlink link-modals" href="#modals">Modals</a>
                      </li>
                      <li class="heading-item -depth-2"><a class="hlink link-list-of-items" href="#list-of-items">List of items</a>
                      </li>
                    </ul>
                  </li>
                  <li class="menu-item -level-2"><span class="title">Plugin</span>
                  </li>
                  <li class="menu-item -level-2"><span class="title">New Account</span>
                  </li>
                </ul>
              </li>
              <li class="menu-item -level-1 -parent"><span class="title">Visual</span>
                <ul class="submenu">
                  <li class="menu-item -level-2"><a class="link title  link-visual-color" href="visual-color.html">Colors</a>
                  </li>
                  <li class="menu-item -level-2"><a class="link title  link-visual-layout" href="visual-layout.html">Layout</a>
                  </li>
                  <li class="menu-item -level-2"><a class="link title  link-visual-font" href="visual-font.html">Fonts</a>
                  </li>
                  <li class="menu-item -level-2"><span class="title">Icon</span>
                  </li>
                </ul>
              </li>
              <li class="menu-item -level-1"><a class="link title  link-contribute" href="contribute.html">Contribute</a>
              </li>
            </ul>
          </li>
        </ul>
      </div>
      <div class="body page-guideline-element">
        <div class="header-nav">
          <div class="right"><a class="iconlink" href="https://github.com/sankomdesign/guideline" data-title="sankomdesign/guideline">
              <!-- span.title Open in GitHub--><span class="icon -github"></span></a>
          </div>
        </div>
        <div class="markdown-body"><h1 id="element">Element</h1>
<p>Element. &#xE04;&#xE37;&#xE2D;&#xE2A;&#xE48;&#xE27;&#xE19;&#xE17;&#xE35;&#xE48;&#xE1B;&#xE23;&#xE30;&#xE01;&#xE2D;&#xE1A;&#xE02;&#xE36;&#xE49;&#xE19;&#xE40;&#xE1B;&#xE47;&#xE19; User interface &#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE21;&#xE35;&#xE04;&#xE27;&#xE32;&#xE21;&#xE04;&#xE38;&#xE49;&#xE19;&#xE40;&#xE04;&#xE22;&#xE01;&#xE31;&#xE1A; User interface &#xE08;&#xE32;&#xE01;&#xE1B;&#xE23;&#xE30;&#xE2A;&#xE1A;&#xE01;&#xE32;&#xE23;&#xE13;&#xE4C;&#xE17;&#xE35;&#xE48;&#xE1C;&#xE48;&#xE32;&#xE19;&#xE21;&#xE32;&#xE02;&#xE2D;&#xE07;&#xE1E;&#xE27;&#xE01;&#xE40;&#xE02;&#xE32; &#xE42;&#xE1B;&#xE23;&#xE14;&#xE40;&#xE25;&#xE37;&#xE2D;&#xE01;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE14;&#xE49;&#xE27;&#xE22;&#xE04;&#xE27;&#xE32;&#xE21;&#xE23;&#xE30;&#xE21;&#xE31;&#xE14;&#xE23;&#xE30;&#xE27;&#xE31;&#xE07; &#xE42;&#xE14;&#xE22;&#xE04;&#xE33;&#xE19;&#xE36;&#xE07;&#xE16;&#xE36;&#xE07;&#xE04;&#xE27;&#xE32;&#xE21;&#xE2A;&#xE21;&#xE48;&#xE33;&#xE40;&#xE2A;&#xE21;&#xE2D;&#xE41;&#xE25;&#xE30;&#xE2A;&#xE32;&#xE21;&#xE32;&#xE23;&#xE16;&#xE04;&#xE32;&#xE14;&#xE40;&#xE14;&#xE32;&#xE44;&#xE14;&#xE49; &#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE0A;&#xE48;&#xE27;&#xE22;&#xE43;&#xE2B;&#xE49;&#xE40;&#xE1B;&#xE49;&#xE32;&#xE2B;&#xE21;&#xE32;&#xE22;&#xE02;&#xE2D;&#xE07;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE19;&#xE31;&#xE49;&#xE19;&#xE40;&#xE2A;&#xE23;&#xE47;&#xE08;&#xE41;&#xE1A;&#xE1A;&#xE21;&#xE35;&#xE1B;&#xE23;&#xE30;&#xE2A;&#xE34;&#xE17;&#xE18;&#xE34;&#xE20;&#xE32;&#xE1E;&#xE41;&#xE25;&#xE30;&#xE44;&#xE14;&#xE49;&#xE23;&#xE31;&#xE1A;&#xE04;&#xE27;&#xE32;&#xE21;&#xE1E;&#xE36;&#xE07;&#xE1E;&#xE2D;&#xE43;&#xE08;</p>
<h5 id="1.-input-controls">1. Input controls</h5>
<ul>
<li>Button, Data field, List-Box</li>
</ul>
<h5 id="2.-selection-controls">2. Selection controls</h5>
<ul>
<li>Toggles, Radio-button, Checkbox, Dropdown list</li>
</ul>
<h5 id="3.-navigational-components">3. Navigational components</h5>
<ul>
<li>Breadcrumb, Slider, Search, Pagination, Tag, Navigation Bar</li>
</ul>
<h5 id="4.-informational-components">4. Informational components</h5>
<ul>
<li>Tool-tip, icon, Progress bar, Notification, Message Box, Modal</li>
</ul>
<h5 id="5.-container">5. Container</h5>
<ul>
<li>Accordion</li>
</ul>
<h2 id="input-box">Input Box</h2>
<p>&#xE43;&#xE0A;&#xE49;&#xE2A;&#xE33;&#xE2B;&#xE23;&#xE31;&#xE1A;&#xE23;&#xE31;&#xE1A;&#xE02;&#xE49;&#xE2D;&#xE21;&#xE39;&#xE25;&#xE08;&#xE32;&#xE01;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19; &#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE19;&#xE33;&#xE02;&#xE49;&#xE2D;&#xE21;&#xE39;&#xE25;&#xE44;&#xE1B;&#xE40;&#xE01;&#xE47;&#xE1A;&#xE2B;&#xE23;&#xE37;&#xE2D;&#xE1B;&#xE23;&#xE30;&#xE21;&#xE27;&#xE25;&#xE1C;&#xE25;&#xE15;&#xE48;&#xE2D; &#xE43;&#xE0A;&#xE49;&#xE2A;&#xE33;&#xE2B;&#xE23;&#xE31;&#xE1A;&#xE23;&#xE31;&#xE1A;&#xE02;&#xE49;&#xE2D;&#xE21;&#xE39;&#xE25;&#xE40;&#xE1B;&#xE47;&#xE19; Text &#xE2B;&#xE23;&#xE37;&#xE2D; &#xE15;&#xE31;&#xE27;&#xE40;&#xE25;&#xE02;</p>
<h4 id="anatomy">Anatomy</h4>
<p><img src="images/text-box/Text-Box-Anatomy.jpg" alt="Test"></p>
<ol>
<li>Label</li>
<li>Leading Icon (optional)</li>
<li>Helper Text (optional)</li>
<li>Tailing Icon (optional)</li>
<li>Container</li>
</ol>
<h4 id="state">State</h4>
<p><img src="images/text-box/Text-Box-State.jpg" alt="Test"></p>
<h4 id="speces">Speces</h4>
<p><img src="images/text-box/Text-Box-Spec.jpg" alt="Test"></p>
<h4 id="required-text-indicator">Required text indicator</h4>
<p>&#xE16;&#xE49;&#xE32;&#xE2A;&#xE48;&#xE27;&#xE19;&#xE43;&#xE2B;&#xE0D;&#xE48;&#xE08;&#xE33;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE01;&#xE23;&#xE2D;&#xE01; &#xE43;&#xE2B;&#xE49;&#xE23;&#xE30;&#xE1A;&#xE38;&#xE0A;&#xE48;&#xE2D;&#xE07;&#xE01;&#xE23;&#xE2D;&#xE01;&#xE40;&#xE1B;&#xE47;&#xE19; (Optional) &#xE41;&#xE17;&#xE19; &#xE41;&#xE25;&#xE49;&#xE27;&#xE40;&#xE2D;&#xE32; * &#xE2D;&#xE2D;&#xE01;&#xE17;&#xE31;&#xE49;&#xE07;&#xE2B;&#xE21;&#xE14;
<img src="images/text-box/Text-Box-Indicator.jpg" alt="Test"></p>
<h2 id="button">Button</h2>
<h4 id="text-label">Text Label</h4>
<p>&#xE40;&#xE1B;&#xE47;&#xE19;&#xE04;&#xE33;&#xE1E;&#xE39;&#xE14;&#xE17;&#xE35;&#xE48;&#xE43;&#xE0A;&#xE49;&#xE2D;&#xE18;&#xE34;&#xE1A;&#xE32;&#xE22;&#xE01;&#xE32;&#xE23;&#xE17;&#xE33;&#xE07;&#xE32;&#xE19;&#xE02;&#xE2D;&#xE07;&#xE1B;&#xE38;&#xE48;&#xE21;&#xE41;&#xE1A;&#xE1A;&#xE2A;&#xE31;&#xE49;&#xE19;&#xE46; &#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE43;&#xE2B;&#xE49;&#xE40;&#xE02;&#xE49;&#xE32;&#xE43;&#xE08;&#xE41;&#xE25;&#xE30;&#xE2A;&#xE32;&#xE21;&#xE32;&#xE23;&#xE16;&#xE04;&#xE32;&#xE14;&#xE40;&#xE14;&#xE32;&#xE44;&#xE14;&#xE49;&#xE27;&#xE48;&#xE32;&#xE08;&#xE30;&#xE40;&#xE01;&#xE34;&#xE14;&#xE2D;&#xE30;&#xE44;&#xE23;&#xE02;&#xE36;&#xE49;&#xE19;&#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE01;&#xE14;&#xE1B;&#xE38;&#xE48;&#xE21; &#xE41;&#xE25;&#xE30;&#xE43;&#xE0A;&#xE49;&#xE15;&#xE31;&#xE27;&#xE2D;&#xE31;&#xE01;&#xE29;&#xE23;&#xE1E;&#xE34;&#xE21;&#xE1E;&#xE4C;&#xE43;&#xE2B;&#xE0D;&#xE48; &#xE16;&#xE49;&#xE32;&#xE2B;&#xE32;&#xE01;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE20;&#xE32;&#xE29;&#xE32;&#xE2D;&#xE31;&#xE07;&#xE01;&#xE24;&#xE29; &#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE43;&#xE2B;&#xE49;&#xE40;&#xE2B;&#xE47;&#xE19;&#xE16;&#xE36;&#xE07;&#xE04;&#xE27;&#xE32;&#xE21;&#xE41;&#xE15;&#xE01;&#xE15;&#xE48;&#xE32;&#xE07;</p>
<p>&#xE04;&#xE27;&#xE23;&#xE43;&#xE0A;&#xE49;&#xE04;&#xE33;&#xE2D;&#xE18;&#xE34;&#xE1A;&#xE32;&#xE22;&#xE20;&#xE32;&#xE22;&#xE43;&#xE19;&#xE2B;&#xE19;&#xE36;&#xE48;&#xE07;&#xE1A;&#xE23;&#xE23;&#xE17;&#xE31;&#xE14; &#xE44;&#xE21;&#xE48;&#xE04;&#xE27;&#xE23;&#xE17;&#xE33;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE2A;&#xE2D;&#xE07;&#xE1A;&#xE23;&#xE23;&#xE17;&#xE31;&#xE14;</p>
<p><img src="images/button/Text-Label-Case.jpg" alt="Test"></p>
<h4 id="text-button">Text Button</h4>
<p>&#xE40;&#xE1B;&#xE47;&#xE19;&#xE1B;&#xE38;&#xE48;&#xE21;&#xE17;&#xE35;&#xE48;&#xE21;&#xE35;&#xE04;&#xE27;&#xE32;&#xE21;&#xE40;&#xE14;&#xE48;&#xE19;&#xE19;&#xE49;&#xE2D;&#xE22;&#xE17;&#xE35;&#xE48;&#xE2A;&#xE38;&#xE14;&#xE43;&#xE19;&#xE1A;&#xE23;&#xE23;&#xE14;&#xE32;&#xE1B;&#xE38;&#xE48;&#xE21;&#xE17;&#xE31;&#xE49;&#xE07;&#xE2B;&#xE21;&#xE14; &#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE2D;&#xE22;&#xE39;&#xE48;&#xE23;&#xE48;&#xE27;&#xE21;&#xE01;&#xE31;&#xE19;&#xE01;&#xE31;&#xE1A; Cards &#xE2B;&#xE23;&#xE37;&#xE2D; Dialogs &#xE15;&#xE48;&#xE32;&#xE07;&#xE46;</p>
<p><img src="images/button/Text-Button.jpg" alt="Test"></p>
<h4 id="outline-button">Outline Button</h4>
<p>&#xE40;&#xE1B;&#xE47;&#xE19;&#xE1B;&#xE38;&#xE48;&#xE21;&#xE17;&#xE35;&#xE48;&#xE21;&#xE35;&#xE04;&#xE27;&#xE32;&#xE21;&#xE40;&#xE14;&#xE48;&#xE19;&#xE1B;&#xE32;&#xE19;&#xE01;&#xE25;&#xE32;&#xE07; &#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE17;&#xE35;&#xE48;&#xE43;&#xE0A;&#xE49;&#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE43;&#xE2B;&#xE49;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE15;&#xE31;&#xE27;&#xE40;&#xE25;&#xE37;&#xE2D;&#xE01;&#xE23;&#xE2D;&#xE07;&#xE21;&#xE32;&#xE08;&#xE32;&#xE01;&#xE15;&#xE31;&#xE27;&#xE40;&#xE25;&#xE37;&#xE2D;&#xE01;&#xE2B;&#xE25;&#xE31;&#xE01; &#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE43;&#xE2B;&#xE49;&#xE21;&#xE35;&#xE01;&#xE32;&#xE23;&#xE15;&#xE31;&#xE14;&#xE2A;&#xE34;&#xE19;&#xE43;&#xE08;&#xE1A;&#xE32;&#xE07;&#xE2D;&#xE22;&#xE48;&#xE32;&#xE07;</p>
<p><img src="images/button/Outline-Button.jpg" alt="Test"></p>
<h4 id="contained-button">Contained Button</h4>
<p>&#xE40;&#xE1B;&#xE47;&#xE19;&#xE1B;&#xE38;&#xE48;&#xE21;&#xE17;&#xE35;&#xE48;&#xE21;&#xE35;&#xE04;&#xE27;&#xE32;&#xE21;&#xE40;&#xE14;&#xE48;&#xE19;&#xE21;&#xE32;&#xE01;&#xE17;&#xE35;&#xE48;&#xE2A;&#xE38;&#xE14;&#xE43;&#xE19;&#xE1A;&#xE23;&#xE23;&#xE14;&#xE32;&#xE1B;&#xE38;&#xE48;&#xE21;&#xE17;&#xE31;&#xE49;&#xE07;&#xE2B;&#xE21;&#xE14; &#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE40;&#xE1B;&#xE47;&#xE19; Call to Action &#xE2B;&#xE25;&#xE31;&#xE01;</p>
<p><img src="images/button/Contained-Button.jpg" alt="Test"></p>
<h4 id="toggle-button">Toggle Button</h4>
<p>&#xE40;&#xE1B;&#xE47;&#xE19;&#xE1B;&#xE38;&#xE48;&#xE21;&#xE17;&#xE35;&#xE48;&#xE43;&#xE0A;&#xE49;&#xE2A;&#xE33;&#xE2B;&#xE23;&#xE31;&#xE1A;&#xE40;&#xE1B;&#xE34;&#xE14;&#xE2B;&#xE23;&#xE37;&#xE2D;&#xE1B;&#xE34;&#xE14; Function &#xE15;&#xE48;&#xE32;&#xE07;&#xE46; &#xE0B;&#xE36;&#xE48;&#xE07;&#xE21;&#xE35;&#xE1C;&#xE25;&#xE17;&#xE31;&#xE19;&#xE17;&#xE35;&#xE17;&#xE35;&#xE48;&#xE01;&#xE14;&#xE1B;&#xE38;&#xE48;&#xE21;</p>
<p><img src="images/button/Toggle-Button.jpg" alt="Test"></p>
<h2 id="selection-control">Selection Control</h2>
<h4 id="checkbox">Checkbox</h4>
<ul>
<li>&#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE01;&#xE32;&#xE23;&#xE40;&#xE25;&#xE37;&#xE2D;&#xE01;&#xE2B;&#xE19;&#xE36;&#xE48;&#xE07;&#xE2B;&#xE23;&#xE37;&#xE2D;&#xE2B;&#xE25;&#xE32;&#xE22;&#xE46;&#xE2A;&#xE34;&#xE48;&#xE07;&#xE08;&#xE32;&#xE01;&#xE2B;&#xE25;&#xE32;&#xE22;&#xE01;&#xE32;&#xE23;</li>
<li>&#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE21;&#xE35;&#xE15;&#xE31;&#xE27;&#xE40;&#xE25;&#xE37;&#xE2D;&#xE01;&#xE22;&#xE48;&#xE2D;&#xE22;&#xE43;&#xE19;&#xE2B;&#xE31;&#xE27;&#xE40;&#xE23;&#xE37;&#xE48;&#xE2D;&#xE07;</li>
<li>&#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE01;&#xE32;&#xE23;&#xE40;&#xE1B;&#xE34;&#xE14;-&#xE1B;&#xE34;&#xE14;&#xE15;&#xE31;&#xE27;&#xE40;&#xE25;&#xE37;&#xE2D;&#xE01; (Desktop)</li>
</ul>
<p><img src="images/input-control/Checkbox-Case.jpg" alt="Test">
<img src="images/input-control/Select-all-Case.jpg" alt="Test"></p>
<h4 id="radio">Radio</h4>
<ul>
<li>&#xE40;&#xE25;&#xE37;&#xE2D;&#xE01;&#xE40;&#xE1E;&#xE35;&#xE22;&#xE07;&#xE2B;&#xE19;&#xE36;&#xE48;&#xE07;&#xE2D;&#xE22;&#xE48;&#xE32;&#xE07;&#xE08;&#xE32;&#xE01;&#xE2A;&#xE34;&#xE48;&#xE07;&#xE17;&#xE35;&#xE48;&#xE21;&#xE35;&#xE17;&#xE31;&#xE49;&#xE07;&#xE2B;&#xE21;&#xE14;</li>
<li>&#xE40;&#xE2B;&#xE47;&#xE19;&#xE15;&#xE31;&#xE27;&#xE40;&#xE25;&#xE37;&#xE2D;&#xE01;&#xE17;&#xE31;&#xE49;&#xE07;&#xE2B;&#xE21;&#xE14;&#xE1E;&#xE23;&#xE49;&#xE2D;&#xE21;&#xE46;&#xE01;&#xE31;&#xE19;</li>
</ul>
<p><img src="images/input-control/Radio-Case.jpg" alt="Test"></p>
<h4 id="switch">Switch</h4>
<ul>
<li>&#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE01;&#xE32;&#xE23;&#xE40;&#xE1B;&#xE34;&#xE14;-&#xE1B;&#xE34;&#xE14;&#xE2A;&#xE34;&#xE48;&#xE07;&#xE43;&#xE14;&#xE46; (Tablet, Mobile)</li>
<li>&#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE01;&#xE32;&#xE23;&#xE40;&#xE1B;&#xE34;&#xE14;-&#xE1B;&#xE34;&#xE14;&#xE2A;&#xE34;&#xE48;&#xE07;&#xE43;&#xE14;&#xE46; &#xE0B;&#xE36;&#xE48;&#xE07;&#xE21;&#xE35;&#xE1C;&#xE25;&#xE17;&#xE31;&#xE19;&#xE17;&#xE35;</li>
</ul>
<p><img src="images/input-control/Switch-Case.jpg" alt="Test"></p>
<h4 id="state">State</h4>
<p><img src="images/input-control/State.jpg" alt="Test"></p>
<h4 id="speces">Speces</h4>
<p><img src="images/input-control/Specs.jpg" alt="Test"></p>
<h2 id="modals">Modals</h2>
<p>&#xE40;&#xE1B;&#xE47;&#xE19;&#xE2A;&#xE34;&#xE48;&#xE07;&#xE17;&#xE35;&#xE48;&#xE44;&#xE27;&#xE49;&#xE2A;&#xE33;&#xE2B;&#xE23;&#xE31;&#xE1A;&#xE41;&#xE08;&#xE49;&#xE07;&#xE02;&#xE49;&#xE2D;&#xE21;&#xE39;&#xE25;&#xE1A;&#xE32;&#xE07;&#xE2D;&#xE22;&#xE48;&#xE32;&#xE07;&#xE17;&#xE35;&#xE48;&#xE21;&#xE35;&#xE04;&#xE27;&#xE32;&#xE21;&#xE2A;&#xE33;&#xE04;&#xE31;&#xE0D;&#xE21;&#xE32;&#xE01;&#xE41;&#xE01;&#xE48;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19; &#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE43;&#xE2B;&#xE49;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE15;&#xE31;&#xE14;&#xE2A;&#xE34;&#xE19;&#xE43;&#xE08;&#xE1A;&#xE32;&#xE07;&#xE2D;&#xE22;&#xE48;&#xE32;&#xE07;</p>
<h4 id="anatomy">Anatomy</h4>
<p><img src="images/modals/Modal-Anatomy.jpg" alt="Test"></p>
<ol>
<li>Container</li>
<li>Title (Optional)</li>
<li>Supporting Text</li>
<li>Buttons</li>
</ol>
<h4 id="simple-modal">Simple Modal</h4>
<p>&#xE40;&#xE1B;&#xE47;&#xE19; Modal &#xE2D;&#xE22;&#xE48;&#xE32;&#xE07;&#xE07;&#xE48;&#xE32;&#xE22; &#xE43;&#xE0A;&#xE49;&#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE40;&#xE2A;&#xE19;&#xE2D; Content &#xE1A;&#xE32;&#xE07;&#xE2D;&#xE22;&#xE48;&#xE32;&#xE07;&#xE17;&#xE35;&#xE48;&#xE21;&#xE35;&#xE04;&#xE27;&#xE32;&#xE21;&#xE2A;&#xE33;&#xE04;&#xE31;&#xE0D;&#xE41;&#xE01;&#xE48;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19; &#xE2D;&#xE32;&#xE08;&#xE08;&#xE30;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE15;&#xE31;&#xE27;&#xE40;&#xE25;&#xE37;&#xE2D;&#xE01;&#xE17;&#xE35;&#xE48;&#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE40;&#xE25;&#xE37;&#xE2D;&#xE01;&#xE41;&#xE25;&#xE49;&#xE27;&#xE21;&#xE35;&#xE1C;&#xE25;&#xE17;&#xE31;&#xE19;&#xE17;&#xE35;
<img src="images/modals/Simple-Modal.jpg" alt="Test"></p>
<h4 id="alert-modal">Alert Modal</h4>
<p>&#xE40;&#xE1B;&#xE47;&#xE19; Modal &#xE2A;&#xE33;&#xE2B;&#xE23;&#xE31;&#xE1A;&#xE41;&#xE08;&#xE49;&#xE07;&#xE40;&#xE15;&#xE37;&#xE2D;&#xE19;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE43;&#xE2B;&#xE49;&#xE17;&#xE33;&#xE01;&#xE32;&#xE23;&#xE15;&#xE31;&#xE14;&#xE2A;&#xE34;&#xE19;&#xE43;&#xE08; &#xE08;&#xE36;&#xE07;&#xE08;&#xE30;&#xE2A;&#xE32;&#xE21;&#xE32;&#xE23;&#xE16;&#xE17;&#xE33;&#xE23;&#xE32;&#xE22;&#xE01;&#xE32;&#xE23;&#xE15;&#xE48;&#xE2D;&#xE44;&#xE1B;&#xE44;&#xE14;&#xE49;
<img src="images/modals/Alert-Modal.jpg" alt="Test"></p>
<h4 id="confirmation-modal">Confirmation Modal</h4>
<p>&#xE40;&#xE1B;&#xE47;&#xE19; Modal &#xE2A;&#xE33;&#xE2B;&#xE23;&#xE31;&#xE1A;&#xE43;&#xE2B;&#xE49;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE15;&#xE31;&#xE14;&#xE2A;&#xE34;&#xE19;&#xE43;&#xE08;&#xE40;&#xE25;&#xE37;&#xE2D;&#xE01;&#xE1A;&#xE32;&#xE07;&#xE2D;&#xE22;&#xE48;&#xE32;&#xE07; &#xE08;&#xE32;&#xE01;&#xE2A;&#xE34;&#xE48;&#xE07;&#xE17;&#xE35;&#xE48; Modal &#xE41;&#xE2A;&#xE14;&#xE07;&#xE1C;&#xE25;&#xE2D;&#xE2D;&#xE01;&#xE21;&#xE32;
<img src="images/modals/Confirmation-Modal.jpg" alt="Test"></p>
<h4 id="speces">Speces</h4>
<p>Modal Desktop
<img src="images/modals/Modal-Desktop-Spec.jpg" alt="Test"></p>
<p>Modal Mobile
<img src="images/modals/Modal-Mobile-Spec.jpg" alt="Test"></p>
<h2 id="list-of-items">List of items</h2>
<p>&#xE01;&#xE32;&#xE23;&#xE41;&#xE2A;&#xE14;&#xE07;&#xE23;&#xE32;&#xE22;&#xE01;&#xE32;&#xE23;&#xE15;&#xE48;&#xE32;&#xE07;&#xE46;&#xE40;&#xE0A;&#xE48;&#xE19; &#xE23;&#xE32;&#xE22;&#xE01;&#xE32;&#xE23;&#xE40;&#xE2D;&#xE01;&#xE2A;&#xE32;&#xE23;, &#xE23;&#xE32;&#xE22;&#xE01;&#xE32;&#xE23;&#xE02;&#xE2D;&#xE07;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19; &#xE19;&#xE2D;&#xE01;&#xE08;&#xE32;&#xE01;&#xE01;&#xE32;&#xE23;&#xE41;&#xE2A;&#xE14;&#xE07;&#xE1C;&#xE25;&#xE41;&#xE1A;&#xE1A;&#xE15;&#xE32;&#xE23;&#xE32;&#xE07;&#xE41;&#xE25;&#xE49;&#xE27; &#xE22;&#xE31;&#xE07;&#xE2A;&#xE32;&#xE21;&#xE32;&#xE23;&#xE16;&#xE41;&#xE2A;&#xE14;&#xE07;&#xE23;&#xE32;&#xE22;&#xE01;&#xE32;&#xE23;&#xE14;&#xE49;&#xE27;&#xE22;&#xE01;&#xE32;&#xE23;&#xE4C;&#xE14;&#xE44;&#xE14;&#xE49; &#xE42;&#xE14;&#xE22;&#xE1B;&#xE23;&#xE31;&#xE1A;&#xE2B;&#xE31;&#xE27;&#xE15;&#xE32;&#xE23;&#xE32;&#xE07;&#xE43;&#xE2B;&#xE49;&#xE44;&#xE1B;&#xE2D;&#xE22;&#xE39;&#xE48;&#xE04;&#xE39;&#xE48;&#xE01;&#xE31;&#xE1A;&#xE0A;&#xE38;&#xE14;&#xE02;&#xE49;&#xE2D;&#xE21;&#xE39;&#xE25; &#xE41;&#xE25;&#xE30;&#xE01;&#xE25;&#xE38;&#xE48;&#xE21;&#xE02;&#xE2D;&#xE07;&#xE02;&#xE49;&#xE2D;&#xE21;&#xE39;&#xE25;&#xE17;&#xE35;&#xE48;&#xE21;&#xE35;&#xE04;&#xE27;&#xE32;&#xE21;&#xE2A;&#xE31;&#xE21;&#xE1E;&#xE31;&#xE19;&#xE18;&#xE4C;&#xE01;&#xE31;&#xE19;&#xE01;&#xE47;&#xE2A;&#xE32;&#xE21;&#xE32;&#xE23;&#xE16;&#xE2D;&#xE22;&#xE39;&#xE48;&#xE14;&#xE49;&#xE27;&#xE22;&#xE01;&#xE31;&#xE19;&#xE42;&#xE14;&#xE22;&#xE2D;&#xE32;&#xE28;&#xE31;&#xE22;&#xE2B;&#xE31;&#xE27;&#xE15;&#xE32;&#xE23;&#xE32;&#xE07; (label) &#xE40;&#xE14;&#xE35;&#xE22;&#xE27;&#xE01;&#xE31;&#xE19;</p>
<p><img src="images/element-list/list01.png" alt="Test"></p>

        </div>
        <div class="footer-nav">
          <div class="left"><a href="guideline-navigation.html"><span class="title">Navigation</span></a></div>
          <div class="right"><a href="visual-color.html"><span class="label">Next: </span><span class="title">Colors</span></a></div>
        </div>
      </div>
    </div>
  </body>
</html>