<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf-8">
    <link rel="stylesheet" href="assets/style.css?t=90051322">
    <link rel="stylesheet" href="https://ricostacruz.com/docpress-rsc/style.css">
    <link rel="stylesheet" href="extra.css?t=5c8ec47c">
    <script src="assets/script.js?t=93f1a66c"></script>
    <title>Sankom Design</title>
    <meta name="viewport" content="width=device-width">
  </head>
  <body class="-menu-visible">
    <div class="doc-layout">
      <div class="toggle menu-toggle js-menu-toggle"></div>
      <div class="menu toc-menu">
        <ul>
          <li class="menu-item -level-0 -parent">
            <ul class="submenu">
              <li class="menu-item -level-1"><a class="link title -active link-index" href="index.html">Sankom Design</a>
                <ul class="headings heading-list">
                  <li class="heading-item -depth-2"><a class="hlink link-" href="#">บทนำ</a>
                  </li>
                </ul>
              </li>
              <li class="menu-item -level-1"><a class="link title  link-getting-start" href="getting-start.html">Getting Start</a>
              </li>
              <li class="menu-item -level-1"><a class="link title  link-design-principle" href="design-principle.html">Design Principle</a>
              </li>
              <li class="menu-item -level-1 -parent"><span class="title">Guideline</span>
                <ul class="submenu">
                  <li class="menu-item -level-2"><a class="link title  link-guideline-navigation" href="guideline-navigation.html">Navigation</a>
                  </li>
                  <li class="menu-item -level-2"><span class="title">Panel</span>
                  </li>
                  <li class="menu-item -level-2"><a class="link title  link-guideline-element" href="guideline-element.html">Element</a>
                  </li>
                  <li class="menu-item -level-2"><span class="title">Plugin</span>
                  </li>
                  <li class="menu-item -level-2"><span class="title">New Account</span>
                  </li>
                </ul>
              </li>
              <li class="menu-item -level-1 -parent"><span class="title">Visual</span>
                <ul class="submenu">
                  <li class="menu-item -level-2"><a class="link title  link-visual-color" href="visual-color.html">Colors</a>
                  </li>
                  <li class="menu-item -level-2"><span class="title">Layout</span>
                  </li>
                  <li class="menu-item -level-2"><a class="link title  link-visual-font" href="visual-font.html">Fonts</a>
                  </li>
                  <li class="menu-item -level-2"><span class="title">Icon</span>
                  </li>
                </ul>
              </li>
              <li class="menu-item -level-1"><a class="link title  link-contribute" href="contribute.html">Contribute</a>
              </li>
            </ul>
          </li>
        </ul>
      </div>
      <div class="body page-index">
        <div class="header-nav">
          <div class="right"><a class="iconlink" href="https://github.com/sankomdesign/guideline" data-title="sankomdesign/guideline">
              <!-- span.title Open in GitHub--><span class="icon -github"></span></a>
          </div>
        </div>
        <div class="markdown-body"><h1 class="massive-header -with-tagline" id="sankom-guideline">Sankom Guideline</h1>
<blockquote>
<p>&#xE41;&#xE2A;&#xE19;&#xE04;&#xE21;</p>
</blockquote>
<p>&#xE40;&#xE2D;&#xE01;&#xE2A;&#xE32;&#xE23;&#xE09;&#xE1A;&#xE31;&#xE1A;&#xE19;&#xE35;&#xE49;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE40;&#xE1E;&#xE35;&#xE22;&#xE07;&#xE02;&#xE49;&#xE2D;&#xE41;&#xE19;&#xE30;&#xE19;&#xE33;&#xE2A;&#xE33;&#xE2B;&#xE23;&#xE31;&#xE1A;&#xE01;&#xE32;&#xE23;&#xE2D;&#xE2D;&#xE01;&#xE41;&#xE1A;&#xE1A;&#xE23;&#xE30;&#xE1A;&#xE1A;&#xE20;&#xE32;&#xE22;&#xE43;&#xE19;&#xE02;&#xE2D;&#xE07;&#xE41;&#xE2A;&#xE19;&#xE2A;&#xE34;&#xE23;&#xE34; &#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE43;&#xE2B;&#xE49;&#xE40;&#xE23;&#xE32;&#xE2D;&#xE2D;&#xE01;&#xE41;&#xE1A;&#xE1A;&#xE44;&#xE1B;&#xE43;&#xE19;&#xE17;&#xE32;&#xE07;&#xE40;&#xE14;&#xE35;&#xE22;&#xE27;&#xE01;&#xE31;&#xE19;</p>
<h2 id>&#xE1A;&#xE17;&#xE19;&#xE33;</h2>
<p>&#xE40;&#xE23;&#xE32;&#xE21;&#xE35;&#xE40;&#xE0A;&#xE37;&#xE48;&#xE2D;&#xE27;&#xE48;&#xE32;&#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE23;&#xE30;&#xE1A;&#xE1A;&#xE15;&#xE48;&#xE32;&#xE07; &#xE46; &#xE2D;&#xE2D;&#xE01;&#xE41;&#xE1A;&#xE1A;&#xE44;&#xE1B;&#xE43;&#xE19;&#xE17;&#xE34;&#xE28;&#xE17;&#xE32;&#xE07;&#xE40;&#xE14;&#xE35;&#xE22;&#xE27;&#xE01;&#xE31;&#xE19; &#xE08;&#xE30;&#xE17;&#xE33;&#xE43;&#xE2B;&#xE49;&#xE1C;&#xE39;&#xE49;&#xE17;&#xE35;&#xE48;&#xE40;&#xE23;&#xE35;&#xE22;&#xE19;&#xE23;&#xE39;&#xE49;&#xE23;&#xE30;&#xE1A;&#xE1A;&#xE07;&#xE32;&#xE19;&#xE43;&#xE14;&#xE07;&#xE32;&#xE19;&#xE2B;&#xE19;&#xE36;&#xE48;&#xE07;&#xE44;&#xE1B;&#xE41;&#xE25;&#xE49;&#xE27; &#xE08;&#xE30;&#xE2A;&#xE32;&#xE21;&#xE32;&#xE23;&#xE16;&#xE40;&#xE02;&#xE49;&#xE32;&#xE43;&#xE08;&#xE01;&#xE32;&#xE23;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE23;&#xE30;&#xE1A;&#xE1A;&#xE2D;&#xE37;&#xE48;&#xE19; &#xE46; &#xE44;&#xE14;&#xE49;&#xE23;&#xE27;&#xE14;&#xE40;&#xE23;&#xE47;&#xE27;&#xE21;&#xE32;&#xE01;&#xE02;&#xE36;&#xE49;&#xE19;&#xE42;&#xE14;&#xE22;&#xE2D;&#xE32;&#xE28;&#xE31;&#xE22;&#xE04;&#xE27;&#xE32;&#xE21;&#xE40;&#xE02;&#xE49;&#xE32;&#xE43;&#xE08;&#xE43;&#xE19;&#xE23;&#xE30;&#xE1A;&#xE1A;&#xE01;&#xE48;&#xE2D;&#xE19;&#xE2B;&#xE19;&#xE49;&#xE32; &#xE40;&#xE0A;&#xE48;&#xE19; &#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE2A;&#xE32;&#xE21;&#xE23;&#xE16;&#xE40;&#xE14;&#xE32;&#xE15;&#xE33;&#xE41;&#xE2B;&#xE19;&#xE48;&#xE07;&#xE02;&#xE2D;&#xE07;&#xE1B;&#xE38;&#xE48;&#xE21;&#xE2A;&#xE23;&#xE49;&#xE32;&#xE07;&#xE40;&#xE2D;&#xE01;&#xE2A;&#xE32;&#xE23;&#xE44;&#xE14;&#xE49;&#xE17;&#xE31;&#xE19;&#xE17;&#xE35; &#xE40;&#xE1E;&#xE23;&#xE32;&#xE30;&#xE2D;&#xE22;&#xE39;&#xE48;&#xE15;&#xE33;&#xE41;&#xE2B;&#xE19;&#xE48;&#xE07;&#xE40;&#xE14;&#xE35;&#xE22;&#xE27;&#xE01;&#xE31;&#xE1A;&#xE42;&#xE1B;&#xE23;&#xE41;&#xE01;&#xE23;&#xE21;&#xE17;&#xE35;&#xE48;&#xE40;&#xE04;&#xE22;&#xE43;&#xE0A;&#xE49; &#xE40;&#xE1B;&#xE47;&#xE19;&#xE15;&#xE49;&#xE19;</p>
<p>&#xE40;&#xE2D;&#xE01;&#xE2A;&#xE32;&#xE23;&#xE09;&#xE1A;&#xE31;&#xE1A;&#xE19;&#xE35;&#xE49;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE40;&#xE1E;&#xE35;&#xE22;&#xE07;&#xE04;&#xE33;&#xE41;&#xE19;&#xE30;&#xE19;&#xE33;&#xE40;&#xE17;&#xE48;&#xE32;&#xE19;&#xE31;&#xE49;&#xE19; &#xE1C;&#xE39;&#xE49;&#xE17;&#xE35;&#xE48;&#xE2D;&#xE2D;&#xE01;&#xE41;&#xE1A;&#xE1A;&#xE23;&#xE30;&#xE1A;&#xE1A;&#xE2A;&#xE32;&#xE21;&#xE32;&#xE23;&#xE16;&#xE1B;&#xE23;&#xE31;&#xE1A;&#xE41;&#xE01;&#xE49;&#xE44;&#xE14;&#xE49;&#xE15;&#xE32;&#xE21;&#xE04;&#xE27;&#xE32;&#xE21;&#xE40;&#xE2B;&#xE21;&#xE32;&#xE30;&#xE2A;&#xE21;&#xE02;&#xE2D;&#xE07;&#xE23;&#xE30;&#xE1A;&#xE1A;&#xE19;&#xE31;&#xE49;&#xE19; &#xE46; &#xE42;&#xE14;&#xE22;&#xE22;&#xE36;&#xE14;&#xE04;&#xE27;&#xE32;&#xE21;&#xE23;&#xE27;&#xE14;&#xE40;&#xE23;&#xE47;&#xE27;&#xE43;&#xE19;&#xE01;&#xE32;&#xE23;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19; &#xE41;&#xE25;&#xE30;&#xE04;&#xE27;&#xE32;&#xE21;&#xE07;&#xE48;&#xE32;&#xE22;&#xE01;&#xE32;&#xE23;&#xE17;&#xE33;&#xE04;&#xE27;&#xE32;&#xE21;&#xE40;&#xE02;&#xE49;&#xE32;&#xE43;&#xE08;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE2B;&#xE25;&#xE31;&#xE01; &#xE17;&#xE35;&#xE21;&#xE07;&#xE32;&#xE19;&#xE1E;&#xE22;&#xE32;&#xE22;&#xE32;&#xE21;&#xE40;&#xE02;&#xE35;&#xE22;&#xE19;&#xE40;&#xE2B;&#xE15;&#xE38;&#xE1C;&#xE25;&#xE02;&#xE2D;&#xE07;&#xE02;&#xE49;&#xE2D;&#xE41;&#xE19;&#xE30;&#xE19;&#xE33;&#xE15;&#xE48;&#xE32;&#xE07; &#xE46; &#xE44;&#xE27;&#xE49;&#xE43;&#xE19;&#xE40;&#xE2D;&#xE01;&#xE2A;&#xE32;&#xE23;&#xE09;&#xE1A;&#xE31;&#xE1A;&#xE19;&#xE35;&#xE49;&#xE14;&#xE49;&#xE27;&#xE22;&#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE43;&#xE0A;&#xE49;&#xE1B;&#xE23;&#xE30;&#xE01;&#xE2D;&#xE1A;&#xE01;&#xE32;&#xE23;&#xE15;&#xE31;&#xE14;&#xE2A;&#xE34;&#xE19;&#xE43;&#xE08;</p>
<p>&#xE2B;&#xE32;&#xE01;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE01;&#xE32;&#xE23;&#xE40;&#xE02;&#xE49;&#xE32;&#xE21;&#xE32;&#xE0A;&#xE48;&#xE27;&#xE22;&#xE01;&#xE31;&#xE19;&#xE1B;&#xE23;&#xE31;&#xE1A;&#xE41;&#xE01;&#xE49;&#xE40;&#xE2D;&#xE01;&#xE2A;&#xE32;&#xE23;&#xE09;&#xE1A;&#xE31;&#xE1A;&#xE19;&#xE35;&#xE49;&#xE2A;&#xE32;&#xE21;&#xE32;&#xE23;&#xE16;&#xE2A;&#xE48;&#xE07; <a href="https://help.github.com/en/articles/about-pull-requests">Pull Request</a> &#xE21;&#xE32;&#xE44;&#xE14;&#xE49;&#xE17;&#xE35;&#xE48; <a href="https://github.com/sankomdesign/guideline">Github</a></p>
<p>&#xE40;&#xE27;&#xE47;&#xE1A;&#xE44;&#xE0B;&#xE15;&#xE4C; <a href="https://sankomdesign.github.io/guideline/">https://sankomdesign.github.io/guideline</a></p>
<p class="pull-box">&#xE21;&#xE32;&#xE40;&#xE23;&#xE34;&#xE48;&#xE21;&#xE15;&#xE49;&#xE19;&#xE08;&#xE32;&#xE01;&#xE04;&#xE27;&#xE32;&#xE21;&#xE40;&#xE02;&#xE49;&#xE32;&#xE43;&#xE08;&#xE1E;&#xE37;&#xE49;&#xE19;&#xE10;&#xE32;&#xE19;&#xE01;&#xE31;&#xE19; <a href="getting-start.html">Getting Start</a></p>
<hr style="display:none">
<p><strong>San Kom Design System</strong> &#xA9; 2019+, Released under the <a href="http://mit-license.org/">MIT</a> License.<br></p>

        </div>
        <div class="footer-nav">
          <div class="right"><a href="getting-start.html"><span class="label">Next: </span><span class="title">Getting Start</span></a></div>
        </div>
      </div>
    </div>
  </body>
</html>