<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf-8">
    <link rel="stylesheet" href="assets/style.css?t=90051322">
    <link rel="stylesheet" href="https://ricostacruz.com/docpress-rsc/style.css">
    <link rel="stylesheet" href="extra.css?t=5c8ec47c">
    <script src="assets/script.js?t=93f1a66c"></script>
    <title>Grid - Sankom Design</title>
    <meta name="viewport" content="width=device-width">
  </head>
  <body class="-menu-visible">
    <div class="doc-layout">
      <div class="toggle menu-toggle js-menu-toggle"></div>
      <div class="menu toc-menu">
        <ul>
          <li class="menu-item -level-0 -parent">
            <ul class="submenu">
              <li class="menu-item -level-1"><a class="link title  link-index" href="index.html">Sankom Design</a>
              </li>
              <li class="menu-item -level-1"><a class="link title  link-getting-start" href="getting-start.html">Getting Start</a>
              </li>
              <li class="menu-item -level-1"><a class="link title  link-design-principle" href="design-principle.html">Design Principle</a>
              </li>
              <li class="menu-item -level-1 -parent"><span class="title">Guideline</span>
                <ul class="submenu">
                  <li class="menu-item -level-2"><a class="link title  link-guideline-navigation" href="guideline-navigation.html">Navigation</a>
                  </li>
                  <li class="menu-item -level-2"><a class="link title  link-guideline-layout" href="guideline-layout.html">Layout</a>
                  </li>
                  <li class="menu-item -level-2"><a class="link title  link-guideline-element" href="guideline-element.html">Element</a>
                  </li>
                  <li class="menu-item -level-2"><span class="title">Plugin</span>
                  </li>
                  <li class="menu-item -level-2"><span class="title">New Account</span>
                  </li>
                </ul>
              </li>
              <li class="menu-item -level-1 -parent"><span class="title">Visual</span>
                <ul class="submenu">
                  <li class="menu-item -level-2"><a class="link title  link-visual-color" href="visual-color.html">Colors</a>
                  </li>
                  <li class="menu-item -level-2"><a class="link title -active link-visual-grid" href="visual-grid.html">Grid</a>
                    <ul class="headings heading-list">
                      <li class="heading-item -depth-3"><a class="hlink link-column" href="#column">Column</a>
                      </li>
                      <li class="heading-item -depth-3"><a class="hlink link-breakpoints" href="#breakpoints">Breakpoints</a>
                      </li>
                      <li class="heading-item -depth-3"><a class="hlink link-grid-behaviors" href="#grid-behaviors">Grid behaviors</a>
                      </li>
                    </ul>
                  </li>
                  <li class="menu-item -level-2"><a class="link title  link-visual-font" href="visual-font.html">Fonts</a>
                  </li>
                  <li class="menu-item -level-2 -parent"><span class="title">Icon</span>
                    <ul class="submenu">
                      <li class="menu-item -level-3"><a class="link title  link-contribute" href="contribute.html">Contribute</a>
                      </li>
                    </ul>
                  </li>
                </ul>
              </li>
            </ul>
          </li>
        </ul>
      </div>
      <div class="body page-visual-grid">
        <div class="header-nav">
          <div class="right"><a class="iconlink" href="https://github.com/sankomdesign/guideline" data-title="sankomdesign/guideline">
              <!-- span.title Open in GitHub--><span class="icon -github"></span></a>
          </div>
        </div>
        <div class="markdown-body"><h1 id="grid">Grid</h1>
<p>&#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE0A;&#xE48;&#xE27;&#xE22;&#xE43;&#xE2B;&#xE49;&#xE01;&#xE32;&#xE23;&#xE2D;&#xE2D;&#xE1A;&#xE41;&#xE1A;&#xE1A;&#xE01;&#xE32;&#xE23;&#xE27;&#xE32;&#xE07;&#xE04;&#xE2D;&#xE19;&#xE40;&#xE17;&#xE19;&#xE17;&#xE4C;&#xE15;&#xE48;&#xE32;&#xE07;&#xE46; &#xE25;&#xE07;&#xE44;&#xE1B;&#xE1A;&#xE19;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE08;&#xE2D;&#xE40;&#xE01;&#xE34;&#xE14;&#xE04;&#xE27;&#xE32;&#xE21;&#xE2A;&#xE27;&#xE22;&#xE07;&#xE32;&#xE21;, &#xE40;&#xE1B;&#xE47;&#xE19;&#xE23;&#xE30;&#xE40;&#xE1A;&#xE35;&#xE22;&#xE1A; &#xE41;&#xE25;&#xE30;&#xE07;&#xE48;&#xE32;&#xE22;&#xE15;&#xE48;&#xE2D;&#xE01;&#xE32;&#xE23;&#xE02;&#xE22;&#xE32;&#xE22;&#xE15;&#xE31;&#xE27;&#xE23;&#xE27;&#xE21;&#xE44;&#xE1B;&#xE16;&#xE36;&#xE07;&#xE01;&#xE32;&#xE23;&#xE0B;&#xE48;&#xE2D;&#xE21;&#xE1A;&#xE33;&#xE23;&#xE38;&#xE07; (Expand and Maintainance) &#xE23;&#xE27;&#xE21;&#xE44;&#xE1B;&#xE16;&#xE36;&#xE07;&#xE17;&#xE33;&#xE43;&#xE2B;&#xE49;&#xE04;&#xE2D;&#xE19;&#xE40;&#xE17;&#xE19;&#xE17;&#xE4C; &#xE19;&#xE31;&#xE49;&#xE19;&#xE21;&#xE35;&#xE04;&#xE27;&#xE32;&#xE21;&#xE22;&#xE37;&#xE14;&#xE2B;&#xE22;&#xE38;&#xE48;&#xE19;&#xE23;&#xE2D;&#xE07;&#xE23;&#xE31;&#xE1A;&#xE01;&#xE31;&#xE1A;&#xE17;&#xE38;&#xE01;&#xE46; &#xE02;&#xE19;&#xE32;&#xE14;&#xE02;&#xE2D;&#xE07;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE08;&#xE2D;&#xE17;&#xE35;&#xE48;&#xE40;&#xE1B;&#xE25;&#xE35;&#xE48;&#xE22;&#xE19;&#xE44;&#xE1B;&#xE15;&#xE32;&#xE21;&#xE04;&#xE27;&#xE32;&#xE21;&#xE01;&#xE27;&#xE49;&#xE32;&#xE07;&#xE02;&#xE2D;&#xE07;&#xE2D;&#xE38;&#xE1B;&#xE01;&#xE23;&#xE13;&#xE4C;&#xE17;&#xE35;&#xE48;&#xE43;&#xE0A;&#xE49;&#xE43;&#xE19;&#xE01;&#xE32;&#xE23;&#xE41;&#xE2A;&#xE14;&#xE07;&#xE1C;&#xE25;</p>
<p><img src="images/visual-layout/Layout-Overview.png" alt="01"></p>
<h6 id="1.margin">1.Margin</h6>
<h6 id="2.gutter">2.Gutter</h6>
<h6 id="3.column">3.Column</h6>
<h3 id="column">Column</h3>
<p>&#xE04;&#xE27;&#xE32;&#xE21;&#xE01;&#xE27;&#xE49;&#xE32;&#xE07;&#xE02;&#xE2D;&#xE07;&#xE04;&#xE2D;&#xE25;&#xE31;&#xE21;&#xE04;&#xE27;&#xE23;&#xE01;&#xE33;&#xE2B;&#xE19;&#xE14;&#xE41;&#xE1A;&#xE1A;&#xE22;&#xE37;&#xE14;&#xE2B;&#xE22;&#xE38;&#xE48;&#xE19;&#xE40;&#xE1B;&#xE2D;&#xE23;&#xE4C;&#xE40;&#xE0B;&#xE47;&#xE19;&#xE40;&#xE17;&#xE08; (Percentage) &#xE0B;&#xE36;&#xE48;&#xE07;&#xE14;&#xE35;&#xE01;&#xE27;&#xE48;&#xE32;&#xE01;&#xE32;&#xE23;&#xE01;&#xE33;&#xE2B;&#xE19;&#xE14;&#xE41;&#xE1A;&#xE1A;&#xE04;&#xE48;&#xE32;&#xE04;&#xE07;&#xE17;&#xE35;&#xE48; (Fixed value) &#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE43;&#xE2B;&#xE49;&#xE04;&#xE2D;&#xE19;&#xE40;&#xE17;&#xE19;&#xE17;&#xE4C;&#xE17;&#xE35;&#xE48;&#xE44;&#xE1B;&#xE40;&#xE01;&#xE32;&#xE30;&#xE2D;&#xE22;&#xE39;&#xE48;&#xE01;&#xE31;&#xE1A;&#xE04;&#xE2D;&#xE25;&#xE31;&#xE21;&#xE19;&#xE31;&#xE49;&#xE19;&#xE21;&#xE35;&#xE04;&#xE27;&#xE32;&#xE21;&#xE22;&#xE37;&#xE14;&#xE2B;&#xE22;&#xE38;&#xE48;&#xE19;&#xE23;&#xE2D;&#xE07;&#xE23;&#xE31;&#xE1A;&#xE01;&#xE31;&#xE1A;&#xE02;&#xE19;&#xE32;&#xE14;&#xE04;&#xE27;&#xE32;&#xE21;&#xE01;&#xE27;&#xE49;&#xE32;&#xE07;&#xE02;&#xE2D;&#xE07;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE08;&#xE2D;&#xE41;&#xE2A;&#xE14;&#xE07;&#xE1C;&#xE25;&#xE17;&#xE35;&#xE48;&#xE40;&#xE1B;&#xE25;&#xE35;&#xE48;&#xE22;&#xE19;&#xE44;&#xE1B;</p>
<p>&#xE08;&#xE33;&#xE19;&#xE27;&#xE19;&#xE02;&#xE2D;&#xE07;&#xE04;&#xE2D;&#xE25;&#xE31;&#xE21;&#xE17;&#xE35;&#xE48;&#xE43;&#xE0A;&#xE49;&#xE02;&#xE36;&#xE49;&#xE19;&#xE2D;&#xE22;&#xE39;&#xE48;&#xE01;&#xE31;&#xE1A;&#xE01;&#xE31;&#xE1A;&#xE2D;&#xE38;&#xE1B;&#xE01;&#xE23;&#xE13;&#xE4C; <strong>&#xE21;&#xE37;&#xE2D;&#xE16;&#xE37;&#xE2D;&#xE43;&#xE0A;&#xE49; 4 &#xE04;&#xE2D;&#xE25;&#xE31;&#xE21;,</strong> <strong>&#xE41;&#xE17;&#xE47;&#xE1B;&#xE40;&#xE25;&#xE17; 8 &#xE2B;&#xE23;&#xE37;&#xE2D; 12 &#xE04;&#xE2D;&#xE25;&#xE31;&#xE21;,</strong> <strong>&#xE08;&#xE2D;&#xE04;&#xE2D;&#xE21;&#xE1E;&#xE34;&#xE27;&#xE40;&#xE15;&#xE2D;&#xE23;&#xE4C;&#xE17;&#xE31;&#xE49;&#xE27;&#xE44;&#xE1B; 12 &#xE2B;&#xE23;&#xE37;&#xE2D; 16 &#xE04;&#xE2D;&#xE25;&#xE31;&#xE21;,</strong></p>
<p><img src="images/visual-layout/Desktop.png" alt="01">
<strong>Desktop</strong></p>
<p><img src="images/visual-layout/Tablet.png" alt="01">
<strong>Tablet</strong></p>
<p><img src="images/visual-layout/Mobile.png" alt="01">
<strong>Mobile</strong></p>
<h3 id="breakpoints">Breakpoints</h3>
<table>
<thead>
<tr>
<th>Device</th>
<th>Value</th>
<th>Column</th>
<th>Margin / Gutters</th>
</tr>
</thead>
<tbody>
<tr>
<td>Small</td>
<td>320</td>
<td>4</td>
<td>16</td>
</tr>
<tr>
<td>Medium</td>
<td>672</td>
<td>8</td>
<td>16</td>
</tr>
<tr>
<td>Large</td>
<td>1056</td>
<td>16</td>
<td>24</td>
</tr>
<tr>
<td>Extra large</td>
<td>1312</td>
<td>16</td>
<td>24</td>
</tr>
<tr>
<td>Max</td>
<td>1584</td>
<td>16</td>
<td>24</td>
</tr>
</tbody>
</table>
<h3 id="grid-behaviors">Grid behaviors</h3>
<p>&#xE02;&#xE19;&#xE32;&#xE14;&#xE02;&#xE2D;&#xE07;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE08;&#xE2D;&#xE40;&#xE1B;&#xE25;&#xE35;&#xE48;&#xE22;&#xE19;&#xE41;&#xE1B;&#xE25;&#xE07;&#xE44;&#xE1B;&#xE15;&#xE32;&#xE21;&#xE02;&#xE19;&#xE32;&#xE14;&#xE02;&#xE2D;&#xE07;&#xE2D;&#xE38;&#xE1B;&#xE01;&#xE23;&#xE13;&#xE4C; &#xE2B;&#xE23;&#xE37;&#xE2D;&#xE15;&#xE32;&#xE21;&#xE01;&#xE32;&#xE23;&#xE22;&#xE48;&#xE2D;-&#xE02;&#xE22;&#xE32;&#xE22;&#xE15;&#xE32;&#xE21;&#xE41;&#xE15;&#xE48;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE04;&#xE19;&#xE19;&#xE31;&#xE49;&#xE19;&#xE46;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE01;&#xE32;&#xE23;</p>
<ol>
<li>Fluid columns</li>
<li>Fixed boxes</li>
</ol>
<h5 id="fluid-column">Fluid column</h5>
<p>&#xE01;&#xE32;&#xE23;&#xE41;&#xE1A;&#xE48;&#xE07;&#xE04;&#xE2D;&#xE25;&#xE31;&#xE21;&#xE41;&#xE1A;&#xE1A;&#xE22;&#xE37;&#xE14;&#xE2B;&#xE22;&#xE38;&#xE48;&#xE19;&#xE43;&#xE2B;&#xE49;&#xE04;&#xE27;&#xE32;&#xE21;&#xE2A;&#xE33;&#xE04;&#xE31;&#xE0D;&#xE01;&#xE31;&#xE1A;&#xE02;&#xE19;&#xE32;&#xE14;&#xE21;&#xE32;&#xE01;&#xE01;&#xE27;&#xE48;&#xE32;&#xE08;&#xE33;&#xE19;&#xE27;&#xE19;&#xE02;&#xE2D;&#xE07;&#xE04;&#xE2D;&#xE25;&#xE31;&#xE21;
&#xE17;&#xE35;&#xE48;&#xE02;&#xE19;&#xE32;&#xE14;&#xE02;&#xE2D;&#xE07;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE08;&#xE2D;&#xE43;&#xE14; (Each breakpoint) &#xE43;&#xE2B;&#xE49;&#xE01;&#xE33;&#xE2B;&#xE19;&#xE14;&#xE08;&#xE33;&#xE19;&#xE27;&#xE19;&#xE04;&#xE2D;&#xE25;&#xE31;&#xE21;&#xE15;&#xE32;&#xE21;&#xE17;&#xE35;&#xE48;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE01;&#xE32;&#xE23;&#xE43;&#xE19;&#xE02;&#xE13;&#xE30;&#xE17;&#xE35;&#xE48;&#xE04;&#xE27;&#xE32;&#xE21;&#xE01;&#xE27;&#xE49;&#xE32;&#xE07;&#xE02;&#xE2D;&#xE07;&#xE04;&#xE2D;&#xE25;&#xE31;&#xE21;&#xE19;&#xE31;&#xE49;&#xE19;&#xE40;&#xE1B;&#xE25;&#xE35;&#xE48;&#xE22;&#xE19;&#xE41;&#xE1B;&#xE25;&#xE07;&#xE44;&#xE1B;&#xE15;&#xE32;&#xE21;&#xE04;&#xE27;&#xE32;&#xE21;&#xE01;&#xE27;&#xE49;&#xE32;&#xE07;&#xE02;&#xE2D;&#xE07;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE08;&#xE2D;</p>
<h5 id="fixed-boxes">Fixed Boxes</h5>
<p>&#xE08;&#xE33;&#xE19;&#xE27;&#xE19;&#xE02;&#xE2D;&#xE07;&#xE04;&#xE2D;&#xE25;&#xE31;&#xE21;&#xE40;&#xE1E;&#xE34;&#xE48;&#xE21;&#xE2B;&#xE23;&#xE37;&#xE2D;&#xE25;&#xE14;&#xE15;&#xE32;&#xE21;&#xE04;&#xE27;&#xE32;&#xE21;&#xE01;&#xE27;&#xE49;&#xE32;&#xE07;&#xE02;&#xE2D;&#xE07;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE08;&#xE2D;&#xE43;&#xE19;&#xE02;&#xE13;&#xE30;&#xE17;&#xE35;&#xE48;&#xE04;&#xE27;&#xE32;&#xE21;&#xE01;&#xE27;&#xE49;&#xE32;&#xE07;&#xE02;&#xE2D;&#xE07;&#xE41;&#xE15;&#xE48;&#xE25;&#xE30;&#xE04;&#xE2D;&#xE25;&#xE31;&#xE21;&#xE19;&#xE31;&#xE49;&#xE19;&#xE04;&#xE07;&#xE17;&#xE35;&#xE48;</p>

        </div>
        <div class="footer-nav">
          <div class="left"><a href="visual-color.html"><span class="title">Colors</span></a></div>
          <div class="right"><a href="visual-font.html"><span class="label">Next: </span><span class="title">Fonts</span></a></div>
        </div>
      </div>
    </div>
  </body>
</html>