<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf-8">
    <link rel="stylesheet" href="assets/style.css?t=90051322">
    <link rel="stylesheet" href="https://ricostacruz.com/docpress-rsc/style.css">
    <link rel="stylesheet" href="extra.css?t=5c8ec47c">
    <script src="assets/script.js?t=93f1a66c"></script>
    <title>Theme - Sankom Design</title>
    <meta name="viewport" content="width=device-width">
  </head>
  <body class="-menu-visible">
    <div class="doc-layout">
      <div class="toggle menu-toggle js-menu-toggle"></div>
      <div class="menu toc-menu">
        <ul>
          <li class="menu-item -level-0 -parent">
            <ul class="submenu">
              <li class="menu-item -level-1"><a class="link title  link-index" href="index.html">Sankom Design</a>
              </li>
              <li class="menu-item -level-1"><a class="link title  link-getting-start" href="getting-start.html">Getting Start</a>
              </li>
              <li class="menu-item -level-1"><a class="link title  link-design-principle" href="design-principle.html">Design Principle</a>
              </li>
              <li class="menu-item -level-1 -parent"><span class="title">Guideline</span>
                <ul class="submenu">
                  <li class="menu-item -level-2"><a class="link title  link-guideline-navigation" href="guideline-navigation.html">Navigation</a>
                  </li>
                  <li class="menu-item -level-2"><a class="link title  link-guideline-layout" href="guideline-layout.html">Layout</a>
                  </li>
                  <li class="menu-item -level-2"><a class="link title  link-guideline-element" href="guideline-element.html">Element</a>
                  </li>
                  <li class="menu-item -level-2"><span class="title">Plugin</span>
                  </li>
                  <li class="menu-item -level-2"><span class="title">New Account</span>
                  </li>
                </ul>
              </li>
              <li class="menu-item -level-1 -parent"><span class="title">Visual</span>
                <ul class="submenu">
                  <li class="menu-item -level-2"><a class="link title -active link-visual-color" href="visual-color.html">Theme</a>
                    <ul class="headings heading-list">
                      <li class="heading-item -depth-2"><a class="hlink link-branding-color" href="#branding-color">Branding color</a>
                      </li>
                      <li class="heading-item -depth-2"><a class="hlink link-alternative-color" href="#alternative-color">Alternative color</a>
                      </li>
                      <li class="heading-item -depth-2"><a class="hlink link-interactive-color" href="#interactive-color">Interactive color</a>
                      </li>
                      <li class="heading-item -depth-2"><a class="hlink link-disable-state" href="#disable-state">Disable state</a>
                      </li>
                      <li class="heading-item -depth-2"><a class="hlink link-remove-all-visual-noise" href="#remove-all-visual-noise">Remove all visual noise</a>
                      </li>
                      <li class="heading-item -depth-2"><a class="hlink link-system-message-color" href="#system-message-color">System message color</a>
                      </li>
                      <li class="heading-item -depth-2"><a class="hlink link-language-and-icon" href="#language-and-icon">Language and icon</a>
                      </li>
                      <li class="heading-item -depth-2"><a class="hlink link-color-combination" href="#color-combination">Color combination</a>
                      </li>
                      <li class="heading-item -depth-2"><a class="hlink link-elevation-and-focused-item" href="#elevation-and-focused-item">Elevation and Focused item</a>
                      </li>
                    </ul>
                  </li>
                  <li class="menu-item -level-2"><a class="link title  link-visual-grid" href="visual-grid.html">Grid</a>
                  </li>
                  <li class="menu-item -level-2"><a class="link title  link-visual-font" href="visual-font.html">Fonts</a>
                  </li>
                  <li class="menu-item -level-2 -parent"><span class="title">Icon</span>
                    <ul class="submenu">
                      <li class="menu-item -level-3"><a class="link title  link-contribute" href="contribute.html">Contribute</a>
                      </li>
                    </ul>
                  </li>
                </ul>
              </li>
            </ul>
          </li>
        </ul>
      </div>
      <div class="body page-visual-color">
        <div class="header-nav">
          <div class="right"><a class="iconlink" href="https://github.com/sankomdesign/guideline" data-title="sankomdesign/guideline">
              <!-- span.title Open in GitHub--><span class="icon -github"></span></a>
          </div>
        </div>
        <div class="markdown-body"><h1 id="colors">Colors</h1>
<p>&#xE2A;&#xE35;&#xE17;&#xE35;&#xE48;&#xE19;&#xE33;&#xE21;&#xE32;&#xE43;&#xE0A;&#xE49;&#xE2A;&#xE23;&#xE49;&#xE32;&#xE07; User interface &#xE44;&#xE21;&#xE48;&#xE40;&#xE1E;&#xE35;&#xE22;&#xE07;&#xE41;&#xE04;&#xE48;&#xE2A;&#xE37;&#xE48;&#xE2D;&#xE2A;&#xE32;&#xE23;&#xE14;&#xE49;&#xE32;&#xE19;&#xE04;&#xE27;&#xE32;&#xE21;&#xE2A;&#xE27;&#xE22;&#xE07;&#xE32;&#xE19;&#xE41;&#xE25;&#xE30; Branding &#xE40;&#xE17;&#xE48;&#xE32;&#xE19;&#xE31;&#xE49;&#xE19; &#xE41;&#xE15;&#xE48;&#xE22;&#xE31;&#xE07;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE2A;&#xE37;&#xE2D;&#xE2A;&#xE32;&#xE23;&#xE04;&#xE27;&#xE32;&#xE21;&#xE2B;&#xE21;&#xE32;&#xE22;&#xE1E;&#xE34;&#xE40;&#xE28;&#xE29;&#xE1A;&#xE32;&#xE07;&#xE2D;&#xE22;&#xE48;&#xE32;&#xE07;&#xE17;&#xE35;&#xE48;&#xE21;&#xE35;&#xE04;&#xE27;&#xE32;&#xE21;&#xE40;&#xE01;&#xE35;&#xE48;&#xE22;&#xE27;&#xE02;&#xE49;&#xE2D;&#xE07;&#xE01;&#xE31;&#xE1A;&#xE40;&#xE2B;&#xE15;&#xE38;&#xE01;&#xE32;&#xE23;&#xE13;&#xE4C;&#xE17;&#xE35;&#xE48;&#xE21;&#xE35;&#xE1C;&#xE25;&#xE01;&#xE23;&#xE30;&#xE17;&#xE1A;&#xE42;&#xE14;&#xE22;&#xE15;&#xE23;&#xE07;&#xE01;&#xE31;&#xE1A;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE43;&#xE19;&#xE02;&#xE13;&#xE30;&#xE19;&#xE31;&#xE49;&#xE19;&#xE14;&#xE49;&#xE27;&#xE22;</p>
<h2 id="branding-color">Branding color</h2>
<p><img src="images/visual-color/theme-primary.png" alt="Branding"></p>
<p>&#xE0A;&#xE38;&#xE14;&#xE2A;&#xE35;&#xE2B;&#xE25;&#xE31;&#xE01;&#xE19;&#xE33;&#xE44;&#xE1B;&#xE43;&#xE0A;&#xE49;&#xE1B;&#xE23;&#xE30;&#xE01;&#xE2D;&#xE1A;&#xE40;&#xE1B;&#xE47;&#xE19; User interface &#xE42;&#xE14;&#xE22;&#xE19;&#xE33;&#xE44;&#xE1B;&#xE43;&#xE0A;&#xE49;&#xE2A;&#xE23;&#xE49;&#xE32;&#xE07; UI element &#xE15;&#xE48;&#xE32;&#xE07;&#xE46;</p>
<p><strong>1. Application background</strong></p>
<p><strong>2. Panel</strong></p>
<p><strong>3. Call-to-action button</strong></p>
<p><strong>4. interactive element</strong></p>
<h2 id="alternative-color">Alternative color</h2>
<p>&#xE40;&#xE21;&#xE37;&#xE37;&#xE48;&#xE2D;&#xE41;&#xE2D;&#xE4A;&#xE1B;&#xE1F;&#xE25;&#xE34;&#xE40;&#xE04;&#xE0A;&#xE31;&#xE48;&#xE19;&#xE21;&#xE35;&#xE04;&#xE27;&#xE32;&#xE21;&#xE0B;&#xE31;&#xE1A;&#xE0B;&#xE49;&#xE2D;&#xE19;&#xE21;&#xE32;&#xE01;&#xE02;&#xE36;&#xE49;&#xE19; &#xE08;&#xE33;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE43;&#xE0A;&#xE49;&#xE2D;&#xE37;&#xE48;&#xE19;&#xE46;&#xE19;&#xE2D;&#xE01;&#xE40;&#xE2B;&#xE19;&#xE37;&#xE2D;&#xE08;&#xE32;&#xE01;&#xE2A;&#xE35; branding &#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE41;&#xE22;&#xE01; Ui element &#xE17;&#xE35;&#xE48;&#xE17;&#xE33;&#xE07;&#xE32;&#xE19;&#xE15;&#xE48;&#xE32;&#xE07;&#xE01;&#xE31;&#xE19;&#xE2D;&#xE2D;&#xE01;&#xE08;&#xE32;&#xE01;&#xE01;&#xE31;&#xE19;</p>
<p><img src="images/visual-color/theme-alternative-color01.png" alt="Branding">
<img src="images/visual-color/theme-alternative-color02.png" alt="Branding"></p>
<h2 id="interactive-color">Interactive color</h2>
<h4 id><strong>&#xE40;&#xE1E;&#xE35;&#xE22;&#xE07;&#xE41;&#xE04;&#xE48;&#xE01;&#xE27;&#xE32;&#xE14;&#xE15;&#xE32;&#xE21;&#xE2D;&#xE07; &#xE23;&#xE39;&#xE49;&#xE27;&#xE48;&#xE32;&#xE15;&#xE23;&#xE07;&#xE43;&#xE2B;&#xE19;&#xE01;&#xE14;&#xE44;&#xE14;&#xE49;</strong></h4>
<p>&#xE01;&#xE32;&#xE23;&#xE41;&#xE22;&#xE01; interactive item &#xE2D;&#xE2D;&#xE01;&#xE08;&#xE32;&#xE01;&#xE02;&#xE49;&#xE2D;&#xE21;&#xE39;&#xE25;&#xE41;&#xE2A;&#xE14;&#xE07;&#xE1C;&#xE25;&#xE44;&#xE14;&#xE49;&#xE2D;&#xE22;&#xE48;&#xE32;&#xE07;&#xE23;&#xE27;&#xE14;&#xE40;&#xE23;&#xE47;&#xE27; &#xE0A;&#xE48;&#xE27;&#xE22;&#xE40;&#xE1E;&#xE34;&#xE48;&#xE21;&#xE1B;&#xE23;&#xE30;&#xE2A;&#xE34;&#xE17;&#xE18;&#xE34;&#xE20;&#xE32;&#xE1E;&#xE43;&#xE19;&#xE01;&#xE32;&#xE23;&#xE17;&#xE33;&#xE07;&#xE32;&#xE19;&#xE43;&#xE2B;&#xE49;&#xE01;&#xE31;&#xE1A;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;
&#xE19;&#xE2D;&#xE01;&#xE08;&#xE32;&#xE01;&#xE23;&#xE39;&#xE1B;&#xE23;&#xE48;&#xE32;&#xE07;&#xE23;&#xE39;&#xE1B;&#xE17;&#xE23;&#xE07;&#xE17;&#xE35;&#xE48;&#xE14;&#xE39;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE1B;&#xE38;&#xE48;&#xE21;&#xE41;&#xE25;&#xE49;&#xE27; &#xE2A;&#xE35;&#xE01;&#xE47;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE2D;&#xE35;&#xE01;&#xE2A;&#xE34;&#xE48;&#xE07;&#xE2B;&#xE19;&#xE36;&#xE48;&#xE07;&#xE17;&#xE35;&#xE48;&#xE2A;&#xE32;&#xE21;&#xE32;&#xE23;&#xE16;&#xE41;&#xE22;&#xE01;&#xE17;&#xE31;&#xE49;&#xE07;&#xE2A;&#xE2D;&#xE07;&#xE2A;&#xE34;&#xE48;&#xE07;&#xE2D;&#xE2D;&#xE01;&#xE08;&#xE32;&#xE01;&#xE01;&#xE31;&#xE19;&#xE44;&#xE14;&#xE49;</p>
<p><img src="images/visual-color/theme-interactiveItem.png" alt="Branding"></p>
<h2 id="disable-state">Disable state</h2>
<h4 id><strong>&#xE1B;&#xE0E;&#xE34;&#xE2A;&#xE31;&#xE21;&#xE1E;&#xE31;&#xE19;&#xE18;&#xE4C;&#xE44;&#xE21;&#xE48;&#xE44;&#xE14;&#xE49; &#xE44;&#xE21;&#xE48;&#xE43;&#xE0A;&#xE48;&#xE2A;&#xE35;&#xE40;&#xE17;&#xE32;</strong></h4>
<p>&#xE1A;&#xE32;&#xE07;&#xE42;&#xE2D;&#xE01;&#xE32;&#xE2A;&#xE41;&#xE2D;&#xE4A;&#xE1B;&#xE1F;&#xE25;&#xE34;&#xE40;&#xE04;&#xE0A;&#xE31;&#xE48;&#xE19;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE01;&#xE32;&#xE23;&#xE1B;&#xE38;&#xE48;&#xE21;&#xE16;&#xE36;&#xE07; 3-4 &#xE25;&#xE31;&#xE01;&#xE29;&#xE13;&#xE30; (Primary / Secondary / Tertiary / Ghost ) &#xE01;&#xE32;&#xE23;&#xE01;&#xE33;&#xE2B;&#xE19;&#xE14;&#xE43;&#xE2B;&#xE49;&#xE1B;&#xE38;&#xE48;&#xE21;&#xE17;&#xE35;&#xE48;&#xE44;&#xE21;&#xE48;&#xE2A;&#xE32;&#xE21;&#xE32;&#xE23;&#xE16;&#xE01;&#xE14;&#xE44;&#xE14;&#xE49;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE2A;&#xE35;&#xE40;&#xE17;&#xE32; &#xE2D;&#xE32;&#xE08;&#xE17;&#xE33;&#xE43;&#xE2B;&#xE49;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE41;&#xE22;&#xE01;&#xE44;&#xE21;&#xE48;&#xE2D;&#xE2D;&#xE01;&#xE23;&#xE30;&#xE2B;&#xE27;&#xE48;&#xE32;&#xE07;&#xE1B;&#xE38;&#xE48;&#xE21;&#xE1B;&#xE01;&#xE15;&#xE34;&#xE17;&#xE35;&#xE48;&#xE16;&#xE39;&#xE01;&#xE01;&#xE33;&#xE2B;&#xE19;&#xE14;&#xE43;&#xE2B;&#xE49;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE2A;&#xE35;&#xE40;&#xE17;&#xE32;&#xE01;&#xE31;&#xE1A;&#xE1B;&#xE38;&#xE48;&#xE21;&#xE17;&#xE35;&#xE48;&#xE01;&#xE14;&#xE44;&#xE21;&#xE48;&#xE44;&#xE14;&#xE49;</p>
<p><img src="images/visual-color/theme-disableState1.png" alt="Branding"></p>
<p>&#xE1B;&#xE38;&#xE48;&#xE21;&#xE2A;&#xE35;&#xE40;&#xE17;&#xE32;&#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE2D;&#xE22;&#xE39;&#xE48;&#xE40;&#xE1E;&#xE35;&#xE22;&#xE07;&#xE25;&#xE33;&#xE1E;&#xE31;&#xE07; &#xE22;&#xE32;&#xE01;&#xE17;&#xE35;&#xE48;&#xE08;&#xE30;&#xE04;&#xE32;&#xE14;&#xE40;&#xE14;&#xE32;&#xE44;&#xE14;&#xE49;&#xE27;&#xE48;&#xE32;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE1B;&#xE38;&#xE48;&#xE21; Active &#xE2B;&#xE23;&#xE37;&#xE2D; Disable</p>
<p><img src="images/visual-color/theme-disableState2.png" alt="Branding"></p>
<p>&#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE01;&#xE32;&#xE23;&#xE43;&#xE2B;&#xE49; ui element &#xE43;&#xE14;&#xE46;&#xE14;&#xE39;&#xE44;&#xE21;&#xE48;&#xE2A;&#xE32;&#xE21;&#xE32;&#xE23;&#xE16;&#xE21;&#xE35;&#xE1B;&#xE0E;&#xE34;&#xE2A;&#xE31;&#xE21;&#xE1E;&#xE31;&#xE19;&#xE18;&#xE4C;&#xE44;&#xE14;&#xE49;&#xE43;&#xE2B;&#xE49;&#xE25;&#xE14; Opacity &#xE25;&#xE07;&#xE40;&#xE2B;&#xE25;&#xE37;&#xE2D; 30%</p>
<p><img src="images/visual-color/theme-disableState3.png" alt="Branding"></p>
<p>&#xE2B;&#xE32;&#xE01;&#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE2A;&#xE35;&#xE02;&#xE2D;&#xE07;&#xE1E;&#xE37;&#xE49;&#xE19;&#xE2B;&#xE25;&#xE31;&#xE07;&#xE19;&#xE31;&#xE49;&#xE19;&#xE40;&#xE1B;&#xE25;&#xE35;&#xE48;&#xE22;&#xE19;&#xE44;&#xE1B; &#xE40;&#xE23;&#xE32;&#xE01;&#xE47;&#xE44;&#xE21;&#xE48;&#xE08;&#xE33;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE01;&#xE33;&#xE2B;&#xE19;&#xE14;&#xE2A;&#xE35;&#xE02;&#xE2D;&#xE07;&#xE1B;&#xE38;&#xE48;&#xE21; Disable &#xE43;&#xE2B;&#xE21;&#xE48;&#xE40;&#xE1E;&#xE23;&#xE32;&#xE30;&#xE27;&#xE48;&#xE32;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE15;&#xE32;&#xE02;&#xE2D;&#xE07;&#xE1B;&#xE38;&#xE48;&#xE21; Disable 30% Opacity &#xE22;&#xE31;&#xE07;&#xE04;&#xE07;&#xE14;&#xE39;&#xE40;&#xE2B;&#xE21;&#xE37;&#xE2D;&#xE19;&#xE01;&#xE14;&#xE44;&#xE21;&#xE48;&#xE44;&#xE14;&#xE49;&#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE21;&#xE2D;&#xE07;&#xE1C;&#xE48;&#xE32;&#xE19;&#xE46;</p>
<h2 id="remove-all-visual-noise">Remove all visual noise</h2>
<h4 id><strong>&#xE01;&#xE32;&#xE23;&#xE41;&#xE1A;&#xE48;&#xE07;&#xE40;&#xE19;&#xE37;&#xE49;&#xE2D;&#xE2B;&#xE32;&#xE2D;&#xE2D;&#xE01;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE2A;&#xE48;&#xE27;&#xE19;&#xE46;</strong></h4>
<p>&#xE01;&#xE32;&#xE23;&#xE43;&#xE0A;&#xE49; Contrast &#xE40;&#xE1E;&#xE35;&#xE22;&#xE07;&#xE40;&#xE25;&#xE47;&#xE01;&#xE19;&#xE49;&#xE2D;&#xE22;&#xE01;&#xE47;&#xE2A;&#xE32;&#xE21;&#xE32;&#xE23;&#xE16;&#xE41;&#xE22;&#xE01;&#xE40;&#xE19;&#xE37;&#xE49;&#xE2D;&#xE2B;&#xE32;&#xE2D;&#xE2D;&#xE01;&#xE08;&#xE32;&#xE01;&#xE01;&#xE31;&#xE19;&#xE44;&#xE14;&#xE49;&#xE41;&#xE25;&#xE49;&#xE27; &#xE43;&#xE2B;&#xE49;&#xE40;&#xE01;&#xE47;&#xE1A; High contrast &#xE44;&#xE27;&#xE49;&#xE01;&#xE31;&#xE1A;&#xE2A;&#xE48;&#xE27;&#xE19;&#xE02;&#xE2D;&#xE07;&#xE40;&#xE19;&#xE37;&#xE49;&#xE2D;&#xE2B;&#xE32;&#xE17;&#xE35;&#xE48;&#xE2A;&#xE33;&#xE04;&#xE31;&#xE0D;&#xE2B;&#xE23;&#xE37;&#xE2D;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE01;&#xE32;&#xE23;&#xE40;&#xE23;&#xE35;&#xE22;&#xE01;&#xE23;&#xE49;&#xE2D;&#xE07;&#xE04;&#xE27;&#xE32;&#xE21;&#xE2A;&#xE19;&#xE43;&#xE08;&#xE02;&#xE2D;&#xE07;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;</p>
<p><img src="images/visual-color/theme-visualNoise1.png" alt="Branding"></p>
<h2 id="system-message-color">System message color</h2>
<p><img src="images/visual-color/theme-systemMessage.png" alt="Branding"></p>
<p>&#xE0A;&#xE38;&#xE14;&#xE2A;&#xE35;&#xE15;&#xE48;&#xE2D;&#xE44;&#xE1B;&#xE19;&#xE35;&#xE49;&#xE02;&#xE2D;&#xE43;&#xE2B;&#xE49;&#xE40;&#xE01;&#xE47;&#xE1A;&#xE44;&#xE27;&#xE49;&#xE40;&#xE09;&#xE1E;&#xE32;&#xE30;&#xE41;&#xE2A;&#xE14;&#xE07;&#xE02;&#xE49;&#xE2D;&#xE04;&#xE27;&#xE32;&#xE21;&#xE17;&#xE35;&#xE48;&#xE15;&#xE2D;&#xE1A;&#xE23;&#xE31;&#xE1A;&#xE08;&#xE32;&#xE01;&#xE23;&#xE30;&#xE1A;&#xE1A;</p>
<p><strong>1. Notification / &#xE02;&#xE49;&#xE2D;&#xE04;&#xE27;&#xE32;&#xE21;&#xE1A;&#xE2D;&#xE01;&#xE40;&#xE25;&#xE48;&#xE32;</strong></p>
<p><strong>2. Danger / &#xE02;&#xE49;&#xE2D;&#xE04;&#xE27;&#xE32;&#xE21;&#xE2D;&#xE31;&#xE19;&#xE15;&#xE23;&#xE32;&#xE22;</strong></p>
<p><strong>3. Warning / &#xE02;&#xE49;&#xE2D;&#xE04;&#xE27;&#xE32;&#xE21;&#xE40;&#xE15;&#xE37;&#xE2D;&#xE19;</strong></p>
<p><strong>4. Accept / &#xE02;&#xE49;&#xE2D;&#xE04;&#xE27;&#xE32;&#xE21;&#xE15;&#xE2D;&#xE1A;&#xE23;&#xE31;&#xE1A;</strong></p>
<h2 id="language-and-icon">Language and icon</h2>
<p>&#xE44;&#xE21;&#xE48;&#xE43;&#xE0A;&#xE48;&#xE40;&#xE1E;&#xE35;&#xE22;&#xE07;&#xE41;&#xE04;&#xE48;&#xE01;&#xE32;&#xE23;&#xE01;&#xE33;&#xE2B;&#xE19;&#xE14;&#xE23;&#xE39;&#xE1B;&#xE23;&#xE48;&#xE32;&#xE07;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE15;&#xE32;&#xE41;&#xE25;&#xE30;&#xE2A;&#xE35;&#xE2A;&#xE31;&#xE19;&#xE02;&#xE2D;&#xE07; Ui element &#xE40;&#xE17;&#xE48;&#xE32;&#xE19;&#xE31;&#xE49;&#xE19; &#xE41;&#xE15;&#xE48;&#xE23;&#xE27;&#xE21;&#xE44;&#xE1B;&#xE16;&#xE36;&#xE07;&#xE2A;&#xE44;&#xE15;&#xE25;&#xE4C;&#xE41;&#xE25;&#xE30;&#xE40;&#xE19;&#xE37;&#xE49;&#xE2D;&#xE2B;&#xE32;&#xE02;&#xE2D;&#xE07;&#xE23;&#xE39;&#xE1B;&#xE20;&#xE32;&#xE1E;,&#xE44;&#xE2D;&#xE04;&#xE2D;&#xE19;&#xE41;&#xE25;&#xE30;&#xE20;&#xE32;&#xE29;&#xE32;&#xE04;&#xE33;&#xE28;&#xE31;&#xE1E;&#xE17;&#xE4C;&#xE17;&#xE35;&#xE48;&#xE0A;&#xE48;&#xE27;&#xE22;&#xE40;&#xE1E;&#xE34;&#xE48;&#xE21;&#xE1B;&#xE23;&#xE30;&#xE2A;&#xE34;&#xE17;&#xE18;&#xE34;&#xE20;&#xE32;&#xE1E;&#xE01;&#xE32;&#xE23;&#xE2A;&#xE37;&#xE48;&#xE2D;&#xE2A;&#xE32;&#xE23;&#xE23;&#xE30;&#xE2B;&#xE27;&#xE48;&#xE32;&#xE07;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE01;&#xE31;&#xE1A;&#xE23;&#xE30;&#xE1A;&#xE1A;</p>
<h4 id><strong>&#xE43;&#xE0A;&#xE49;&#xE20;&#xE32;&#xE29;&#xE32;&#xE17;&#xE35;&#xE48;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE04;&#xE38;&#xE49;&#xE19;&#xE40;&#xE04;&#xE22;&#xE41;&#xE25;&#xE30;&#xE40;&#xE02;&#xE49;&#xE32;&#xE43;&#xE08;&#xE07;&#xE48;&#xE32;&#xE22;</strong></h4>
<p>&#xE04;&#xE33;&#xE28;&#xE31;&#xE1E;&#xE17;&#xE4C;&#xE48;&#xE17;&#xE35;&#xE48;&#xE43;&#xE0A;&#xE49;&#xE1A;&#xE19;&#xE41;&#xE2D;&#xE47;&#xE1B;&#xE1F;&#xE25;&#xE34;&#xE40;&#xE04;&#xE0A;&#xE31;&#xE48;&#xE19;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE04;&#xE33;&#xE28;&#xE31;&#xE1E;&#xE17;&#xE4C;&#xE17;&#xE35;&#xE48;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE40;&#xE02;&#xE49;&#xE32;&#xE43;&#xE08;&#xE44;&#xE14;&#xE49;&#xE07;&#xE48;&#xE32;&#xE22;,&#xE2A;&#xE31;&#xE49;&#xE19;&#xE01;&#xE23;&#xE30;&#xE0A;&#xE31;&#xE1A;&#xE41;&#xE25;&#xE30;&#xE04;&#xE38;&#xE49;&#xE19;&#xE40;&#xE04;&#xE22;&#xE2D;&#xE22;&#xE39;&#xE48;&#xE41;&#xE25;&#xE49;&#xE27; &#xE23;&#xE27;&#xE21;&#xE44;&#xE1B;&#xE16;&#xE36;&#xE07;&#xE02;&#xE49;&#xE2D;&#xE04;&#xE27;&#xE32;&#xE21;&#xE15;&#xE48;&#xE32;&#xE07;&#xE46;&#xE17;&#xE35;&#xE48;&#xE2A;&#xE37;&#xE48;&#xE2D;&#xE2A;&#xE32;&#xE23;&#xE23;&#xE30;&#xE2B;&#xE27;&#xE48;&#xE32;&#xE07;&#xE23;&#xE30;&#xE1A;&#xE1A;&#xE01;&#xE31;&#xE1A;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19; &#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE40;&#xE01;&#xE34;&#xE14;&#xE04;&#xE27;&#xE32;&#xE21;&#xE1C;&#xE34;&#xE14;&#xE1E;&#xE25;&#xE32;&#xE14; &#xE02;&#xE49;&#xE2D;&#xE04;&#xE27;&#xE32;&#xE21;&#xE1C;&#xE34;&#xE14;&#xE1E;&#xE25;&#xE32;&#xE14;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE1A;&#xE2D;&#xE01;&#xE2A;&#xE32;&#xE40;&#xE2B;&#xE15;&#xE38;&#xE1E;&#xE23;&#xE49;&#xE2D;&#xE21;&#xE41;&#xE19;&#xE27;&#xE17;&#xE32;&#xE07;&#xE27;&#xE34;&#xE18;&#xE35;&#xE01;&#xE32;&#xE23;&#xE41;&#xE01;&#xE49;&#xE44;&#xE02;</p>
<p><img src="images/visual-color/theme-message01.png" alt="Branding">
<img src="images/visual-color/theme-message02.png" alt="Branding">
<img src="images/visual-color/theme-message03.png" alt="Branding"></p>
<h4 id><strong>&#xE14;&#xE39;&#xE21;&#xE35;&#xE0A;&#xE35;&#xE27;&#xE34;&#xE15;&#xE0A;&#xE35;&#xE27;&#xE32;</strong></h4>
<p>&#xE01;&#xE32;&#xE23;&#xE44;&#xE2D;&#xE04;&#xE2D;&#xE19;&#xE41;&#xE25;&#xE30;&#xE20;&#xE32;&#xE1E;&#xE1B;&#xE23;&#xE30;&#xE01;&#xE2D;&#xE1A;&#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE2A;&#xE37;&#xE48;&#xE2D;&#xE04;&#xE27;&#xE32;&#xE21;&#xE2B;&#xE21;&#xE32;&#xE22;&#xE15;&#xE48;&#xE32;&#xE07;&#xE46;&#xE20;&#xE32;&#xE22;&#xE43;&#xE19;&#xE41;&#xE2D;&#xE4A;&#xE1B;&#xE1F;&#xE25;&#xE34;&#xE40;&#xE04;&#xE0A;&#xE31;&#xE48;&#xE19;&#xE19;&#xE2D;&#xE01;&#xE08;&#xE32;&#xE01;&#xE0A;&#xE48;&#xE27;&#xE22;&#xE40;&#xE1E;&#xE34;&#xE48;&#xE21;&#xE1B;&#xE23;&#xE30;&#xE2A;&#xE34;&#xE17;&#xE18;&#xE34;&#xE20;&#xE32;&#xE1E;&#xE01;&#xE32;&#xE23;&#xE2A;&#xE37;&#xE48;&#xE2D;&#xE2A;&#xE32;&#xE23;&#xE23;&#xE30;&#xE2B;&#xE27;&#xE48;&#xE32;&#xE07;&#xE23;&#xE30;&#xE1A;&#xE1A;&#xE01;&#xE31;&#xE1A;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE41;&#xE25;&#xE49;&#xE27; &#xE22;&#xE31;&#xE07;&#xE17;&#xE33;&#xE43;&#xE2B;&#xE49;&#xE41;&#xE2D;&#xE47;&#xE1B;&#xE1F;&#xE25;&#xE34;&#xE40;&#xE04;&#xE0A;&#xE31;&#xE48;&#xE19;&#xE14;&#xE39;&#xE21;&#xE35;&#xE0A;&#xE35;&#xE27;&#xE34;&#xE15;&#xE0A;&#xE35;&#xE27;&#xE32;&#xE41;&#xE25;&#xE30;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE21;&#xE34;&#xE15;&#xE23;&#xE01;&#xE31;&#xE1A;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE21;&#xE32;&#xE01;&#xE02;&#xE36;&#xE49;&#xE19;</p>
<p><a href="https://sansirimail-my.sharepoint.com/:f:/g/personal/suralertj_sansiri_com/EmSU2FCFGdBIi8s8wtIIjtIBRBRDaghXjJO1zpxdUWwVSw?e=zaU8gN">Download icon</a></p>
<p><img src="images/visual-color/theme-icon03.png" alt="Branding"></p>
<p><img src="images/visual-color/theme-icon04.png" alt="Branding"></p>
<p><img src="images/visual-color/theme-icon05.png" alt="Branding"></p>
<p><img src="images/visual-color/theme-icon02.png" alt="Branding"></p>
<p><img src="images/visual-color/theme-icon01.png" alt="Branding"></p>
<h4 id="application"><strong>Application &#xE2A;&#xE32;&#xE21;&#xE32;&#xE23;&#xE16;&#xE2D;&#xE18;&#xE34;&#xE1A;&#xE32;&#xE22;&#xE15;&#xE31;&#xE27;&#xE40;&#xE2D;&#xE07;&#xE44;&#xE14;&#xE49;</strong></h4>
<p>&#xE0A;&#xE48;&#xE27;&#xE22;&#xE2D;&#xE18;&#xE34;&#xE1A;&#xE32;&#xE22;&#xE23;&#xE30;&#xE1A;&#xE1A;&#xE43;&#xE2B;&#xE49;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE44;&#xE14;&#xE49;&#xE23;&#xE39;&#xE49;&#xE44;&#xE14;&#xE49;&#xE2D;&#xE22;&#xE48;&#xE32;&#xE07;&#xE23;&#xE27;&#xE14;&#xE40;&#xE23;&#xE47;&#xE27;&#xE44;&#xE21;&#xE48;&#xE1C;&#xE34;&#xE14;&#xE1E;&#xE25;&#xE32;&#xE14;&#xE2B;&#xE23;&#xE37;&#xE2D;&#xE17;&#xE33;&#xE43;&#xE2B;&#xE49;&#xE40;&#xE01;&#xE34;&#xE14;&#xE01;&#xE32;&#xE23;&#xE40;&#xE02;&#xE49;&#xE32;&#xE43;&#xE08;&#xE1C;&#xE34;&#xE14;</p>
<p><img src="images/visual-color/theme-intuitive01.png" alt="Branding"></p>
<p><strong>1. Low contrast container</strong>
&#xE23;&#xE30;&#xE2B;&#xE27;&#xE48;&#xE32;&#xE07;&#xE2A;&#xE35;&#xE1E;&#xE37;&#xE49;&#xE19;&#xE2B;&#xE25;&#xE31;&#xE07;&#xE41;&#xE25;&#xE30;&#xE2A;&#xE35;&#xE02;&#xE2D;&#xE07; Container &#xE17;&#xE35;&#xE48;&#xE21;&#xE35;&#xE04;&#xE27;&#xE32;&#xE21;&#xE41;&#xE15;&#xE01;&#xE15;&#xE48;&#xE32;&#xE07;&#xE19;&#xE49;&#xE2D;&#xE22;&#xE40;&#xE1B;&#xE34;&#xE14;&#xE42;&#xE2D;&#xE01;&#xE32;&#xE28;&#xE43;&#xE2B;&#xE49; UI Element &#xE15;&#xE31;&#xE27;&#xE2D;&#xE37;&#xE48;&#xE19;&#xE46;&#xE42;&#xE14;&#xE14;&#xE40;&#xE14;&#xE48;&#xE19;&#xE15;&#xE32;&#xE21;&#xE1A;&#xE17;&#xE1A;&#xE32;&#xE17;&#xE02;&#xE2D;&#xE07;&#xE15;&#xE31;&#xE27;&#xE40;&#xE2D;&#xE07;&#xE15;&#xE32;&#xE21;&#xE17;&#xE35;&#xE48;&#xE44;&#xE14;&#xE49;&#xE16;&#xE39;&#xE01;&#xE2D;&#xE2D;&#xE01;&#xE41;&#xE1A;&#xE1A;&#xE44;&#xE27;&#xE49;</p>
<p><strong>2. Disable state</strong> &#xE22;&#xE31;&#xE07;&#xE14;&#xE39;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE0A;&#xE48;&#xE2D;&#xE07;&#xE01;&#xE23;&#xE2D;&#xE01;&#xE41;&#xE15;&#xE48;&#xE44;&#xE21;&#xE48;&#xE2A;&#xE32;&#xE21;&#xE32;&#xE23;&#xE16;&#xE21;&#xE35;&#xE1B;&#xE0E;&#xE34;&#xE2A;&#xE31;&#xE21;&#xE1E;&#xE31;&#xE19;&#xE18;&#xE4C;&#xE44;&#xE14;&#xE49;</p>
<p><strong>3. Error state</strong> &#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE40;&#xE01;&#xE34;&#xE14;&#xE04;&#xE27;&#xE32;&#xE21;&#xE1C;&#xE34;&#xE14;&#xE1E;&#xE25;&#xE32;&#xE14; &#xE1A;&#xE2D;&#xE01;&#xE0A;&#xE31;&#xE14;&#xE40;&#xE08;&#xE19;&#xE27;&#xE48;&#xE32;&#xE1C;&#xE34;&#xE14;&#xE1C;&#xE25;&#xE32;&#xE14;&#xE15;&#xE23;&#xE07;&#xE43;&#xE2B;&#xE19;&#xE41;&#xE25;&#xE30;&#xE2D;&#xE22;&#xE48;&#xE32;&#xE07;&#xE44;&#xE23;</p>
<p><strong>4. Empty UI element</strong> &#xE0A;&#xE48;&#xE2D;&#xE07;&#xE01;&#xE23;&#xE2D;&#xE01;&#xE17;&#xE35;&#xE48;&#xE23;&#xE2D;&#xE43;&#xE2B;&#xE49;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE01;&#xE23;&#xE2D;&#xE01;&#xE04;&#xE27;&#xE23;&#xE08;&#xE30;&#xE14;&#xE39;&#xE27;&#xE48;&#xE32;&#xE07;&#xE40;&#xE1B;&#xE25;&#xE48;&#xE32;</p>
<h4 id><strong>&#xE15;&#xE49;&#xE2D;&#xE07;&#xE0A;&#xE48;&#xE27;&#xE22;&#xE43;&#xE2B;&#xE49;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE14;&#xE39;&#xE20;&#xE32;&#xE1E;&#xE23;&#xE27;&#xE21;, &#xE41;&#xE19;&#xE27;&#xE42;&#xE19;&#xE49;&#xE21;, &#xE40;&#xE1B;&#xE23;&#xE35;&#xE22;&#xE1A;&#xE40;&#xE17;&#xE35;&#xE22;&#xE1A;&#xE02;&#xE2D;&#xE07;&#xE0A;&#xE38;&#xE14;&#xE02;&#xE49;&#xE2D;&#xE21;&#xE39;&#xE25;&#xE44;&#xE14;&#xE49;&#xE07;&#xE48;&#xE32;&#xE22;</strong></h4>
<p>&#xE20;&#xE32;&#xE1E;&#xE23;&#xE27;&#xE21;&#xE02;&#xE2D;&#xE07; UI Element &#xE15;&#xE49;&#xE2D;&#xE07;&#xE0A;&#xE48;&#xE27;&#xE22;&#xE43;&#xE2B;&#xE49;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE40;&#xE02;&#xE49;&#xE32;&#xE16;&#xE36;&#xE07;&#xE41;&#xE25;&#xE30;&#xE41;&#xE1B;&#xE25;&#xE04;&#xE27;&#xE32;&#xE21;&#xE2B;&#xE21;&#xE32;&#xE22;&#xE44;&#xE1B;&#xE43;&#xE19;&#xE17;&#xE32;&#xE07;&#xE2A;&#xE23;&#xE38;&#xE1B;&#xE20;&#xE32;&#xE1E;&#xE23;&#xE27;&#xE21;&#xE44;&#xE14;&#xE49; &#xE41;&#xE19;&#xE27;&#xE42;&#xE19;&#xE49;&#xE21;&#xE17;&#xE35;&#xE48;&#xE40;&#xE1B;&#xE25;&#xE37;&#xE48;&#xE22;&#xE19;&#xE41;&#xE1B;&#xE25;&#xE07;&#xE44;&#xE1B; &#xE41;&#xE25;&#xE30;&#xE40;&#xE1B;&#xE23;&#xE35;&#xE22;&#xE1A;&#xE40;&#xE17;&#xE35;&#xE22;&#xE1A;&#xE23;&#xE30;&#xE2B;&#xE27;&#xE48;&#xE32;&#xE07;&#xE0A;&#xE38;&#xE14;&#xE02;&#xE49;&#xE2D;&#xE21;&#xE39;&#xE25;&#xE44;&#xE14;&#xE49;&#xE21;&#xE35;&#xE1B;&#xE23;&#xE30;&#xE2A;&#xE34;&#xE17;&#xE18;&#xE34;&#xE20;&#xE32;&#xE1E;</p>
<h2 id="color-combination">Color combination</h2>
<h4 id="bright-theme"><strong>Bright theme</strong></h4>
<p><img src="images/visual-color/theme-colorCom01.png" alt="Branding"></p>
<h4 id="dark-theme"><strong>Dark theme</strong></h4>
<p><img src="images/visual-color/theme-colorCom02.png" alt="Branding"></p>
<p><img src="images/visual-color/color-LightTheme05.jpg" alt="Branding">
<img src="images/visual-color/color-LightTheme09.png" alt="Branding"></p>
<h4 id="hybrid-theme"><strong>Hybrid theme</strong></h4>
<p>&#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE41;&#xE2D;&#xE4A;&#xE1B;&#xE1F;&#xE25;&#xE34;&#xE40;&#xE04;&#xE0A;&#xE31;&#xE48;&#xE19;&#xE02;&#xE22;&#xE32;&#xE22;&#xE15;&#xE31;&#xE27;&#xE2B;&#xE23;&#xE37;&#xE2D;&#xE21;&#xE35;&#xE04;&#xE27;&#xE32;&#xE21;&#xE0B;&#xE31;&#xE1A;&#xE0B;&#xE49;&#xE2D;&#xE19;&#xE2A;&#xE32;&#xE21;&#xE32;&#xE23;&#xE16;&#xE43;&#xE0A;&#xE49;&#xE17;&#xE31;&#xE49;&#xE07; 2 Theme &#xE1E;&#xE23;&#xE49;&#xE2D;&#xE21;&#xE46;&#xE01;&#xE31;&#xE19;&#xE44;&#xE14;&#xE49;&#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE41;&#xE22;&#xE01;&#xE40;&#xE23;&#xE37;&#xE48;&#xE2D;&#xE07;&#xE15;&#xE48;&#xE32;&#xE07;&#xE46;&#xE2D;&#xE2D;&#xE01;&#xE08;&#xE32;&#xE01;&#xE01;&#xE31;&#xE19;</p>
<p><img src="images/visual-color/color-LightTheme04.jpg" alt="Branding">
<img src="images/visual-color/color-LightTheme08.png" alt="Branding"></p>
<h2 id="elevation-and-focused-item">Elevation and Focused item</h2>
<p>&#xE01;&#xE32;&#xE23;&#xE17;&#xE33;&#xE43;&#xE2B;&#xE49; Ui element &#xE21;&#xE35;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE15;&#xE32;&#xE17;&#xE35;&#xE48;&#xE14;&#xE39;&#xE40;&#xE2B;&#xE21;&#xE37;&#xE2D;&#xE19;&#xE19;&#xE39;&#xE19;&#xE2D;&#xE2D;&#xE01;&#xE21;&#xE32;&#xE41;&#xE25;&#xE30;&#xE22;&#xE38;&#xE1A;&#xE25;&#xE07;&#xE44;&#xE1B;&#xE19;&#xE2D;&#xE01;&#xE08;&#xE32;&#xE01;&#xE04;&#xE27;&#xE32;&#xE21;&#xE2A;&#xE27;&#xE22;&#xE07;&#xE32;&#xE21;&#xE41;&#xE25;&#xE49;&#xE27; &#xE22;&#xE31;&#xE07;&#xE0A;&#xE48;&#xE27;&#xE22;&#xE43;&#xE19;&#xE40;&#xE23;&#xE37;&#xE48;&#xE2D;&#xE07;&#xE01;&#xE32;&#xE23;&#xE2A;&#xE37;&#xE48;&#xE2D;&#xE2A;&#xE32;&#xE23;&#xE01;&#xE31;&#xE1A;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE14;&#xE49;&#xE27;&#xE22; &#xE44;&#xE21;&#xE48;&#xE40;&#xE1E;&#xE35;&#xE22;&#xE07;&#xE41;&#xE04;&#xE48;&#xE1A;&#xE2D;&#xE01;&#xE27;&#xE48;&#xE32;&#xE15;&#xE23;&#xE07;&#xE43;&#xE2B;&#xE49;&#xE04;&#xE37;&#xE2D;&#xE1B;&#xE38;&#xE48;&#xE21;&#xE41;&#xE15;&#xE48;&#xE22;&#xE31;&#xE07;&#xE1A;&#xE2D;&#xE01;&#xE44;&#xE14;&#xE49;&#xE2D;&#xE35;&#xE01;&#xE27;&#xE48;&#xE32;&#xE1B;&#xE38;&#xE48;&#xE21;&#xE43;&#xE2B;&#xE49;&#xE16;&#xE39;&#xE01;&#xE01;&#xE14;&#xE2D;&#xE22;&#xE39;&#xE48; &#xE2A;&#xE32;&#xE21;&#xE32;&#xE23;&#xE16;&#xE2A;&#xE23;&#xE49;&#xE32;&#xE07; Visual hierarchy &#xE42;&#xE14;&#xE22;&#xE43;&#xE2B;&#xE49;&#xE40;&#xE19;&#xE37;&#xE49;&#xE2D;&#xE2B;&#xE32;&#xE17;&#xE35;&#xE48;&#xE2D;&#xE22;&#xE39;&#xE48;&#xE1A;&#xE19;&#xE2A;&#xE38;&#xE14;&#xE04;&#xE37;&#xE2D;&#xE40;&#xE19;&#xE37;&#xE48;&#xE2D;&#xE2B;&#xE32;&#xE17;&#xE35;&#xE48;&#xE2A;&#xE33;&#xE04;&#xE31;&#xE0D;&#xE17;&#xE35;&#xE48;&#xE2A;&#xE38;&#xE14; &#xE40;&#xE19;&#xE37;&#xE49;&#xE2D;&#xE2B;&#xE32;&#xE17;&#xE35;&#xE48;&#xE2D;&#xE22;&#xE39;&#xE48;&#xE44;&#xE01;&#xE25;&#xE2D;&#xE2D;&#xE01;&#xE44;&#xE1B;&#xE04;&#xE37;&#xE2D;&#xE2A;&#xE33;&#xE04;&#xE31;&#xE0D;&#xE19;&#xE49;&#xE2D;&#xE22;&#xE25;&#xE07;</p>
<h5 id="elevation-structure"><strong>Elevation structure</strong></h5>
<p><img src="images/visual-color/theme-elevation1.png" alt="Branding"></p>
<p><img src="images/visual-color/theme-elevation4.png" alt="Branding"></p>
<p><strong>A. Ground Level</strong> &#xE1E;&#xE37;&#xE49;&#xE19;&#xE2B;&#xE25;&#xE31;&#xE01;&#xE02;&#xE2D;&#xE07;&#xE15;&#xE31;&#xE27;&#xE41;&#xE2D;&#xE4A;&#xE1B;&#xE1F;&#xE25;&#xE34;&#xE40;&#xE04;&#xE0A;&#xE31;&#xE48;&#xE19;&#xE40;&#xE2D;&#xE32;&#xE44;&#xE27;&#xE49;&#xE27;&#xE32;&#xE07; Ui element &#xE2B;&#xE25;&#xE31;&#xE01;&#xE46; &#xE40;&#xE0A;&#xE48;&#xE19;&#xE0A;&#xE37;&#xE48;&#xE2D;&#xE02;&#xE2D;&#xE07;&#xE41;&#xE2D;&#xE4A;&#xE1B;&#xE1F;&#xE25;&#xE34;&#xE40;&#xE04;&#xE0A;&#xE31;&#xE48;&#xE19;, Page Navigation, Global search &#xE41;&#xE25;&#xE30;&#xE2A;&#xE16;&#xE32;&#xE19;&#xE30;&#xE02;&#xE2D;&#xE07;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;</p>
<p><strong>B. Basement</strong> &#xE2B;&#xE32;&#xE01;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE01;&#xE32;&#xE23;&#xE43;&#xE2B;&#xE49;&#xE40;&#xE01;&#xE34;&#xE14; Visual hierarchy &#xE43;&#xE2B;&#xE49;&#xE43;&#xE0A;&#xE49; Basement &#xE2D;&#xE30;&#xE44;&#xE23;&#xE01;&#xE47;&#xE15;&#xE32;&#xE21;&#xE17;&#xE35;&#xE48;&#xE2D;&#xE22;&#xE39;&#xE48;&#xE1A;&#xE19;&#xE19;&#xE35;&#xE49;&#xE08;&#xE30;&#xE21;&#xE35;&#xE04;&#xE27;&#xE32;&#xE21;&#xE2A;&#xE33;&#xE04;&#xE31;&#xE0D;&#xE19;&#xE49;&#xE2D;&#xE22;&#xE25;&#xE07;&#xE40;&#xE1E;&#xE23;&#xE32;&#xE30;&#xE40;&#xE19;&#xE37;&#xE49;&#xE2D;&#xE2B;&#xE32;&#xE2A;&#xE48;&#xE27;&#xE19;&#xE19;&#xE35;&#xE49;&#xE14;&#xE39;&#xE44;&#xE01;&#xE25;&#xE01;&#xE27;&#xE48;&#xE32; Ground level
&#xE19;&#xE2D;&#xE01;&#xE08;&#xE32;&#xE01;&#xE19;&#xE31;&#xE49;&#xE19;&#xE41;&#xE25;&#xE49;&#xE27;&#xE22;&#xE31;&#xE07;&#xE44;&#xE14;&#xE49; sense &#xE02;&#xE2D;&#xE07;&#xE1E;&#xE37;&#xE49;&#xE19;&#xE17;&#xE35;&#xE48;&#xE27;&#xE48;&#xE32;&#xE07;&#xE41;&#xE25;&#xE30;&#xE25;&#xE14; Visual noise</p>
<p><strong>C. Float</strong> &#xE21;&#xE35;&#xE01;&#xE32;&#xE23;&#xE25;&#xE07;&#xE40;&#xE07;&#xE32;&#xE21;&#xE32;&#xE01;&#xE01;&#xE27;&#xE48;&#xE32; Ui element &#xE2D;&#xE37;&#xE48;&#xE19;&#xE46;&#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE43;&#xE2B;&#xE49;&#xE14;&#xE39;&#xE25;&#xE2D;&#xE22;&#xE2D;&#xE2D;&#xE01;&#xE21;&#xE32;&#xE08;&#xE32;&#xE01; Ground Level &#xE40;&#xE2B;&#xE21;&#xE32;&#xE30;&#xE2A;&#xE33;&#xE2B;&#xE23;&#xE31;&#xE1A; Ui element &#xE17;&#xE35;&#xE48;&#xE21;&#xE35;&#xE01;&#xE32;&#xE23; Toggle &#xE2B;&#xE23;&#xE37;&#xE2D; Floating call-to-action</p>
<ol>
<li><strong>Container on Basement</strong></li>
<li><strong>Selected</strong></li>
<li><strong>Hover</strong></li>
<li><strong>Static</strong></li>
</ol>
<h5 id="active-enable-disable"><strong>Active / Enable / Disable</strong></h5>
<p><img src="images/visual-color/theme-elevation2.png" alt="Branding"></p>
<h5 id="selected-item"><strong>Selected item</strong></h5>
<p>&#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE25;&#xE30;&#xE2A;&#xE32;&#xE22;&#xE15;&#xE32;&#xE2D;&#xE2D;&#xE01;&#xE44;&#xE1B;&#xE08;&#xE32;&#xE01;&#xE23;&#xE32;&#xE22;&#xE01;&#xE32;&#xE23;&#xE44;&#xE1B;&#xE2A;&#xE19;&#xE43;&#xE08;&#xE40;&#xE19;&#xE37;&#xE49;&#xE2D;&#xE2B;&#xE32;&#xE2A;&#xE48;&#xE27;&#xE19;&#xE2D;&#xE37;&#xE48;&#xE19;&#xE41;&#xE25;&#xE49;&#xE27;&#xE01;&#xE25;&#xE31;&#xE1A;&#xE21;&#xE32;&#xE14;&#xE39;&#xE23;&#xE32;&#xE22;&#xE01;&#xE32;&#xE23;&#xE2D;&#xE35;&#xE01;&#xE04;&#xE23;&#xE31;&#xE49;&#xE07; &#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE44;&#xE21;&#xE48;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE40;&#xE2A;&#xE35;&#xE22;&#xE40;&#xE27;&#xE25;&#xE32;&#xE21;&#xE32;&#xE01;&#xE01;&#xE31;&#xE1A;&#xE01;&#xE32;&#xE23;&#xE2B;&#xE32;&#xE23;&#xE32;&#xE22;&#xE01;&#xE32;&#xE23;&#xE17;&#xE35;&#xE48;&#xE40;&#xE25;&#xE37;&#xE2D;&#xE01;&#xE2D;&#xE22;&#xE39;&#xE48; &#xE40;&#xE1E;&#xE23;&#xE32;&#xE30;&#xE23;&#xE32;&#xE22;&#xE01;&#xE32;&#xE23;&#xE17;&#xE35;&#xE48;&#xE40;&#xE25;&#xE37;&#xE2D;&#xE01;&#xE2D;&#xE22;&#xE39;&#xE48;&#xE14;&#xE39;&#xE15;&#xE48;&#xE32;&#xE07;&#xE08;&#xE32;&#xE01;&#xE2D;&#xE31;&#xE19;&#xE2D;&#xE37;&#xE48;&#xE19;&#xE21;&#xE32;&#xE01;</p>
<p><img src="images/visual-color/theme-elevation3.png" alt="Branding"></p>

        </div>
        <div class="footer-nav">
          <div class="left"><a href="guideline-element.html"><span class="title">Element</span></a></div>
          <div class="right"><a href="visual-grid.html"><span class="label">Next: </span><span class="title">Grid</span></a></div>
        </div>
      </div>
    </div>
  </body>
</html>