<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf-8">
    <link rel="stylesheet" href="assets/style.css?t=90051322">
    <link rel="stylesheet" href="https://ricostacruz.com/docpress-rsc/style.css">
    <link rel="stylesheet" href="extra.css?t=5c8ec47c">
    <script src="assets/script.js?t=93f1a66c"></script>
    <title>Colors - Sankom Design</title>
    <meta name="viewport" content="width=device-width">
  </head>
  <body class="-menu-visible">
    <div class="doc-layout">
      <div class="toggle menu-toggle js-menu-toggle"></div>
      <div class="menu toc-menu">
        <ul>
          <li class="menu-item -level-0 -parent">
            <ul class="submenu">
              <li class="menu-item -level-1"><a class="link title  link-index" href="index.html">Sankom Design</a>
              </li>
              <li class="menu-item -level-1"><a class="link title  link-getting-start" href="getting-start.html">Getting Start</a>
              </li>
              <li class="menu-item -level-1"><a class="link title  link-design-principle" href="design-principle.html">Design Principle</a>
              </li>
              <li class="menu-item -level-1 -parent"><span class="title">Guideline</span>
                <ul class="submenu">
                  <li class="menu-item -level-2"><a class="link title  link-guideline-navigation" href="guideline-navigation.html">Navigation</a>
                  </li>
                  <li class="menu-item -level-2"><span class="title">Panel</span>
                  </li>
                  <li class="menu-item -level-2"><a class="link title  link-guideline-element" href="guideline-element.html">Element</a>
                  </li>
                  <li class="menu-item -level-2"><span class="title">Plugin</span>
                  </li>
                  <li class="menu-item -level-2"><span class="title">New Account</span>
                  </li>
                </ul>
              </li>
              <li class="menu-item -level-1 -parent"><span class="title">Visual</span>
                <ul class="submenu">
                  <li class="menu-item -level-2"><a class="link title -active link-visual-color" href="visual-color.html">Colors</a>
                    <ul class="headings heading-list">
                      <li class="heading-item -depth-2"><a class="hlink link-branding-color" href="#branding-color">Branding color</a>
                      </li>
                      <li class="heading-item -depth-2"><a class="hlink link-themes" href="#themes">Themes</a>
                      </li>
                    </ul>
                  </li>
                  <li class="menu-item -level-2"><a class="link title  link-visual-layout" href="visual-layout.html">Layout</a>
                  </li>
                  <li class="menu-item -level-2"><a class="link title  link-visual-font" href="visual-font.html">Fonts</a>
                  </li>
                  <li class="menu-item -level-2"><span class="title">Icon</span>
                  </li>
                </ul>
              </li>
              <li class="menu-item -level-1"><a class="link title  link-contribute" href="contribute.html">Contribute</a>
              </li>
            </ul>
          </li>
        </ul>
      </div>
      <div class="body page-visual-color">
        <div class="header-nav">
          <div class="right"><a class="iconlink" href="https://github.com/sankomdesign/guideline" data-title="sankomdesign/guideline">
              <!-- span.title Open in GitHub--><span class="icon -github"></span></a>
          </div>
        </div>
        <div class="markdown-body"><h1 id="colors">Colors</h1>
<p>&#xE2A;&#xE35;&#xE17;&#xE35;&#xE48;&#xE19;&#xE33;&#xE21;&#xE32;&#xE43;&#xE0A;&#xE49;&#xE2A;&#xE23;&#xE49;&#xE32;&#xE07; User interface &#xE44;&#xE21;&#xE48;&#xE40;&#xE1E;&#xE35;&#xE22;&#xE07;&#xE41;&#xE04;&#xE48;&#xE2A;&#xE37;&#xE48;&#xE2D;&#xE2A;&#xE32;&#xE23;&#xE14;&#xE49;&#xE32;&#xE19;&#xE04;&#xE27;&#xE32;&#xE21;&#xE2A;&#xE27;&#xE22;&#xE07;&#xE32;&#xE19;&#xE41;&#xE25;&#xE30; Branding &#xE40;&#xE17;&#xE48;&#xE32;&#xE19;&#xE31;&#xE49;&#xE19; &#xE41;&#xE15;&#xE48;&#xE22;&#xE31;&#xE07;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE2A;&#xE37;&#xE2D;&#xE2A;&#xE32;&#xE23;&#xE04;&#xE27;&#xE32;&#xE21;&#xE2B;&#xE21;&#xE32;&#xE22;&#xE1E;&#xE34;&#xE40;&#xE28;&#xE29;&#xE1A;&#xE32;&#xE07;&#xE2D;&#xE22;&#xE48;&#xE32;&#xE07;&#xE17;&#xE35;&#xE48;&#xE21;&#xE35;&#xE04;&#xE27;&#xE32;&#xE21;&#xE40;&#xE01;&#xE35;&#xE48;&#xE22;&#xE27;&#xE02;&#xE49;&#xE2D;&#xE07;&#xE01;&#xE31;&#xE1A;&#xE40;&#xE2B;&#xE15;&#xE38;&#xE01;&#xE32;&#xE23;&#xE13;&#xE4C;&#xE17;&#xE35;&#xE48;&#xE21;&#xE35;&#xE1C;&#xE25;&#xE01;&#xE23;&#xE30;&#xE17;&#xE1A;&#xE42;&#xE14;&#xE22;&#xE15;&#xE23;&#xE07;&#xE01;&#xE31;&#xE1A;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE43;&#xE19;&#xE02;&#xE13;&#xE30;&#xE19;&#xE31;&#xE49;&#xE19;&#xE14;&#xE49;&#xE27;&#xE22;</p>
<h5 id="1.-branding-(corporate)-color">1. Branding (Corporate) color</h5>
<h5 id="2.-user-interface-color">2. User Interface color</h5>
<h2 id="branding-color">Branding color</h2>
<p><img src="images/visual-color/01.jpg" alt="Branding">
<img src="images/visual-color/02.jpg" alt="Branding"></p>
<h5 id="tech-bi-blue-(dim-version)">Tech-BI Blue (Dim version)</h5>
<ul>
<li>#001326</li>
<li>#00254D</li>
</ul>
<p>&#xE0A;&#xE38;&#xE14;&#xE2A;&#xE35;&#xE17;&#xE35;&#xE48;&#xE40;&#xE01;&#xE35;&#xE48;&#xE22;&#xE27;&#xE02;&#xE49;&#xE2D;&#xE07;&#xE01;&#xE31;&#xE1A;&#xE42;&#xE25;&#xE42;&#xE01;&#xE49;&#xE04;&#xE37;&#xE2D; &#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE44;&#xE23;&#xE01;&#xE47;&#xE15;&#xE32;&#xE21;&#xE17;&#xE35;&#xE48; Panal &#xE43;&#xE14;&#xE46;&#xE2B;&#xE32;&#xE01;&#xE21;&#xE35;&#xE42;&#xE25;&#xE42;&#xE01;&#xE49;&#xE2D;&#xE22;&#xE39;&#xE48;&#xE2D;&#xE19;&#xE38;&#xE0D;&#xE32;&#xE15;&#xE34;&#xE43;&#xE2B;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE44;&#xE14;&#xE49;&#xE40;&#xE1E;&#xE35;&#xE22;&#xE07; 2 &#xE2A;&#xE35;&#xE17;&#xE35;&#xE48;&#xE01;&#xE33;&#xE2B;&#xE21;&#xE14;&#xE44;&#xE27;&#xE49;&#xE40;&#xE17;&#xE48;&#xE32;&#xE19;&#xE31;&#xE49;&#xE19;
&#xE2A;&#xE35;&#xE19;&#xE49;&#xE33;&#xE40;&#xE07;&#xE34;&#xE19;&#xE17;&#xE35;&#xE48;&#xE40;&#xE2B;&#xE25;&#xE37;&#xE2D;&#xE19;&#xE31;&#xE49;&#xE19; (Tint and shade) &#xE2B;&#xE32;&#xE01;&#xE44;&#xE21;&#xE48;&#xE21;&#xE35;&#xE42;&#xE25;&#xE42;&#xE01;&#xE49;&#xE2D;&#xE22;&#xE39;&#xE48;&#xE2A;&#xE32;&#xE21;&#xE32;&#xE23;&#xE16;&#xE43;&#xE0A;&#xE49;&#xE44;&#xE1B;&#xE1B;&#xE23;&#xE30;&#xE01;&#xE2D;&#xE1A;&#xE40;&#xE1B;&#xE47;&#xE19; User interface element &#xE44;&#xE14;&#xE49;</p>
<p><img src="images/visual-color/03.jpg" alt="Branding">
<img src="images/visual-color/04.jpg" alt="Branding"></p>
<p>&#xE01;&#xE32;&#xE23;&#xE15;&#xE31;&#xE14;&#xE2A;&#xE34;&#xE19;&#xE43;&#xE08;&#xE43;&#xE0A;&#xE49;&#xE2A;&#xE35;&#xE1E;&#xE37;&#xE49;&#xE19;&#xE2B;&#xE25;&#xE31;&#xE07;&#xE02;&#xE2D;&#xE07; Ui element &#xE15;&#xE48;&#xE32;&#xE07;&#xE46;&#xE43;&#xE2B;&#xE49;&#xE04;&#xE33;&#xE19;&#xE36;&#xE07;&#xE16;&#xE36;&#xE07; contrast &#xE41;&#xE25;&#xE30; legibility &#xE40;&#xE1B;&#xE47;&#xE19;&#xE2B;&#xE25;&#xE31;&#xE01;
&#xE15;&#xE31;&#xE27;&#xE2D;&#xE22;&#xE48;&#xE32;&#xE07;&#xE14;&#xE49;&#xE32;&#xE19;&#xE1A;&#xE19;&#xE17;&#xE31;&#xE49;&#xE07;&#xE2B;&#xE21;&#xE14;&#xE2A;&#xE32;&#xE21;&#xE32;&#xE23;&#xE16;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE44;&#xE14;&#xE49;&#xE21;&#xE35; contrast &#xE17;&#xE35;&#xE48;&#xE2A;&#xE39;&#xE07;&#xE41;&#xE25;&#xE30;&#xE2D;&#xE48;&#xE32;&#xE19;&#xE44;&#xE14;&#xE49;&#xE07;&#xE48;&#xE32;&#xE22; &#xE40;&#xE27;&#xE49;&#xE19; ui element &#xE1A;&#xE32;&#xE07;&#xE15;&#xE31;&#xE27;&#xE17;&#xE35;&#xE48;&#xE21;&#xE35; contrast &#xE15;&#xE48;&#xE33;&#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE2A;&#xE37;&#xE2D;&#xE2A;&#xE32;&#xE23;&#xE43;&#xE2B;&#xE49;&#xE23;&#xE31;&#xE1A;&#xE23;&#xE39;&#xE49;&#xE27;&#xE48;&#xE32;&#xE40;&#xE04;&#xE22;&#xE01;&#xE14;&#xE44;&#xE14;&#xE49;&#xE41;&#xE15;&#xE48;&#xE22;&#xE31;&#xE07;&#xE44;&#xE21;&#xE48;&#xE43;&#xE0A;&#xE48;&#xE15;&#xE2D;&#xE19;&#xE19;&#xE35;&#xE49;</p>
<p><img src="images/visual-color/05.jpg" alt="Branding">
&#xE01;&#xE32;&#xE23;&#xE15;&#xE31;&#xE14;&#xE2A;&#xE34;&#xE19;&#xE43;&#xE08;&#xE43;&#xE0A;&#xE49;&#xE2A;&#xE35;&#xE15;&#xE48;&#xE32;&#xE07;&#xE46;&#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE2A;&#xE23;&#xE49;&#xE32;&#xE07; Ui element &#xE43;&#xE2B;&#xE49;&#xE04;&#xE33;&#xE19;&#xE36;&#xE07;&#xE16;&#xE36;&#xE07; interaction &#xE40;&#xE1B;&#xE47;&#xE19;&#xE2D;&#xE31;&#xE19;&#xE14;&#xE31;&#xE1A;&#xE41;&#xE23;&#xE01;&#xE42;&#xE14;&#xE22;&#xE40;&#xE01;&#xE47;&#xE1A;&#xE2A;&#xE35; Primary &#xE44;&#xE27;&#xE49;&#xE43;&#xE2B;&#xE49;&#xE01;&#xE31;&#xE1A; element &#xE17;&#xE35;&#xE48;&#xE40;&#xE01;&#xE35;&#xE48;&#xE22;&#xE27;&#xE02;&#xE49;&#xE2D;&#xE07;&#xE01;&#xE31;&#xE1A;&#xE01;&#xE32;&#xE23;&#xE17;&#xE33; Primary task &#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE01;&#xE32;&#xE23;&#xE2A;&#xE37;&#xE48;&#xE2D;&#xE2A;&#xE32;&#xE23;&#xE17;&#xE35;&#xE48;&#xE0A;&#xE31;&#xE14;&#xE40;&#xE08;&#xE19;&#xE27;&#xE48;&#xE32;&#xE43;&#xE19;&#xE02;&#xE13;&#xE30;&#xE46; &#xE41;&#xE2D;&#xE1F;&#xE25;&#xE34;&#xE40;&#xE04;&#xE0A;&#xE31;&#xE48;&#xE19;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE01;&#xE32;&#xE23;&#xE43;&#xE2B;&#xE49;&#xE17;&#xE33;&#xE2D;&#xE30;&#xE44;&#xE23;</p>
<h2 id="themes">Themes</h2>
<p><img src="images/visual-color/color-theme.png" alt="Branding"></p>
<p>&#xE2A;&#xE35;&#xE17;&#xE35;&#xE48;&#xE43;&#xE0A;&#xE49;&#xE1B;&#xE23;&#xE30;&#xE01;&#xE2D;&#xE1A;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE41;&#xE2D;&#xE1F;&#xE1F;&#xE25;&#xE34;&#xE40;&#xE04;&#xE0A;&#xE31;&#xE48;&#xE19;&#xE2A;&#xE32;&#xE21;&#xE32;&#xE23;&#xE16;&#xE40;&#xE25;&#xE37;&#xE2D;&#xE01;&#xE43;&#xE0A;&#xE49;&#xE44;&#xE14;&#xE49;&#xE17;&#xE31;&#xE49;&#xE07; 2 theme &#xE1E;&#xE23;&#xE49;&#xE2D;&#xE21;&#xE46;&#xE01;&#xE31;&#xE19;&#xE43;&#xE19;&#xE41;&#xE2D;&#xE1F;&#xE1F;&#xE25;&#xE34;&#xE40;&#xE04;&#xE0A;&#xE31;&#xE48;&#xE19;&#xE40;&#xE14;&#xE35;&#xE22;&#xE27;&#xE01;&#xE31;&#xE19;  &#xE22;&#xE01;&#xE15;&#xE31;&#xE27;&#xE2D;&#xE22;&#xE48;&#xE32;&#xE07;&#xE40;&#xE0A;&#xE48;&#xE19; Light theme - &#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE25;&#xE47;&#xE2D;&#xE01;&#xE2D;&#xE34;&#xE19;&#xE40;&#xE02;&#xE49;&#xE32;&#xE21;&#xE32;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE1C;&#xE39;&#xE49;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19; &#xE2B;&#xE23;&#xE37;&#xE2D; Dark theme - &#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE25;&#xE47;&#xE2D;&#xE01;&#xE2D;&#xE34;&#xE19;&#xE40;&#xE02;&#xE49;&#xE32;&#xE21;&#xE32;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE1C;&#xE39;&#xE49;&#xE14;&#xE39;&#xE41;&#xE25;&#xE23;&#xE30;&#xE1A;&#xE1A; &#xE2B;&#xE23;&#xE37;&#xE2D;&#xE43;&#xE0A;&#xE49;&#xE17;&#xE31;&#xE49;&#xE07; 2 theme &#xE1E;&#xE23;&#xE49;&#xE2D;&#xE21;&#xE46;&#xE01;&#xE31;&#xE19;&#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE01;&#xE32;&#xE23;&#xE43;&#xE2B;&#xE49;&#xE41;&#xE2D;&#xE1F;&#xE1F;&#xE25;&#xE34;&#xE40;&#xE04;&#xE0A;&#xE31;&#xE48;&#xE19;&#xE21;&#xE35; Contrast &#xE15;&#xE48;&#xE32;&#xE07;&#xE01;&#xE31;&#xE19;&#xE21;&#xE32;&#xE01;&#xE46;&#xE43;&#xE19;&#xE41;&#xE15;&#xE48;&#xE25;&#xE30; element &#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE2A;&#xE23;&#xE49;&#xE32;&#xE07; visual hierarchy</p>
<p><img src="images/visual-color/color-LightTheme01.png" alt="Branding">
<img src="images/visual-color/color-LightTheme02.png" alt="Branding">
<img src="images/visual-color/color-LightTheme03.png" alt="Branding">
&#xE15;&#xE31;&#xE27;&#xE2D;&#xE22;&#xE48;&#xE32;&#xE07;&#xE01;&#xE32;&#xE23;&#xE43;&#xE0A;&#xE49;&#xE07;&#xE32;&#xE19;&#xE40;&#xE21;&#xE37;&#xE48;&#xE2D;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE01;&#xE32;&#xE23;&#xE43;&#xE2B;&#xE49; element &#xE43;&#xE14;&#xE46; &#xE19;&#xE31;&#xE49;&#xE19;&#xE42;&#xE14;&#xE14;&#xE40;&#xE14;&#xE48;&#xE19;&#xE2D;&#xE2D;&#xE01;&#xE21;&#xE32;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE08;&#xE38;&#xE14;&#xE2A;&#xE19;&#xE43;&#xE08;</p>
<p><img src="images/visual-color/color-LightTheme04.jpg" alt="Branding">
<img src="images/visual-color/color-LightTheme05.jpg" alt="Branding"></p>

        </div>
        <div class="footer-nav">
          <div class="left"><a href="guideline-element.html"><span class="title">Element</span></a></div>
          <div class="right"><a href="visual-layout.html"><span class="label">Next: </span><span class="title">Layout</span></a></div>
        </div>
      </div>
    </div>
  </body>
</html>